{"train": [{"img_path": "cloth_store_1498649_woman_5_3.png", "boxes": [[954, 275, 85, 408]], "captions": ["The dark pink on on the back right of the center floor rack."]}, {"img_path": "cloth_store_1498649_woman_5_8.png", "boxes": [[1701, 353, 149, 162]], "captions": [" the black jacket hanging on the bottom right of the wall to my cart."]}, {"img_path": "cloth_store_1498649_woman_5_9.png", "boxes": [[762, 317, 110, 160], [861, 491, 110, 311]], "captions": ["The one on the wall in back.", " that blouse on the other sid of the floor rack please."]}, {"img_path": "cloth_store_1498649_woman_5_6.png", "boxes": [[1268, 480, 48, 141]], "captions": ["t the red, white, and yellow blouse  against the left wall to the very back."]}, {"img_path": "cloth_store_1498649_woman_5_10.png", "boxes": [[826, 608, 170, 49]], "captions": ["Hm, still thinking on it.  that olive and white shirt on the furthest back of the table."]}, {"img_path": "cloth_store_1498649_woman_5_4.png", "boxes": [[811, 271, 304, 642]], "captions": [" the right-most red, white and yellow blouse on the display rack."]}, {"img_path": "cloth_store_1498649_woman_5_2.png", "boxes": [[378, 441, 79, 197], [951, 376, 96, 539], [1254, 493, 40, 229]], "captions": [" something with a similar price as that dark blue pair of jeans on the right side of the wall, but in leather and sleeveless.", " put the green, violet, and pink blouse from the back side of the front rack in my cart for me?", "I'l take that striped one on the rack."]}, {"img_path": "cloth_store_1498649_woman_5_5.png", "boxes": [[375, 139, 159, 247]], "captions": ["Then how about if there's anything with a similar pattern and sleeve length to that black coat against the wall to the left, but with good ratings?"]}, {"img_path": "cloth_store_1416238_woman_20_0.png", "boxes": [[474, 484, 63, 309]], "captions": ["The one on the bottom left against the wall."]}, {"img_path": "cloth_store_1416238_woman_20_9.png", "boxes": [[1034, 466, 40, 109], [997, 808, 123, 151], [1262, 885, 69, 96], [1142, 923, 48, 80]], "captions": ["Sure, I am looking at the brown tshirt on the right in the bottom row on the wall.", "Ok, do you have any like that other  one you showed me on the round rack? Maybe in the same price range, but from Coats & More. And green instead of maroon.", " that gray one on the rack please.", "No, I'm good, thanks.  drop that red and white blouse from the rack right next to us into my cart."]}, {"img_path": "cloth_store_1416238_woman_20_1.png", "boxes": [[852, 301, 101, 287], [1, 672, 209, 281], [1439, 781, 240, 222]], "captions": ["The last one in the third cubicle, do you have anything like that?", " this green hoodie on the rack on the left.", " these light blue jeans on the far right of the wall display."]}, {"img_path": "cloth_store_1416238_woman_20_3.png", "boxes": [[999, 244, 113, 357]], "captions": ["OK, I am looking at the grey and white jacket that hangs second from the right in the third compartment from the right."]}, {"img_path": "cloth_store_1416238_woman_20_10.png", "boxes": [[455, 847, 164, 100], [529, 910, 177, 93]], "captions": [" add that yellow t shirt from the top row of the table display to my cart?", " get me the price of the pink sweater that's on the back table, the third from the left on the front row?"]}, {"img_path": "cloth_store_1416238_woman_2_11.png", "boxes": [[1235, 828, 142, 74], [1440, 844, 134, 59]], "captions": ["Hang on actually do you think you could look for a solid yellow shirt like that one on the table but with long sleeves?", "I think instead I'll buy the olive and white shirt that's folded up on the front row of the table, on the far right side."]}, {"img_path": "cloth_store_1416238_woman_2_4.png", "boxes": [[538, 602, 139, 269]], "captions": ["The green pair of pants in the second cubby from the right."]}, {"img_path": "cloth_store_1416238_woman_2_6.png", "boxes": [[1025, 171, 120, 316], [879, 268, 59, 191], [315, 822, 155, 71]], "captions": ["I am referring to the black coat on the right of the top row against the wall.", "The black blouse hanging on the wall in the top left corner.", "The purple dress on the rack."]}, {"img_path": "cloth_store_1416238_woman_2_0.png", "boxes": [[85, 618, 174, 312]], "captions": ["The green pants on the far left end of the shelf."]}, {"img_path": "cloth_store_1416238_woman_2_2.png", "boxes": [[1787, 833, 97, 66]], "captions": ["That yellow one on the table."]}, {"img_path": "cloth_store_1416238_woman_20_4.png", "boxes": [[920, 378, 13, 137], [821, 426, 43, 199], [820, 449, 24, 198], [1263, 716, 156, 249]], "captions": ["The black one at the top right of the wall.", "The blue one on the left wall in the third cabinet from me.", "The one in the cabinet, .", "The Christmas sweater on the rack, ."]}, {"img_path": "cloth_store_1416238_woman_20_8.png", "boxes": [[1065, 365, 58, 290], [1083, 695, 173, 308]], "captions": ["The grey and white jacket in the third cubby from the right.", "The grey pair of pants in the third cubby from the right."]}, {"img_path": "cloth_store_1416238_woman_20_7.png", "boxes": [[867, 420, 33, 224]], "captions": ["The one hanging in the middle of the left shelf."]}, {"img_path": "cloth_store_1416238_woman_20_11.png", "boxes": [[622, 384, 54, 197]], "captions": [" that jacket in the third cubicle."]}, {"img_path": "cloth_store_1416238_woman_2_1.png", "boxes": [[981, 750, 211, 253], [1191, 809, 140, 192]], "captions": ["The one on the rack, next to the brown one.", "Do you have something with a similar rating and available sizes as the black blouse on the rack?"]}, {"img_path": "cloth_store_1416238_woman_2_5.png", "boxes": [[1363, 461, 147, 359]], "captions": ["The one that's hanging on the right wall."]}, {"img_path": "cloth_store_1498649_woman_3_0.png", "boxes": [[580, 415, 14, 200], [1504, 492, 119, 24], [1622, 575, 143, 32]], "captions": [" one of the black blouse on the main rack.", "The purple sweater on the middle shelf of the display table.", " something like the green sweater folded on the bottom tier of the shelf on the right, except with short sleeves and a good rating."]}, {"img_path": "cloth_store_1498649_woman_3_3.png", "boxes": [[156, 1, 287, 451], [488, 66, 215, 383], [867, 259, 103, 159]], "captions": [" the black dress on the top left of the wall to my cart.", "The one the left wall.", "The one on the top right of the wall."]}, {"img_path": "cloth_store_1498649_woman_3_9.png", "boxes": [[147, 186, 75, 286], [392, 482, 95, 266]], "captions": [" to see options with similar sizing and pricing as the one on the wall but with full sleeves and good ratings.", "Let's go ahead and get the brown jacket on the bottom rack."]}, {"img_path": "cloth_store_1498649_woman_3_5.png", "boxes": [[330, 216, 69, 163], [1285, 171, 90, 163], [1028, 236, 311, 611], [1466, 385, 160, 282], [683, 244, 357, 643]], "captions": ["The one on the left wall. It is towards the back.", "I just noticed the black jacket at the far end on the right wall, can you put it in my cart please?", " add to my cart the black dress that you showed me on the right side of the center rack?", "The one on the right wall on the bottom row.", "I am referring to the blue jacket on the rack in the middle of the room."]}, {"img_path": "cloth_store_1498649_woman_3_6.png", "boxes": [[878, 382, 262, 168]], "captions": ["I'l take the black one hanging on the front rack actually."]}, {"img_path": "cloth_store_1416238_woman_1_11.png", "boxes": [[329, 187, 94, 179], [339, 563, 116, 171]], "captions": [" also add the black blouse on the wall to my cart?", " the tank top that is yellow and white in the last section of the first wall unit."]}, {"img_path": "cloth_store_1416238_woman_17_3.png", "boxes": [[730, 307, 42, 231]], "captions": ["I'm looking at the cubicles against the wall. The white and black blouse is in the top row, second from the right, just below the shoes."]}, {"img_path": "cloth_store_1416238_woman_1_9.png", "boxes": [[1066, 372, 165, 302], [1627, 361, 102, 343], [335, 781, 177, 222], [1332, 749, 185, 254]], "captions": [" the dark grey blouse on the left of the right wall display.", " this black sweater that's second from the right on the right wall display.", "I am referring to the black jacket on the left wall.", " something else with a similar pattern as that dark blue pair in the right cubby."]}, {"img_path": "cloth_store_1416238_woman_16_1.png", "boxes": [[1138, 38, 150, 356], [1442, 673, 128, 53], [1559, 735, 145, 61]], "captions": ["I'm looking at the black coat on the wall that you just pointed out.", "Okay well go ahead and stick one of those grey sweaters at the end of that table in my cart too.", " add the violet shirt folded on the right side of the table to my cart?"]}, {"img_path": "cloth_store_1416238_woman_10_5.png", "boxes": [[1099, 372, 80, 256], [1776, 681, 108, 260], [926, 719, 88, 284]], "captions": ["Will you add the black blouse from the middle shelf to my cart?", "What do you have like the one on the floor stand?", " to get those jeans in the second cabinet please."]}, {"img_path": "cloth_store_1416238_woman_10_9.png", "boxes": [[1629, 443, 37, 156], [1694, 406, 82, 205], [1176, 768, 216, 235], [1384, 785, 109, 218]], "captions": ["I'll have to think more about it. In the meantime, could you please add that black sweater on the right wall to my cart?", " to see something like that black one in the cabinet, also in black, but a S.", " something like that green hoodie on the circular display/", "The black one on the circular rack up front and center. It's next to a pink shirt."]}, {"img_path": "cloth_store_1416238_woman_18_3.png", "boxes": [[944, 304, 113, 177]], "captions": ["The green one on the wall to the left."]}, {"img_path": "cloth_store_1416238_woman_18_11.png", "boxes": [[391, 341, 77, 211], [515, 377, 40, 161], [1651, 334, 79, 331]], "captions": ["The white and black blouse in the cubby on the left.", "Do you something with the reviews and sleeve length of that pink sweater in the second to last cubicle on the left?", " to buy the one from the right wall."]}, {"img_path": "cloth_store_1416238_woman_11_0.png", "boxes": [[1, 343, 184, 335]], "captions": ["The one on the front left closet."]}, {"img_path": "cloth_store_1416238_woman_11_3.png", "boxes": [[972, 237, 60, 151]], "captions": ["That's alright. That grey and white blouse on the wall caught my eye, do you have anything similar to it that's expensive enough to impress my boss?"]}, {"img_path": "cloth_store_1416238_woman_18_1.png", "boxes": [[600, 387, 111, 254], [722, 636, 272, 367]], "captions": ["The grey dress which you showed me earlier. It is hanging on the wall.", "I think I'd rather look at a dress. Do you have more with similar sleeves and color to the grey one facing away from me on this rack here in front?"]}, {"img_path": "cloth_store_1416238_woman_10_6.png", "boxes": [[248, 775, 148, 72], [1627, 636, 186, 348]], "captions": ["I love this maroon shirt on the table to the left, right up front.  Can I get one of those in my cart please?", "The dark green joggers in the closet."]}, {"img_path": "cloth_store_1416238_woman_11_2.png", "boxes": [[584, 231, 37, 151], [947, 550, 100, 348], [894, 578, 160, 282], [1041, 571, 164, 293]], "captions": ["I will also buy the white tshirt in the top row on the wall on the left.", "The black dress on the middle rack.", "You know what, I also want one of those dark grey coats on the round rack in the middle of the room please.", "OK, I am buying the black jacket on the floor rack in the middle, please move it into my cart."]}, {"img_path": "cloth_store_1416238_woman_11_1.png", "boxes": [[891, 388, 30, 140], [1213, 527, 22, 230], [1676, 864, 57, 127]], "captions": ["The black blouse at the bottom of the left wall display.", "The black and olive dress on the left side of the center rack.", "Let me also get the black sweater off the back of the carousel."]}, {"img_path": "cloth_store_1416238_woman_15_7.png", "boxes": [[1023, 312, 39, 170], [188, 746, 116, 25], [71, 792, 162, 46]], "captions": ["The black coat on the right wall.", "The yellow and black sweater folded on the right of the table.", "The grey sweater folded in the front middle of the table in the back left."]}, {"img_path": "cloth_store_1416238_woman_12_3.png", "boxes": [[985, 631, 127, 329], [1610, 780, 207, 86]], "captions": ["The dark green joggers on the bottom right of the shelf.", "The red one on the table."]}, {"img_path": "cloth_store_1416238_woman_17_1.png", "boxes": [[865, 289, 83, 285], [924, 332, 61, 207], [945, 342, 41, 217], [1688, 417, 196, 332], [213, 681, 57, 106]], "captions": ["How much is that black dress in the center cubby and who makes it?", "What's the size and rating for the one I looked at in the second cubicle from the right?", " the second blouse in the cubicle.", " place the black jacket on the wall to my cart?", "The red and white blouse on the second floor stand."]}, {"img_path": "cloth_store_1416238_woman_18_7.png", "boxes": [[1, 148, 173, 256], [873, 327, 144, 250], [1, 867, 203, 136]], "captions": [" to see something with similar sleeves as the green and violet one up on the wall.", "The black sweater on the shelf straight ahead.", "That's OK.  to buy the maroon dress on  the floor rack on our left, so please put it into my cart."]}, {"img_path": "cloth_store_1416238_woman_16_11.png", "boxes": [[1553, 668, 40, 306], [1793, 639, 50, 364]], "captions": ["I like that black dress in the middle on the left side of the hanging rack. Do you have anything in that same size and pattern?", "That black and grey one on the right-hand side of the rack on the right."]}, {"img_path": "cloth_store_1416238_woman_16_5.png", "boxes": [[1085, 315, 90, 320], [1152, 314, 56, 324]], "captions": ["The light grey jacket. It is in the middle left cubicle right next to the multi colored blouse.", " show me something with a similar color and cost as the light grey coat on the right shelf, but with long sleeves?"]}, {"img_path": "cloth_store_1416238_woman_11_7.png", "boxes": [[482, 296, 105, 347]], "captions": ["Do you have something else with a similar pattern as the white and black one in the second cubby from the left?"]}, {"img_path": "cloth_store_1416238_woman_14_9.png", "boxes": [[1, 94, 605, 909], [1856, 462, 18, 150]], "captions": [" the maroon white and blue blouse in the left shelf display.", " add the maroon, white, and blue blouse on the bottom left of the back wall to my cart?"]}, {"img_path": "cloth_store_1416238_woman_13_1.png", "boxes": [[826, 180, 41, 168], [1673, 215, 84, 137], [1209, 512, 32, 230], [1734, 841, 150, 152]], "captions": [" the brown jacket on the back left wall to my cart.", "I'm actually more interested in the white blouse hanging on the wall to the far left. Do you have any in a similar size and patter for a good price?", "Do you have anything with a similar price and sleeve length to the black dress on the left side of the rack in the middle of the room?", " the black one on the rack."]}, {"img_path": "cloth_store_1416238_woman_13_8.png", "boxes": [[956, 735, 82, 44], [1640, 803, 55, 200]], "captions": ["What about something kinda like that light red shirt towards the back end of the table, but with better reviews?", " to buy the one on the right side of the rack."]}, {"img_path": "cloth_store_1416238_woman_15_4.png", "boxes": [[394, 123, 130, 839], [1041, 227, 91, 551]], "captions": ["Is there something similar in sleeve length to the black blouse hanging in the left of the leftmost cubby?", " the first blouse in the third cubicle."]}, {"img_path": "cloth_store_1416238_woman_15_5.png", "boxes": [[1579, 605, 107, 278]], "captions": ["The dark ones in the middle of the shelves on the right."]}, {"img_path": "cloth_store_1416238_woman_13_9.png", "boxes": [[609, 668, 189, 335]], "captions": ["I am referring to the blue jacket on the rack."]}, {"img_path": "cloth_store_1416238_woman_14_11.png", "boxes": [[259, 234, 94, 226], [1231, 466, 42, 195], [1353, 467, 75, 266], [261, 755, 143, 41]], "captions": ["The one I added to my cart earlier, on the left wall.", "Do you also have something with a similar pattern as the violet one to the left of the grey shirt on the right wall? But with high reviews and violet still, please.", " the purple dress on the right wall display.", " to see more sweaters in the same color as the maroon one from the table."]}, {"img_path": "cloth_store_1416238_woman_14_0.png", "boxes": [[928, 289, 128, 401], [1145, 325, 115, 347], [1279, 653, 50, 268], [1137, 688, 79, 315]], "captions": [" the coat in the cubicle.", "Do you have a similar brand and pattern for the dress in the second cubicle, center row?", "The trousers in the third cubicle on the bottom.", "The light blue jeans on the bottom shelf to the left?"]}, {"img_path": "cloth_store_1416238_woman_17_2.png", "boxes": [[428, 609, 21, 225], [1066, 625, 73, 236], [113, 746, 111, 32], [650, 736, 76, 203], [726, 768, 36, 76]], "captions": ["The back and olive dress on the rack in back.", "Go ahead and add the green pants in the back right cubby to my cart.", "The blue grey one on the closer table.", "Ok, I'll think about those. For now, do you have anything with a similar brand and color to that grey coat on the back of the front floor rack?", "Do you have anything like the one in the back of the first floor stand in color and available sizes but with better ratings?"]}, {"img_path": "cloth_store_1416238_woman_17_11.png", "boxes": [[444, 630, 37, 234]], "captions": [" the grey trousers in the left shelf display, second from the bottom left."]}, {"img_path": "cloth_store_1416238_woman_17_8.png", "boxes": [[631, 419, 71, 219]], "captions": ["The black blouse on the left end of the shelf."]}, {"img_path": "cloth_store_1416238_woman_10_8.png", "boxes": [[978, 336, 84, 297]], "captions": ["Nice! Also, what can you show me with sleeve length and price like the brown jacket  on the left in the cupboard by the door, but in a small size and with some sort of design?"]}, {"img_path": "cloth_store_1416238_woman_10_10.png", "boxes": [[896, 669, 105, 260], [1289, 820, 33, 27]], "captions": ["The blue ones in the fourth cubicle.", "Hm, it's an option. Let me think on it. Those shoes, though, caught my eye! Do you have anything like that pair over in the display cases to the right, second slot? Oh, but let's go for size M."]}, {"img_path": "cloth_store_1416238_woman_13_4.png", "boxes": [[1659, 530, 51, 180], [1103, 559, 101, 233], [1558, 736, 326, 267], [1687, 746, 185, 257], [1812, 807, 72, 196], [576, 897, 30, 106]], "captions": ["Will you add the dark blue jeans in the back right shelf to my cart?", "The second cubicle from the left, on the bottom.", " the green hoodie from the carousel, please.", " the blouse from the carousel, then.", " one of the black and white blouse on the rack to the right.", "Okay, I'll just take the brown black dress on the center rack."]}, {"img_path": "cloth_store_1416238_woman_12_2.png", "boxes": [[1214, 716, 91, 63], [297, 641, 146, 308], [1145, 733, 106, 46]], "captions": ["I'm also interested in something kind of like the light grey shirt that's on the front row of the table in terms of sleeves and size.", "Is there anything like the blue and black jeans in the second compartment from the left in available sizes, but made by Ocean Wears in size XL.", "I am referring to the brown shirt on the table."]}, {"img_path": "cloth_store_1416238_woman_14_6.png", "boxes": [[435, 226, 143, 256], [529, 868, 157, 81], [300, 952, 175, 51]], "captions": ["The one on the wall in the middle of the top row.", " the sweater from the back row on the table, the third one.", " that black and grey sweater folded on the table to the left."]}, {"img_path": "cloth_store_1416238_woman_12_4.png", "boxes": [[770, 346, 61, 342], [776, 718, 71, 285]], "captions": [" add the black blouse on the center-right top shelf to my cart?", " the green trousers at the bottom of the shelf display."]}, {"img_path": "cloth_store_1416238_woman_15_8.png", "boxes": [[929, 399, 51, 213]], "captions": [" the pink sweater hanging in the bottom row on the wall."]}, {"img_path": "cloth_store_1416238_woman_17_6.png", "boxes": [[494, 166, 148, 591]], "captions": [" the one in the middle cabinet.   that to my cart."]}, {"img_path": "cloth_store_1416238_woman_17_7.png", "boxes": [[277, 211, 172, 776], [1403, 796, 127, 60], [1403, 831, 121, 54]], "captions": ["The white and black one in the back of the first cabinet.", "I am referring to the blue sweater on the table.", "The white shirt in the middle of the bottom row of the table."]}, {"img_path": "cloth_store_1416238_woman_17_5.png", "boxes": [[103, 829, 165, 174]], "captions": ["Could I get the brand and size of the the gray and white top on the rack?"]}, {"img_path": "cloth_store_1416238_woman_1_4.png", "boxes": [[1, 853, 134, 60], [1, 886, 134, 80]], "captions": [" the third one on that rack, the purple shirt.", "The blue sweater folded on the left table."]}, {"img_path": "cloth_store_1416238_woman_15_6.png", "boxes": [[1727, 319, 86, 166], [1324, 391, 118, 288], [1307, 405, 93, 260], [1806, 493, 78, 186]], "captions": [" something else with a similar size and price as the black one on the wall but made by Downtown Consignment with good ratings.", "The black jacket in the cubby.", " add the black blouse on the top center-right shelf of the right wardrobe to my cart?", "That funky multicolored thing hanging against the wall to the far right."]}, {"img_path": "cloth_store_1416238_woman_1_7.png", "boxes": [[894, 895, 82, 99]], "captions": ["Sorry I'm looking at a brown jacket on the same rack as that brown shirt you just pointed out. It's on the right-hand side towards the front."]}, {"img_path": "cloth_store_1416238_woman_19_3.png", "boxes": [[1041, 315, 269, 400]], "captions": ["The blue jacket hanging in the far right cubby."]}, {"img_path": "cloth_store_1416238_woman_15_10.png", "boxes": [[761, 561, 40, 165], [287, 635, 174, 254], [820, 724, 256, 278], [1131, 866, 24, 36]], "captions": ["The pair in the farthest cubby to the left.", "Oh, do you have anything in XXL that's the same color as that red, white, and yellow blouse on the back floor rack?", "I'll buy that black coat from the front rack.", "The grey shoes. They are on the bottom row and to the left of the middle on the right closet. Underneath the grey trousers."]}, {"img_path": "cloth_store_1416238_woman_10_4.png", "boxes": [[1670, 235, 67, 355]], "captions": [" tell me the size and price of the black dress hanging in the cubby from before?"]}, {"img_path": "cloth_store_1416238_woman_10_7.png", "boxes": [[1508, 237, 92, 223], [1609, 853, 161, 70], [1806, 908, 78, 65]], "captions": ["The one one the top right corner against the wall.", "The green spider in the back row on the table.", "Do you have something with a similar color and available sizes as the green sweater on the front edge of the table?"]}, {"img_path": "cloth_store_1416238_woman_15_0.png", "boxes": [[203, 310, 89, 444], [278, 316, 92, 431]], "captions": ["The black coat to the left in that same cubby.", "In the cubby, the black coat to the right."]}, {"img_path": "cloth_store_1416238_woman_12_5.png", "boxes": [[678, 390, 32, 302]], "captions": ["The one in the back in the same compartment as that white vest you just showed me."]}, {"img_path": "cloth_store_1416238_woman_13_11.png", "boxes": [[1161, 437, 38, 172], [1014, 654, 82, 250]], "captions": [" the blue jacket on the top center-right shelf of the left wardrobe to my cart.", "The ones in the third cubby from the back."]}, {"img_path": "cloth_store_1416238_woman_16_4.png", "boxes": [[1170, 1, 139, 424]], "captions": [" that black dress on the wall."]}, {"img_path": "cloth_store_1416238_woman_13_7.png", "boxes": [[256, 621, 209, 283]], "captions": ["That one further back on the rack to the left would be perfect for an ugly sweater party I've got coming up. I'd be grateful if you could put it in my cart for me!"]}, {"img_path": "cloth_store_1416238_woman_16_3.png", "boxes": [[319, 902, 188, 101], [579, 905, 185, 98]], "captions": ["The one folded on the table", "Will you add the violet shirt on the table to my cart?"]}, {"img_path": "cloth_store_1416238_woman_12_8.png", "boxes": [[669, 410, 142, 212]], "captions": ["Great. Do you happen to have something with similar sizing options and label as that black and white blouse in the left cubby?"]}, {"img_path": "cloth_store_1416238_woman_15_9.png", "boxes": [[803, 614, 42, 183]], "captions": [" the light blue jeans on the left closet."]}, {"img_path": "cloth_store_1416238_woman_15_2.png", "boxes": [[221, 570, 63, 213]], "captions": ["The kind of black ones over on the shelves to the left."]}, {"img_path": "cloth_store_1416238_woman_13_10.png", "boxes": [[417, 717, 48, 286], [448, 741, 85, 262]], "captions": ["I'd prefer something like the black blouse on the first circle rack in color, but better reviews.", "Can I see something like the black and white blouse on the front rack, but with good reviews and from The Vegan Baker."]}, {"img_path": "cloth_store_1416238_woman_16_0.png", "boxes": [[1568, 377, 87, 158], [1429, 629, 97, 25], [804, 818, 107, 185]], "captions": ["Well, I guess it all comes down to the sizes.  the one that's hanging on the wall. If you could put it in my cart for me that'd be awesome.", "Oh that blue and black shirt over there at the edge of the table is so pretty! Do you have something for the same price with a similar pattern in a dark green color?", "The black one on the round rack closest to me."]}, {"img_path": "cloth_store_1416238_woman_16_7.png", "boxes": [[1445, 658, 169, 318], [169, 861, 249, 142]], "captions": ["The black coat on the back rack.", "Okay, could you add the blue and black jeans in the first cubby on the left to my bag?"]}, {"img_path": "cloth_store_1416238_woman_18_5.png", "boxes": [[142, 378, 278, 345]], "captions": ["Do you have something with a similar pattern and sleeve as the white and red blouse on the left side of the wall but in extra small?"]}, {"img_path": "cloth_store_1416238_woman_1_3.png", "boxes": [[561, 263, 111, 259], [264, 226, 115, 348], [1107, 763, 146, 240]], "captions": ["The rightmost black sweater in the third cubby from the left.", "The black t-shirt hanging in the cubby to the left.", "The red and white blouse on the left side of the front rack."]}, {"img_path": "cloth_store_1416238_woman_11_6.png", "boxes": [[810, 300, 92, 231], [635, 325, 48, 251], [808, 580, 46, 239], [1452, 708, 86, 295], [662, 919, 107, 80]], "captions": ["The grey coat in the front left closet.", " something like that blouse in the second cubicle on the left on design and brand but in brown and expensive.", "Give me the display size and available sizes of the grey jeans.", "Go ahead and add the white and black blouse hanging in the front rack to my cart.", "Sorry, the ones on the first shelf."]}, {"img_path": "cloth_store_1416238_woman_18_4.png", "boxes": [[117, 204, 408, 667]], "captions": ["The black and white spotted blouse in the front cubby."]}, {"img_path": "cloth_store_1416238_woman_14_8.png", "boxes": [[376, 847, 139, 65], [723, 819, 179, 184]], "captions": ["The grey and black sweater on the back left of the table.", "The black dress hanging on the left side of the front rack."]}, {"img_path": "cloth_store_1416238_woman_18_2.png", "boxes": [[323, 724, 131, 39]], "captions": ["The blue sweater on the back of the table."]}, {"img_path": "cloth_store_1416238_woman_11_9.png", "boxes": [[1258, 629, 143, 340]], "captions": ["Oh, I'm not big on brown.  But  to get those blue-black jeans in the cabinet to the left of those pants."]}, {"img_path": "cloth_store_1416238_woman_16_10.png", "boxes": [[749, 854, 61, 75]], "captions": [" something like the black and white blouse on the circular display in size and color but in plaid and from Yogi Fit."]}, {"img_path": "cloth_store_1416238_woman_16_2.png", "boxes": [[721, 332, 27, 177]], "captions": ["How about something similar to the black and white blouse in the second section on the right."]}, {"img_path": "cloth_store_1416238_woman_18_8.png", "boxes": [[543, 363, 61, 271]], "captions": ["The light grey jacket on the top shelf to the left."]}, {"img_path": "cloth_store_1416238_woman_1_6.png", "boxes": [[304, 296, 90, 165], [1, 404, 83, 212], [479, 647, 65, 24], [724, 579, 96, 249]], "captions": ["That's ok.  I love that brown hoodie hanging up high on the left wall, can you add it to my cart?", "Yes, please put the black jacket in the cupboard on the left into my cart.", "The grey dress on the bottom left of the wall.", "Yes, I am looking  at the lightweight sweatpants in dark green in the first compartment from the left."]}, {"img_path": "cloth_store_1416238_woman_12_1.png", "boxes": [[467, 518, 39, 213], [410, 690, 199, 177]], "captions": [" the dress on the left of the last rack.", "Do you have a long sleeve coat like the one on the carousel but from Uptown Gallery?"]}, {"img_path": "cloth_store_1416238_woman_19_1.png", "boxes": [[765, 513, 20, 128], [521, 598, 25, 216], [1346, 800, 174, 203]], "captions": [" to see other options with similar prices and sizes as the maroon dress from the wall.", "Do you have something with similar sizing options as that dark pink dress on the rack but with a diamond pattern?", "The dark blue pair in the leftmost cubby."]}, {"img_path": "cloth_store_1416238_woman_1_1.png", "boxes": [[1377, 281, 108, 282], [1377, 325, 72, 244]], "captions": ["Now tell me if there is anything similar to the yellow shirt in the closet but from Modern Arts.", " the red and white one from the cubby."]}, {"img_path": "cloth_store_1416238_woman_15_11.png", "boxes": [[659, 791, 145, 95], [547, 834, 191, 112]], "captions": ["The folded violet shirt on the table.", "The purple sweater on the display table."]}, {"img_path": "cloth_store_1416238_woman_16_9.png", "boxes": [[124, 323, 66, 188]], "captions": [" also add the brown hoodie hanging in the left middle cubby of the left dresser to my cart?"]}, {"img_path": "cloth_store_1416238_woman_12_0.png", "boxes": [[828, 270, 58, 323], [1653, 569, 65, 231], [1513, 588, 70, 243], [1645, 837, 50, 36], [1107, 957, 35, 37]], "captions": [" something like the first blouse in the third cubicle.", "I like the size =and price of the trousers in the sixth cubicle. Have you got something like that with better ratings?", " the green joggers from the fifth cubicle on the bottom.", " something similar in brand and size to the red shoes in the bottom left middle cubby of the right dresser, except in dark green.", "What do you have that has the same available sizes as the black shoes in the left closet but with good reviews and in size XS?"]}, {"img_path": "cloth_store_1416238_woman_12_10.png", "boxes": [[659, 621, 23, 201], [1032, 732, 125, 271]], "captions": ["Ok, thanks! I think for now I'll just go with those grey slacks down on the far wall display.", " something kind of like the ones in the fifth cabinet, but affordable."]}, {"img_path": "cloth_store_1416238_woman_19_2.png", "boxes": [[63, 659, 67, 253]], "captions": [" the green trousers on the left side of the room. In the closet."]}, {"img_path": "cloth_store_1416238_woman_14_4.png", "boxes": [[1620, 659, 105, 31]], "captions": ["The grey and black sweater on the back of the display table."]}, {"img_path": "cloth_store_1416238_woman_14_10.png", "boxes": [[1717, 425, 166, 357]], "captions": ["The one on the bottom right on the right wall."]}, {"img_path": "cloth_store_1416238_woman_19_4.png", "boxes": [[463, 244, 189, 294], [84, 958, 49, 41]], "captions": ["What is the brand of the blue jacket? The one in the closet.", " to get those blue sneakers in the cabinet on the far left."]}, {"img_path": "cloth_store_1416238_woman_11_4.png", "boxes": [[1038, 444, 76, 225], [934, 860, 119, 143]], "captions": [" tell me the brand and rating of that dress on the wall?", " add the black and olive dress from the front rack to my cart?"]}, {"img_path": "cloth_store_1416238_woman_13_5.png", "boxes": [[71, 258, 57, 154], [1158, 365, 50, 166], [851, 429, 21, 140]], "captions": [" the brown one from the wall.", " that black and white blouse in the cubicle on the right.", "What sizes does the brown dress on the wall come in?"]}, {"img_path": "cloth_store_1416238_woman_14_5.png", "boxes": [[1295, 25, 225, 365], [761, 250, 140, 271], [1390, 747, 127, 66], [1, 786, 170, 217]], "captions": ["Do you have anything like the one on the wall?", "That black one hanging over the sweatpants on the shelves.", "The grey one on the table.", "Will you add the red and white sweater from the rack to my cart?"]}, {"img_path": "cloth_store_1416238_woman_14_7.png", "boxes": [[1287, 434, 38, 127]], "captions": ["Oh, that's not great. What about something in XL that's similar to that white and grey blouse on the back wall, but with a leafy design?"]}, {"img_path": "cloth_store_1416238_woman_1_2.png", "boxes": [[1696, 852, 72, 144]], "captions": ["Do you have anything like the white, black, and red blouse on the rack, but in S?"]}, {"img_path": "cloth_store_1416238_woman_19_11.png", "boxes": [[507, 74, 204, 316]], "captions": ["Have you got anything with a sleeve length like the brown shirt on the top right on the right wall, but with a good rating?"]}, {"img_path": "cloth_store_1498649_woman_17_0.png", "boxes": [[1113, 736, 209, 126]], "captions": ["Do you have anything that's like the dark violet sweater you showed me before on the front row of the table?"]}, {"img_path": "cloth_store_1498649_woman_15_6.png", "boxes": [[1014, 298, 50, 87], [754, 362, 29, 203], [1452, 448, 70, 180]], "captions": ["The one on the right wall.", " something with similar sleeves and pricing as that beige dress on the back center rack.", " the one on the bottom hangers along the right hand wall."]}, {"img_path": "cloth_store_1498649_woman_14_11.png", "boxes": [[1579, 1, 305, 476], [637, 404, 101, 277]], "captions": [" this black one on the top right of the wall display", "The multi-colored blouse on the back wall."]}, {"img_path": "cloth_store_1498649_woman_13_7.png", "boxes": [[563, 217, 165, 294], [799, 273, 124, 225], [1209, 185, 675, 627]], "captions": ["The white and grey blouse up on the wall.", "The grey and white jacket hanging on the wall.", " add the olive dress on the display rack to my cart?"]}, {"img_path": "cloth_store_1498649_woman_15_4.png", "boxes": [[1078, 1, 113, 417], [1152, 607, 152, 308]], "captions": [" another of the black coat. The one on the rack, that is.", "The black and white blouse hanging on the right wall on the bottom towards the front."]}, {"img_path": "cloth_store_1498649_woman_19_11.png", "boxes": [[1160, 450, 29, 151]], "captions": ["Do you have something with a similar pattern and rating as that pink sweater on the bottom right of the wall, but in large?"]}, {"img_path": "cloth_store_1498649_woman_19_8.png", "boxes": [[1247, 701, 165, 144]], "captions": ["I'll buy that white and black sweater from the second shelf of the table."]}, {"img_path": "cloth_store_1498649_woman_19_4.png", "boxes": [[1274, 376, 72, 95], [1649, 307, 61, 248]], "captions": ["The brown jacket you just pointed out. In the middle of the bottom row against the wall.", "t the one on the rack to the right in back."]}, {"img_path": "cloth_store_1498649_woman_15_11.png", "boxes": [[860, 299, 51, 90], [1440, 259, 72, 320], [1440, 385, 89, 210], [989, 233, 121, 573]], "captions": ["I think I'll go with that violet shirt at the back right of the table.", " to buy the one on the back rack.", "Do you have anything similar to the maroon dress hanging on the rack over to the right in terms of size and color, but from North Lodge with good reviews?", "Have you got anything in a similar size and sleeves as that black and olive dress on the front-left arm of the closer rack?"]}, {"img_path": "cloth_store_1498649_woman_14_2.png", "boxes": [[797, 235, 80, 176], [1033, 424, 107, 40]], "captions": ["Have you got anything like that blue jacket hanging at the far right of the wall, but in the expensive range, and an XS?", "The light grey shirt on the top tier on the table."]}, {"img_path": "cloth_store_1498649_woman_1_3.png", "boxes": [[1, 205, 212, 710], [534, 277, 630, 638], [1149, 597, 112, 45]], "captions": ["That black one on the front rack.", "Ok, for now I think  that black blouse on the left side of the floor rack.", " to buy the green one on the second shelf of the table."]}, {"img_path": "cloth_store_1498649_woman_12_3.png", "boxes": [[916, 433, 52, 214], [1195, 659, 276, 124], [1229, 804, 320, 111]], "captions": ["Can I get that grey and white blouse from the back wall?", "The one on the table.", "The brown one on the bottom shelf of the table."]}, {"img_path": "cloth_store_1498649_woman_18_10.png", "boxes": [[318, 439, 69, 476]], "captions": ["Have you got anything in the same sizes as the one on the wall, but sleeveless?"]}, {"img_path": "cloth_store_1498649_woman_18_11.png", "boxes": [[142, 413, 150, 250], [800, 242, 270, 673]], "captions": [" that one on the wall please.", " the black one from the rack then."]}, {"img_path": "cloth_store_1498649_woman_11_8.png", "boxes": [[122, 1, 583, 377], [1029, 360, 141, 96], [931, 372, 240, 405], [1555, 430, 55, 281]], "captions": ["Do you have something else in a similar size as that beige dress on the front right rack?", "The black dress on the second rack.", " that black jacket on the left rack also.", "It's funny, I don't like that one as much as the black dress on the wall. Well, what does it matter who the brand is? Go ahead and throw that black one to the right in my cart."]}, {"img_path": "cloth_store_1498649_woman_15_3.png", "boxes": [[1562, 39, 130, 292], [969, 276, 35, 45], [786, 319, 116, 65], [862, 295, 213, 360]], "captions": ["Do you have any Brain Puzzle blouses the same size as the one on the wall by the brown jacket? And maybe red white and yellow colors?", "The fifth one on the rack.", "The green t shirt at the left of the display rack.", "I'm just going to get the maroon, white and blue top on the center rack instead."]}, {"img_path": "cloth_store_1498649_woman_12_7.png", "boxes": [[1017, 433, 46, 61], [1171, 393, 35, 133], [1230, 381, 28, 179], [1346, 403, 102, 202], [1509, 387, 173, 296], [909, 441, 21, 243], [886, 449, 37, 327]], "captions": ["Ok, thanks anyway. In the meantime, could you toss that green, violet, and pink blouse on the back wall in my cart?", "Do you have anything with a similar size as the black dress on the back rack, but in velvet and with short sleeves?", " that black dress at the back of the middle rack.", "Can I get the brand and rating for the one on the rack?", " find me something similar to the white and black blouse on the left front rack in brand but a size S and red and white?", " the red and white sweater on the left wall display.", " one of the white and grey blouses that is on the wall to the right."]}, {"img_path": "cloth_store_1498649_woman_12_5.png", "boxes": [[1237, 1, 184, 362], [1473, 395, 70, 252]], "captions": ["The black and red one in the top middle of the left wall.", "Have you got anything in the same brand as the gray and white top at the bottom right of the left wall, but in black and white?"]}, {"img_path": "cloth_store_1498649_woman_15_1.png", "boxes": [[1333, 257, 140, 205], [1123, 403, 70, 349]], "captions": [" that one on the wall.", "Do you have anything similar to the brown jacket in the back side of the rack at the front right, but with a plain pattern?"]}, {"img_path": "cloth_store_1498649_woman_18_2.png", "boxes": [[835, 310, 193, 535], [811, 425, 39, 377]], "captions": ["I am referring to the black and grey dress on the rack.", "The one on the front rack."]}, {"img_path": "cloth_store_1498649_woman_18_3.png", "boxes": [[610, 368, 56, 161], [625, 373, 64, 154], [813, 465, 105, 25], [851, 484, 135, 42], [1018, 557, 103, 32]], "captions": ["The one on the left wall of the previous storefront.", "The white and grey blouse hanging on the wall rack on the left.", "The dirty grey sweater on the display table.", "The same violet t-shirt from the table.", "Let's put the brown shirt from the bottom of the table in my cart also."]}, {"img_path": "cloth_store_1498649_woman_19_10.png", "boxes": [[948, 298, 51, 113], [1259, 349, 52, 268], [1498, 328, 66, 270]], "captions": ["Sure, I am looking at the black dress in the top row  on the wall in front of us", "Yes, I will take the olive dress from the rack in the middle of the room.", "Ok, do you have anything similarly-priced to that purple dress over on the right side of the center floor rack?"]}, {"img_path": "cloth_store_1498649_woman_10_11.png", "boxes": [[616, 497, 65, 194]], "captions": [" that one on the wall."]}, {"img_path": "cloth_store_1498649_woman_10_3.png", "boxes": [[1574, 191, 212, 269], [765, 370, 190, 353]], "captions": ["How about something similar to the black blouse on the right wall in the front?", "The one you just added to my cart. It is on the front of the front rack."]}, {"img_path": "cloth_store_1498649_woman_10_7.png", "boxes": [[890, 338, 42, 73], [1531, 484, 109, 24], [465, 373, 44, 301], [1460, 488, 125, 49], [954, 292, 186, 591]], "captions": ["The grey and white blouse hanging on the rack in front.", " the white and grey shirt on the middle shelf of the display table.", "The black one hanging on the back wall.", " to buy the grey shirt from the second shelf of the table.", "Also the grey shirt in the front rack, please."]}, {"img_path": "cloth_store_1498649_woman_15_5.png", "boxes": [[1409, 176, 294, 739]], "captions": ["What do you have that is like the brown coat on the rack?"]}, {"img_path": "cloth_store_1498649_woman_18_0.png", "boxes": [[141, 179, 182, 221], [644, 445, 155, 42], [822, 539, 128, 37], [967, 641, 120, 41], [504, 812, 275, 103]], "captions": ["Sorry, I totally got distracted by that brown jacket hanging up high against the wall.  something with the same sleeve length and the same ballpark ratings, but I need it in a large, and I'm on a very tight budget this month.", " the green one at the top of the table display.", "Those aren't the most impressive ratings. I think  that black sweater on the far end of the middle shelf though, if you can put that in my cart.", "The gray one on the far bottom corner of the table.", " add that red sweater at the bottom of the table display to my cart?"]}, {"img_path": "cloth_store_1498649_woman_18_7.png", "boxes": [[971, 284, 69, 174], [953, 484, 91, 229]], "captions": [" something like the one on the wall but with good ratings and light spots.", "The blue trousers against the back wall, first pair."]}, {"img_path": "cloth_store_1498649_woman_17_1.png", "boxes": [[1339, 285, 54, 130], [660, 437, 97, 386], [1062, 286, 796, 629]], "captions": ["Do you have anything else with similar sleeves and pricing as the green and violet blouse hanging up on the back of the wall?", "Alright, I'll buy the black coat on the bottom of the left wall then.", "The black jacket hanging on the front of the front right rack."]}, {"img_path": "cloth_store_1498649_woman_10_6.png", "boxes": [[755, 324, 84, 145]], "captions": ["That grey and blue one hanging on the far left against the back wall."]}, {"img_path": "cloth_store_1498649_woman_18_5.png", "boxes": [[1637, 296, 192, 529]], "captions": ["Have you got anything like the black dress on the rack, but with a good rating?"]}, {"img_path": "cloth_store_1498649_woman_18_8.png", "boxes": [[1, 159, 224, 245], [795, 229, 169, 90], [1296, 381, 214, 337], [1407, 377, 181, 351]], "captions": [" the grey and white blouse on the top left of the wall display.", " the brown and black dress on the rack.", "I am referring to the grey and black shirt on the rack.", "Also, add the black dress in the right rack to my cart too."]}, {"img_path": "cloth_store_1498649_woman_16_10.png", "boxes": [[1003, 1, 281, 379]], "captions": ["t of the green, violet, pink blouse on the top center-right rack."]}, {"img_path": "cloth_store_1498649_woman_16_2.png", "boxes": [[881, 423, 139, 267]], "captions": ["The grey jacket on the bottom right of the wall ."]}, {"img_path": "cloth_store_1498649_woman_16_4.png", "boxes": [[1533, 271, 130, 138]], "captions": ["The pink and white one hanging on the right wall."]}, {"img_path": "cloth_store_1498649_woman_11_1.png", "boxes": [[1674, 360, 118, 193], [1186, 479, 62, 248]], "captions": ["Woah that green, violet, pink shirt on the other side of this rack is so unique! Is there anything in the same pattern for the same price with good reviews?", " the pink shirt on the bottom right of the wall display."]}, {"img_path": "cloth_store_1498649_woman_16_7.png", "boxes": [[1000, 238, 79, 153], [1158, 218, 111, 168], [1097, 309, 91, 176], [226, 337, 48, 211], [719, 278, 189, 463]], "captions": [" something similar in sleeve length and rating to the red, white, and yellow blouse in the front rack.", " to buy the maroon and white one on the back wall.", " show me something else with a similar rating and sizing as the black one on the back of the front rack but for a cheaper price and knit?", "The same violet dress from the rack.", "Okay,  one of the grey coat on the rack directly in front."]}, {"img_path": "cloth_store_1498649_woman_12_0.png", "boxes": [[42, 403, 144, 64], [1, 386, 176, 310]], "captions": [" the white and black blouse  on the rack.", "The second pink knit sweater on the rack to the left."]}, {"img_path": "cloth_store_1498649_woman_1_9.png", "boxes": [[894, 67, 242, 440]], "captions": [" this red and white one hanging on top rack."]}, {"img_path": "cloth_store_1498649_woman_16_11.png", "boxes": [[650, 317, 37, 97], [1, 195, 287, 717]], "captions": ["The light grey one almost all the way in the back to the left against the wall.", "t the olive dress on the front floor rack."]}, {"img_path": "cloth_store_1498649_woman_16_9.png", "boxes": [[807, 284, 67, 90]], "captions": [" the green hoodie against the back wall. It is on the top row and in the middle."]}, {"img_path": "cloth_store_1498649_woman_13_6.png", "boxes": [[1421, 201, 98, 137]], "captions": ["The red and white sweater hanging on the very top left of the back wall."]}, {"img_path": "cloth_store_1498649_woman_13_9.png", "boxes": [[551, 284, 41, 131]], "captions": ["I think I prefer the blue one on the wall.  it to my cart please."]}, {"img_path": "cloth_store_1498649_woman_14_5.png", "boxes": [[880, 312, 83, 68]], "captions": ["The blue shirt on the display table to the left."]}, {"img_path": "cloth_store_1498649_woman_10_2.png", "boxes": [[1416, 263, 65, 142], [1040, 360, 142, 59], [457, 386, 106, 268]], "captions": ["The white and pink striped shirt hanging on the right wall in front of the window.", "The black coat on the center rack.", "Ok, thanks! I think I'll go ahead and buy that black coat that's on the left wall."]}, {"img_path": "cloth_store_1498649_woman_19_2.png", "boxes": [[68, 470, 165, 279], [652, 600, 159, 49], [345, 641, 190, 85], [351, 703, 262, 104]], "captions": ["The one against the wall on the bottom row.", "Nah, that one on the end of the middle shelf still takes the crown.  put that beauty in my cart.", " the violet shirt folded up on the table to the left of the red one.", "Have you got something like the black one on the middle table but from Garden Retail in plaid?"]}, {"img_path": "cloth_store_1498649_woman_19_0.png", "boxes": [[727, 251, 132, 664]], "captions": ["Have you got anything in a similar color as that olive dress on the left side of the rack in the front?"]}, {"img_path": "cloth_store_1498649_woman_10_4.png", "boxes": [[1703, 214, 181, 237]], "captions": ["How about something from Global Voyager like the one on the table?"]}, {"img_path": "cloth_store_1498649_woman_10_0.png", "boxes": [[962, 474, 137, 381]], "captions": [" the same grey one on the bottom rack."]}, {"img_path": "cloth_store_1498649_woman_10_1.png", "boxes": [[1104, 374, 95, 233]], "captions": ["I think  that darker pair of jeans against the wall too."]}, {"img_path": "cloth_store_1498649_woman_16_3.png", "boxes": [[1221, 615, 109, 35]], "captions": ["The violet shirt folded on the bottom of the display table, to the back right."]}, {"img_path": "cloth_store_1498649_woman_14_0.png", "boxes": [[642, 222, 115, 184], [1222, 540, 163, 50], [1425, 655, 188, 70], [1331, 672, 199, 93]], "captions": ["Oh sorry, the one up against the windows, the one on the left of that rack.", "The one in the bottom middle of the middle tier of the table.", "Is there anything else which has the same pattern as the grey shirt on the table but in grey?", "I think I'll just go with that green sweater on the bottom level of the display on the right, that looks like a good casual sweater.   it to my cart."]}, {"img_path": "cloth_store_1498649_woman_13_1.png", "boxes": [[1499, 436, 171, 311]], "captions": ["The white and black blouse hanging on the bottom rack and to the right."]}, {"img_path": "cloth_store_1498649_woman_18_6.png", "boxes": [[464, 354, 49, 73]], "captions": ["The dark gray one hanging on the back wall."]}, {"img_path": "cloth_store_1498649_woman_1_1.png", "boxes": [[123, 203, 158, 224], [109, 440, 157, 274]], "captions": ["I am referring to the white, black, and red blouse on the top row against the wall. To the very left.", "I am referring to the light grey coat on the bottom row against the wall. It is on the very left."]}, {"img_path": "cloth_store_1498649_woman_12_6.png", "boxes": [[1569, 148, 82, 241], [932, 365, 161, 279]], "captions": [" the one on top rack.", "The pink sweater on the right side of the center rack."]}, {"img_path": "cloth_store_1498649_woman_1_6.png", "boxes": [[1624, 579, 260, 86], [640, 516, 97, 344], [1483, 646, 401, 253]], "captions": [" to buy another one of the red sweaters from the table please.", "The olive dress on the back right rack.", "The first one on the table."]}, {"img_path": "cloth_store_1498649_woman_18_1.png", "boxes": [[1090, 340, 38, 65], [697, 421, 82, 216]], "captions": ["The one on the back wall, top row to the right.", " that black and white diamond-pattern top on the bottom right of the left wall."]}, {"img_path": "cloth_store_1498649_woman_19_3.png", "boxes": [[182, 210, 224, 304]], "captions": [" add the white and black blouse on the top left of the wall display to my cart."]}, {"img_path": "cloth_store_1498649_woman_11_10.png", "boxes": [[1034, 417, 125, 326]], "captions": ["Gosh what am I saying I still just want those light-wash jeans. Except I don't think I can afford them. Is there anything like them that won't be such a hard hit on my wallet?"]}, {"img_path": "cloth_store_1498649_woman_13_3.png", "boxes": [[990, 300, 116, 410], [1, 423, 165, 265], [1615, 428, 135, 255]], "captions": ["I'm gonna have to think about those. In the meantime, do you have anything with the same sizing options and sleeve length as that purple dress on the center floor rack, but by Natura Photographers and in a plain checkered pattern?", "Go ahead and give me that dark grey jacket on the back wall then.", "No problem.  the grey jeans on the right wall."]}, {"img_path": "cloth_store_1498649_woman_14_1.png", "boxes": [[1477, 408, 90, 206]], "captions": ["The grey and white jacket in the back of the right wall."]}, {"img_path": "cloth_store_1498649_woman_17_3.png", "boxes": [[1270, 332, 88, 149], [1350, 323, 94, 168]], "captions": [" to find something close to the light blue and light green jacket that's on the left side of the table.  this to be similar in color and pattern but made by Art Den and affordable in price.", "I think I'll go ahead and buy the blue and white shirt that's displayed on the table in the center."]}, {"img_path": "cloth_store_1498649_woman_1_5.png", "boxes": [[749, 327, 54, 516]], "captions": [" the violet blouse third from the right of the display rack."]}, {"img_path": "cloth_store_1498649_woman_16_6.png", "boxes": [[1136, 279, 62, 301]], "captions": ["The violet dress hanging on the rack to the right."]}, {"img_path": "cloth_store_1498649_woman_1_11.png", "boxes": [[237, 342, 48, 106], [1672, 247, 189, 236], [1621, 551, 263, 62]], "captions": [" the blue t-shirt on the back wall.", "The one hanging on the wall.", "I am referring to the maroon sweater on the top row of the table."]}, {"img_path": "cloth_store_1498649_woman_17_5.png", "boxes": [[1681, 45, 203, 484], [1249, 249, 73, 117], [1603, 310, 57, 321]], "captions": ["The maroon one actually hanging on the wall right now.", "The red and white blouse on the top left of the wall rack.", "The black and olive dress hanging on the back of the right wall."]}, {"img_path": "cloth_store_1498649_woman_16_1.png", "boxes": [[1, 262, 77, 64]], "captions": [" that Christmas sweater on the wall please."]}, {"img_path": "cloth_store_1498649_woman_1_4.png", "boxes": [[81, 274, 44, 232], [398, 268, 98, 348], [877, 265, 117, 305], [1396, 244, 128, 634], [1557, 314, 136, 506]], "captions": [" that blue jacket up on the wall on the left.", "Can I get the brown dress off that rack?", "The black coat on the back of the wall.", " to buy that black dress on the same rack.", " put the black and white blouse from the front rack in my cart?"]}, {"img_path": "cloth_store_1498649_woman_11_2.png", "boxes": [[160, 215, 187, 178]], "captions": ["I actually like the grey jacket at the back of the room, in the back row on those tables.  put into into my cart?"]}, {"img_path": "cloth_store_1498649_woman_11_3.png", "boxes": [[1499, 270, 67, 85]], "captions": ["In available sizes, do you have anything like the maroon, white and blue blouse that's on the rack to the right, only expensive?"]}, {"img_path": "cloth_store_1498649_woman_11_11.png", "boxes": [[694, 475, 34, 125]], "captions": ["How much are the jeans on the bottom of the wall, third from last? And who makes them?"]}, {"img_path": "cloth_store_1498649_woman_1_2.png", "boxes": [[361, 418, 96, 178]], "captions": [" that first coat on the bottom of the wall in back."]}, {"img_path": "cloth_store_1498649_woman_11_7.png", "boxes": [[1, 118, 342, 797]], "captions": ["The beige dress on the left rack."]}, {"img_path": "cloth_store_1498649_woman_3_10.png", "boxes": [[821, 221, 23, 194]], "captions": ["The black dress on the wall I just asked about."]}, {"img_path": "cloth_store_paul_11_1.png", "boxes": [[1742, 512, 192, 276]], "captions": ["I'll just take another one of those black coats on the back rack to the right, and that'll do it."]}, {"img_path": "cloth_store_paul_5_6.png", "boxes": [[1112, 471, 42, 113]], "captions": ["Those dark green joggers on the wall."]}, {"img_path": "cloth_store_1498649_woman_15_3.png", "boxes": [[1642, 1, 233, 383]], "captions": ["The black coat up on the wall."]}, {"img_path": "cloth_store_1416238_woman_6_9.png", "boxes": [[446, 921, 171, 82]], "captions": ["I am talking about the white shirt on the first row of the table."]}, {"img_path": "cloth_store_2_14_1.png", "boxes": [[879, 396, 185, 392]], "captions": ["The grey pair in the left cubby."]}, {"img_path": "cloth_store_1498649_woman_19_2.png", "boxes": [[203, 498, 73, 223], [588, 630, 169, 51]], "captions": [" add the yellow one on the bottom rack of the left wall?", "What's the size of the middle sweater on the second tier table?"]}, {"img_path": "cloth_store_3_17_1.png", "boxes": [[1753, 225, 164, 236]], "captions": ["Sounds good.  add the black jacket on the top rack to my cart."]}, {"img_path": "cloth_store_1498649_woman_2_1.png", "boxes": [[1, 124, 613, 347], [334, 59, 413, 856], [1793, 468, 91, 350]], "captions": ["The maroon dress on the front rack.", "Ok, I'll buy that brown dress on the front left rack.", " something like the brown coat on the bottom right wall but in XL."]}, {"img_path": "cloth_store_paul_13_10.png", "boxes": [[1494, 507, 120, 192]], "captions": ["Do you have any from the same company as the black one on the round rack, but denim? And in a S."]}, {"img_path": "cloth_store_2_10_7.png", "boxes": [[1204, 336, 51, 211]], "captions": ["The black coat on the back of the center rack."]}, {"img_path": "cloth_store_1_8_1.png", "boxes": [[218, 165, 62, 236], [483, 553, 91, 89]], "captions": ["The one hanging in the shelf above the grey jeans.", "The purple one on the left side of the rack."]}, {"img_path": "cloth_store_2_16_7.png", "boxes": [[1957, 42, 115, 235]], "captions": [" that green hoodie on the far right rack to my cart for me."]}, {"img_path": "cloth_store_paul_14_10.png", "boxes": [[376, 285, 49, 99], [1438, 415, 48, 114], [1266, 457, 34, 231]], "captions": ["The left green hoodie in the cubby second from the left wall.", "The dark green joggers in the third section of the wall unit on the right.", "I'm talking about the one in the very center of the rack facing me."]}, {"img_path": "cloth_store_3_10_3.png", "boxes": [[1040, 259, 127, 203]], "captions": ["The red one on the wall."]}, {"img_path": "cloth_store_1_6_11.png", "boxes": [[493, 122, 50, 290], [1360, 200, 64, 208], [1343, 222, 67, 180], [1082, 509, 419, 279], [1679, 561, 43, 83]], "captions": [" suggest anything with a similar price to the grey jacket on the wall, but with a camouflage pattern?", "You know, can I get two of the black coats from the back wall?", "The grey jacket in the right closet. It is in the second left cubicle.", "The blue jacket on the rack.", "The brown shirt hanging on the rack."]}, {"img_path": "cloth_store_3_14_9.png", "boxes": [[778, 145, 171, 335], [1589, 288, 27, 131], [1061, 452, 76, 227], [830, 491, 143, 297]], "captions": ["The green hoodie second from the left on the left wall, could you add that to my cart?", "I am referring to the blue and black jeans on the table. The ones on the far side of the table.", "Let's put the black one on the bottom row of the left wall in my cart.", "The one hanging on the bottom row on the left hand wall."]}, {"img_path": "cloth_store_1_13_9.png", "boxes": [[923, 716, 86, 48]], "captions": ["The blue shoes in the second cubby from the left."]}, {"img_path": "cloth_store_1_5_7.png", "boxes": [[846, 146, 41, 155]], "captions": ["The one you just recommended, in the middle of the second shelf in the top row on the right."]}, {"img_path": "cloth_store_1_14_11.png", "boxes": [[445, 94, 118, 258], [1488, 383, 32, 184]], "captions": ["The blue jacket on the left wall. The one we were just talking about.", "Actually, add to my cart the jeans at the front of the cabinets at the right back."]}, {"img_path": "cloth_store_1498649_woman_15_1.png", "boxes": [[567, 329, 38, 73], [780, 289, 83, 155]], "captions": [" find something similar to the white, black blouse on the center floor rack in terms of pattern?", "Cool. In that case I guess  the one hanging on the wall to the left."]}, {"img_path": "cloth_store_1498649_woman_5_9.png", "boxes": [[833, 503, 37, 180], [1695, 654, 165, 36]], "captions": ["Awesome!  also add that blue hoodie that's on the back wall?", "The light pink sweater on the display to the right."]}, {"img_path": "cloth_store_1416238_woman_8_5.png", "boxes": [[760, 333, 68, 244], [1401, 560, 36, 214], [1775, 568, 38, 187]], "captions": [" something with a similar pattern as that dark grey one toward the front of the cubby but with a higher price and in red and white.", " the one on the last rack please.", " to see something like the pair of light blue jeans in the right side cubby but for a cheaper price and by The Vegan Baker."]}, {"img_path": "cloth_store_1498649_woman_19_8.png", "boxes": [[1307, 532, 461, 186], [46, 448, 272, 464], [1247, 701, 165, 144], [1283, 827, 133, 88]], "captions": [" the grey shirt on the table.", "The red, white, and yellow blouse on the rack on the wall. It is the second one.", "I am talking about the white and black sweater  on the second row of the table.", "The red and black sweater on the second row of the table."]}, {"img_path": "cloth_store_1498649_woman_3_11.png", "boxes": [[1072, 482, 125, 182]], "captions": ["The blue jacket on the back wall."]}, {"img_path": "cloth_store_1416238_woman_10_8.png", "boxes": [[1130, 640, 55, 252]], "captions": ["No worries. I am also looking for pants like those brown ones you have in the second compartment from the left  in the cupboard by the entrance."]}, {"img_path": "cloth_store_3_10_11.png", "boxes": [[1245, 326, 64, 108]], "captions": [" add that gray jacket on the wall to my cart then."]}, {"img_path": "cloth_store_1_19_4.png", "boxes": [[1, 476, 326, 207]], "captions": ["Ok, not sure what is different about them, but not interested anyway.  instead add that black hat on the table to my cart? I like the design on it, reminds me of bowling."]}, {"img_path": "cloth_store_paul_17_3.png", "boxes": [[1723, 493, 111, 137]], "captions": ["The grey jeans on the back wall."]}, {"img_path": "cloth_store_1_7_2.png", "boxes": [[515, 415, 56, 67], [22, 470, 298, 145]], "captions": ["It's on the left side of the rack. It's the grey shirt.", "The white one on the shelf to the left."]}, {"img_path": "cloth_store_1416238_woman_10_6.png", "boxes": [[19, 145, 95, 210], [58, 381, 84, 222]], "captions": ["Sorry, the one on the left wall.", "Yeah, I am looking at the black and white blouse on the wall on the left, in the bottom row."]}, {"img_path": "cloth_store_2_4_9.png", "boxes": [[1248, 1, 167, 460]], "captions": ["The black one in the middle of the cubby directly in front of us."]}, {"img_path": "cloth_store_3_16_5.png", "boxes": [[958, 250, 75, 224]], "captions": ["Let's put one of those grey jackets on the top right of the left wall in my cart as well."]}, {"img_path": "cloth_store_3_1_1.png", "boxes": [[1107, 278, 88, 162], [1454, 595, 410, 192]], "captions": ["The blue one up on the wall.", "The blue hoodie on the front center rack."]}, {"img_path": "cloth_store_2_5_2.png", "boxes": [[184, 1, 277, 242], [1, 238, 255, 366], [983, 514, 52, 30]], "captions": ["What do you have that is similar to the grey, black shirt on the left wall in regards to pattern and brand, but expensive and with excellent reviews?", " this grey coat in front on the bottom rack.", " add the grey shoes on the right on the bottom shelf to my cart?"]}, {"img_path": "wayfair_store_12_0.png", "boxes": [[334, 425, 101, 40], [441, 401, 30, 40], [456, 413, 55, 40], [873, 299, 66, 287], [193, 408, 207, 96], [123, 435, 387, 79], [1031, 437, 96, 112], [716, 469, 254, 319]], "captions": ["I really like that coffee table behind the chair on the left you mentioned, can you put that in my cart please?", " tell me the brand and materials of that end table?", " a wooden coffee table on the right, please.", " something like the wooden shelves in material, but grey instead.", "The one behind the shelves and to the right of the lamp.", "The grey rug by the far wall.", "Do you have anything like that brown chair over by the round table at the back right, except made of leather?", "Yeah, add a second set of the shorter shelf too."]}, {"img_path": "cloth_store_2_19_10.png", "boxes": [[1799, 221, 64, 129]], "captions": ["That blue one on the back shelf."]}, {"img_path": "cloth_store_paul_5_0.png", "boxes": [[767, 284, 29, 98], [1711, 280, 48, 106], [1770, 400, 45, 67], [1009, 434, 22, 189]], "captions": ["I am referring to the blue jacket in the left shelf.", "Does the light grey one on the right side of the wall, or something like it, come in an extra extra large?", "Do you have any pants like the blue jeans on the end of the wall display?", "The grey jacket hanging on the rack."]}, {"img_path": "cloth_store_paul_19_8.png", "boxes": [[3, 701, 160, 87]], "captions": ["OK. I will take the green hooded sweater from the floor rack."]}, {"img_path": "cloth_store_1498649_woman_11_0.png", "boxes": [[1016, 393, 87, 225]], "captions": ["Of the two on the back wall you just showed me, the pair on the right, how much are they?"]}, {"img_path": "cloth_store_1498649_woman_18_8.png", "boxes": [[184, 453, 190, 312]], "captions": ["Sure, I am like those blue pants on the left, near the wall."]}, {"img_path": "cloth_store_1416238_woman_7_7.png", "boxes": [[1206, 356, 40, 183], [1076, 371, 30, 200], [1184, 352, 48, 214]], "captions": [" to buy the green hoodie from that cubby.", "It's in the third cabinet from the door.", " to see options with a similar price as the grey coat hanging up in the back cubby but with good ratings."]}, {"img_path": "cloth_store_1416238_woman_16_3.png", "boxes": [[446, 390, 175, 298], [196, 953, 175, 50], [480, 972, 135, 31]], "captions": ["The pink and white striped shirt hanging up on the wall.", "I am referring to the red t-shirt on the table.", "I'll buy the one on the table."]}, {"img_path": "cloth_store_paul_20_0.png", "boxes": [[1432, 686, 95, 47]], "captions": ["I am referring to the black shoes on the second row of the table."]}, {"img_path": "cloth_store_paul_15_9.png", "boxes": [[1421, 463, 96, 54]], "captions": ["The light grey one on the rack."]}, {"img_path": "cloth_store_paul_12_10.png", "boxes": [[1953, 480, 75, 92], [942, 528, 95, 199], [1911, 544, 72, 244]], "captions": ["The grey pants on the right along the back wall.", "Do you have something like the green hoodie in the left rack, but with a good rating?", "My bad,  that blue jacket on the circular rack to the right."]}, {"img_path": "wayfair_store_13_6.png", "boxes": [[1282, 415, 102, 88], [372, 428, 362, 175], [1145, 612, 330, 176]], "captions": [" the wooden coffee table to the back right corner.", " a second brown table.", " the wooden table on the right."]}, {"img_path": "cloth_store_paul_20_1.png", "boxes": [[1911, 266, 57, 135]], "captions": ["What are they available sizes on the one on the wall."]}, {"img_path": "cloth_store_1498649_woman_7_5.png", "boxes": [[925, 490, 121, 24], [1039, 691, 168, 72]], "captions": ["What about that other pink one on the table there?  What are the customer reviews of that one like?", "The light pink sweater on the bottom shelf of the table."]}, {"img_path": "cloth_store_1498649_woman_6_4.png", "boxes": [[41, 341, 101, 92], [977, 303, 67, 151], [402, 392, 55, 166]], "captions": ["Drat. Never mind then. What about something similar to this black and white blouse on the wall, but from Brain Puzzles? I like that brand.", "Meh, I don't think  either of those. Just give me that multicolored sweater on the top rack.", " show me something with similar sleeves as the brown dress on the back center rack and for a similar price, but with good reviews and in blue?"]}, {"img_path": "cloth_store_1498649_woman_18_10.png", "boxes": [[312, 105, 234, 359], [549, 1, 1311, 912]], "captions": ["Let's put the white and black blouse hanging up above on the wall in my cart.", "That grey and white one hanging up front against the wall."]}, {"img_path": "wayfair_store_7_3.png", "boxes": [[434, 373, 41, 46], [1169, 250, 120, 241], [249, 371, 159, 82], [501, 392, 71, 18], [133, 424, 84, 99], [363, 418, 170, 82], [942, 424, 352, 309], [1119, 525, 273, 263]], "captions": ["Hmm, actually, can you find me something with a similar brand and material to that black end table, but expensive and with nice reviews?", "That shelf you just showed me.", "You know what, add that grey sofa along the wall as well.", "Alright well  something with the same rating as the brown one, but I really want an Uptown Studio table.", "Let's put that white end table between them in my cart.", "The first table in the back by the three sofas.", "Do you have anything similar to the wooden table in color but more expensive?", " add that white chair next to the table to my cart."]}, {"img_path": "cloth_store_1_20_9.png", "boxes": [[628, 428, 130, 68]], "captions": ["Show me a hat that is similar to the black one on the table."]}, {"img_path": "cloth_store_1416238_woman_4_0.png", "boxes": [[1397, 189, 115, 441]], "captions": ["It's the black coat hanging up in the second cubicle in the upper right."]}, {"img_path": "cloth_store_paul_15_8.png", "boxes": [[74, 341, 76, 141]], "captions": ["Would you add the grey and white jacket to the left on the back wall closet to my cart?"]}, {"img_path": "cloth_store_1498649_woman_19_3.png", "boxes": [[1029, 625, 127, 69], [1100, 677, 192, 73]], "captions": ["Great, that'll do.  the one on the middle shelf.", "The black sweater on the near end of the display."]}, {"img_path": "cloth_store_3_14_7.png", "boxes": [[2034, 431, 63, 103]], "captions": ["That blue hoodie in the middle of that top row against the front wall."]}, {"img_path": "cloth_store_1498649_woman_17_10.png", "boxes": [[194, 294, 97, 119], [1, 345, 30, 132], [1420, 312, 432, 603]], "captions": ["Do you have something else from the same brand as the brown coat on the back wall but in small and in olive instead?", " find something similar to the black, red suit on the back left table in terms of pattern and color?", "Let's put the one from the front of the rack in my cart."]}, {"img_path": "cloth_store_1416238_woman_20_9.png", "boxes": [[524, 353, 83, 271], [1034, 466, 40, 109]], "captions": ["In the third cabinet,  that red and white plaid top, please.", "The brown shirt up on the back wall."]}, {"img_path": "cloth_store_1416238_woman_18_2.png", "boxes": [[323, 724, 131, 39]], "captions": ["The blue sweater on the table to the left next to the green one."]}, {"img_path": "cloth_store_1498649_woman_14_8.png", "boxes": [[1732, 50, 126, 369]], "captions": ["Ok. Let's put the black dress from the top of the wall in my cart now."]}, {"img_path": "cloth_store_1416238_woman_19_7.png", "boxes": [[1131, 376, 121, 371]], "captions": ["Of the two white and red blouses  the one on the left side of the cubby."]}, {"img_path": "cloth_store_1416238_woman_3_11.png", "boxes": [[314, 397, 101, 326]], "captions": ["The one on the lower rack on the left, in the center."]}, {"img_path": "cloth_store_1416238_woman_2_6.png", "boxes": [[959, 470, 63, 276]], "captions": [" to see something priced similarly to the purple dress hanging on the bottom in the center of the wall."]}, {"img_path": "cloth_store_3_18_9.png", "boxes": [[1154, 429, 120, 359]], "captions": [" that black jacket on the rack in the middle of the room."]}, {"img_path": "cloth_store_2_5_8.png", "boxes": [[727, 192, 51, 234]], "captions": ["I know it's been a lot, but I've decided on the light grey one in the second section on the left."]}, {"img_path": "cloth_store_paul_9_3.png", "boxes": [[1584, 459, 71, 36]], "captions": ["The white hat to the left of the green ones on the front table."]}, {"img_path": "wayfair_store_6_0.png", "boxes": [[120, 410, 43, 19], [519, 387, 64, 48], [558, 377, 45, 54], [653, 505, 376, 283]], "captions": [" one of the white end tables on the left please.", "It's OK.  add that light-brown table to my cart.", "The one behind the shelves you were just telling me about?", "This grey one against the wall to my right."]}, {"img_path": "cloth_store_paul_10_6.png", "boxes": [[1165, 462, 68, 165]], "captions": [" find me something similar to the black coat on the rack in brand and color?"]}, {"img_path": "cloth_store_1_4_5.png", "boxes": [[1134, 178, 34, 144], [878, 549, 450, 239]], "captions": ["Let's add the green hoodie in the back cubby on the right to my cart.", "The black hat on the table."]}, {"img_path": "cloth_store_2_1_11.png", "boxes": [[1320, 1, 125, 347], [677, 301, 69, 151], [736, 309, 35, 132]], "captions": ["OK. For now, please drop the grey coat from the second compartment on the right into my cart.", "Speaking of the rack, do you have anything that comes in similar sizes as that light gray blazer at the front?", "The black one on the floor rack in the back."]}, {"img_path": "wayfair_store_4_7.png", "boxes": [[186, 445, 37, 73], [1133, 294, 110, 340], [3, 482, 423, 80], [719, 501, 281, 280]], "captions": ["Okay, then can you find me something like that coffee table, but in white and with a good customer rating?", "I'll go with the tall one at the far side of the wall.", "Alright, well I do think  that white rug under the coffee table for myself.   put that in my cart?", "Curious if you have anything like the shelves I just added, in terms of color, but cheaper and leather."]}, {"img_path": "cloth_store_paul_5_2.png", "boxes": [[1097, 312, 44, 60], [1335, 442, 77, 113], [873, 430, 31, 154], [748, 606, 34, 119], [779, 660, 211, 82]], "captions": ["I'll pass for now. The green hoodie on the back wall under the red boxes looks nice. Is there something like that from North Lodge in an affordable price range?", "The hoodie on the middle rack on the right.", "The blue jacket on the rack in the middle on the left.", " the blue jacket on the circular rack in the forefront to my cart.", "I am referring to the green hoodie on the rack in the forefront."]}, {"img_path": "cloth_store_paul_17_9.png", "boxes": [[521, 309, 38, 130], [868, 453, 50, 130]], "captions": [" show me more jackets like the one in the cupboard on the left?", "The ones closest to the mirror, those look perfect.   those to my cart please."]}, {"img_path": "cloth_store_1416238_woman_4_3.png", "boxes": [[1155, 340, 99, 384], [1767, 386, 117, 462]], "captions": [" add that black dress in the second cabinet to my cart please?", "I am talking about the grey and white blouse on the very right of the closet."]}, {"img_path": "cloth_store_1416238_woman_5_6.png", "boxes": [[539, 387, 36, 193]], "captions": ["The white one in the back of the cubby."]}, {"img_path": "cloth_store_1498649_woman_6_10.png", "boxes": [[649, 261, 32, 166], [1155, 546, 95, 369]], "captions": [" add the blue and white shirt second from left on the far upper wall rack to my cart.", "t the pink blouse on the bottom rack in the front."]}, {"img_path": "cloth_store_paul_14_3.png", "boxes": [[1791, 438, 96, 44], [569, 500, 198, 288]], "captions": ["Do you have anything with a similar brand to the blue and white vest on the left of the rack on the far right?", "The blue jacket on the front rack."]}, {"img_path": "cloth_store_1416238_woman_1_1.png", "boxes": [[1, 60, 212, 339], [1377, 325, 72, 244]], "captions": [" add the one on the wall to my cart?", "Anything with a similar price and rating as that one in the cabinet, but in denim?"]}, {"img_path": "cloth_store_1_18_10.png", "boxes": [[991, 111, 46, 199]], "captions": ["Let's put that brown hoodie in the cubby in my cart, too."]}, {"img_path": "cloth_store_1_7_6.png", "boxes": [[1500, 479, 140, 309]], "captions": ["The ones all the way on the bottom left of the shelf."]}, {"img_path": "cloth_store_3_19_7.png", "boxes": [[1217, 399, 99, 165]], "captions": ["I'll grab the one on the table."]}, {"img_path": "cloth_store_2_15_8.png", "boxes": [[236, 50, 120, 271], [262, 31, 141, 289]], "captions": ["The light grey jacket on the left in the second section.", "Sure,  the blue jacket that hangs second from the left in  the second compartment in the top row on  the left."]}, {"img_path": "cloth_store_paul_7_10.png", "boxes": [[1905, 440, 89, 184]], "captions": [" the brown cart in the far right rack to my cart."]}, {"img_path": "cloth_store_1416238_woman_3_1.png", "boxes": [[1171, 943, 68, 59]], "captions": ["Sure! I am interested in the golden-color shoes in the first compartment on the right."]}, {"img_path": "cloth_store_1416238_woman_5_10.png", "boxes": [[1552, 340, 101, 184], [705, 410, 32, 111], [1083, 626, 43, 301]], "captions": ["Do you have anything with a similar patter and brand as the brown jacking in the middle cabinet on the right, but in an S?", "The one hanging on the wall.", " the red and white sweater on the middle rack."]}, {"img_path": "cloth_store_3_11_6.png", "boxes": [[584, 350, 62, 91], [1004, 388, 145, 283]], "captions": ["The grey one against the back wall, bottom row.", "Go ahead and give me that grey jacket on the rack in front of me."]}, {"img_path": "cloth_store_2_12_10.png", "boxes": [[1434, 340, 121, 247]], "captions": [" the brown coat on the rack to my cart."]}, {"img_path": "cloth_store_1416238_woman_1_7.png", "boxes": [[198, 139, 127, 212], [838, 497, 46, 203], [541, 936, 61, 67]], "captions": ["The brown one up on the left wall.", "The black and olive dress hanging on the rack.", "The one on the first floor stand, on the left side of it."]}, {"img_path": "cloth_store_1498649_woman_8_5.png", "boxes": [[899, 763, 332, 152], [484, 823, 348, 92], [1316, 830, 231, 85]], "captions": ["Let me ask about the brown sweater on the middle shelf. Do you have anything like that in sleeve length but in a cheap Glam Nails version?", "Do you have anything with a similar size and price range to the blue and grey shirt on the left side of the bottom shelf, but with good reviews?", "Actually, I just saw that white one on the bottom shelf.  it, please add it to my cart!"]}, {"img_path": "cloth_store_1_9_0.png", "boxes": [[241, 616, 122, 169]], "captions": [" the yellow tshirt at the front of that rack."]}, {"img_path": "cloth_store_2_12_0.png", "boxes": [[789, 244, 148, 220], [1310, 450, 96, 268], [680, 750, 41, 38]], "captions": ["t the violet one up on the mannequin beside the white shirt.", "Alright.  Do you see the brown coat on the rack in front of the mirror?   to take one.", "Sure, I am interested in the red shoes in the rightmost lower shelf in the low cupboard  by the wall on the left."]}, {"img_path": "cloth_store_paul_19_3.png", "boxes": [[1661, 594, 100, 77]], "captions": ["Oh,  the green one on the rack in front."]}, {"img_path": "cloth_store_2_9_6.png", "boxes": [[387, 412, 315, 376]], "captions": ["The pair of pants in the cubby on the left."]}, {"img_path": "cloth_store_paul_18_0.png", "boxes": [[1533, 232, 45, 134], [1445, 251, 45, 115], [1510, 500, 102, 55], [30, 664, 54, 83]], "captions": ["I will be needing something in XL, and I'd prefer something in the affordable price range.   try to get something as close to that black coat in the second cubby from the right as you can?", "Well that won't work.  Let's go ahead and do the brown coat in the third cubby from the right.", "Is there anything like that black hat at the right of the center table, in terms of customer reviews, but in a grey color?", " add the blue jacket on the floor rack to my cart?"]}, {"img_path": "cloth_store_1416238_woman_12_9.png", "boxes": [[1807, 340, 77, 408]], "captions": [" to also get that black top in the far right cabinet."]}, {"img_path": "cloth_store_paul_9_1.png", "boxes": [[761, 391, 39, 79], [612, 457, 84, 173]], "captions": ["I am referring to the brown trousers in the back right wall.", " the brown one from the middle rack to my cart."]}, {"img_path": "cloth_store_2_3_3.png", "boxes": [[642, 40, 167, 385], [1795, 444, 107, 88]], "captions": ["Let's put the black one from the cubby in my cart as well.", "What else do you have like that black coat on the rack but with an affordable price?"]}, {"img_path": "cloth_store_paul_14_2.png", "boxes": [[486, 528, 134, 260]], "captions": ["Let's add the light grey one on the rack on the left side of the table to my cart."]}, {"img_path": "cloth_store_1416238_woman_17_3.png", "boxes": [[532, 560, 86, 232]], "captions": ["The grey ones in that cubby."]}, {"img_path": "cloth_store_3_5_0.png", "boxes": [[1480, 1, 616, 788], [626, 354, 75, 155], [1228, 38, 285, 750], [1, 512, 82, 212], [1302, 696, 55, 66]], "captions": [" the first jacket on the upper wall.", "Get me a second jacket from the back of the table, please.", "Got anything like the black coat at the front of the right wall?", "I am speaking about the grey coat on the left front wall.", " that gray one on the right wall please."]}, {"img_path": "cloth_store_1_11_9.png", "boxes": [[1813, 29, 86, 309], [1588, 120, 68, 204]], "captions": ["Let's put the center grey coat in the right cubby in my cart.", "Thank you! I like the vest in blue and white on the last shelf in the top row on the right, please drop it into my basket."]}, {"img_path": "cloth_store_1416238_woman_4_10.png", "boxes": [[817, 346, 56, 146]], "captions": ["The one at the top right on the left wall."]}, {"img_path": "cloth_store_1_7_10.png", "boxes": [[660, 456, 68, 97], [733, 459, 87, 103], [781, 558, 235, 193], [578, 683, 112, 105]], "captions": ["OK.  the light grey coat on the back of the rack to my cart.", "The grey coat to the right of the light grey coat on the rack.", " add the red jacket on the right side of the rack to my shopping cart.", "The one to the right of the green shirt on the rack."]}, {"img_path": "cloth_store_1_6_5.png", "boxes": [[43, 557, 177, 148]], "captions": [" find me something similar to the black coat on the left side of the rack, but more expensive?"]}, {"img_path": "cloth_store_paul_3_2.png", "boxes": [[1, 492, 225, 296]], "captions": [" the grey trousers in the front left cabinet."]}, {"img_path": "cloth_store_3_12_1.png", "boxes": [[486, 201, 82, 231]], "captions": ["The green one on the top rack."]}, {"img_path": "cloth_store_3_15_3.png", "boxes": [[1688, 97, 409, 691]], "captions": ["I need trousers like the blue ones on the table display, same color and vertical stripes."]}, {"img_path": "cloth_store_2_17_11.png", "boxes": [[1433, 330, 39, 69]], "captions": ["The black one up on the wall."]}, {"img_path": "cloth_store_paul_8_3.png", "boxes": [[1681, 295, 40, 129], [1794, 291, 41, 139], [1484, 452, 55, 101]], "captions": [" the black coat in the closet to my cart.", "You can add the grey coat in the right shelf to my cart.", "What is the price and what are the available sizes for the black coat on the rack?"]}, {"img_path": "cloth_store_1416238_woman_15_6.png", "boxes": [[1727, 319, 86, 166], [1784, 775, 100, 31]], "captions": ["Do you have something else like the black jacket up on the wall but for a higher price point and made by The Vegan Baker?", "That's a bummer. I like that blue and grey shirt over on the table though.  that to my cart please."]}, {"img_path": "wayfair_store_12_9.png", "boxes": [[1285, 403, 37, 13], [1303, 392, 30, 26]], "captions": ["Aw man, that's a bummer. Well I kind of like that wooden table next to it.  tell me you've got a brown leather one for the same price and with comparable customer ratings?", "OK, just add the white end table in the back to my cart."]}, {"img_path": "cloth_store_1416238_woman_10_3.png", "boxes": [[390, 400, 43, 268], [461, 341, 108, 349], [530, 755, 74, 248]], "captions": [" something like that black sweater in the other cubby but in brown and affordably priced.", " the black blouse in the front of the cubby.", "Is there anything like the pair in the third cabinet, but in the cheap range?"]}, {"img_path": "cloth_store_1498649_woman_7_9.png", "boxes": [[934, 347, 50, 81], [989, 358, 45, 60], [886, 427, 49, 80], [1161, 375, 188, 292], [1394, 391, 199, 284]], "captions": ["Who makes the black one on the right of the back wall?", "Sure, it's that pink and white blouse hanging against the back wall. Up top to the right.", "Let's put the black coat from the back wall in my cart.", "Tahnks! What do you have in the same colors as the maroon, white, and blue blouse on the left side of the floor rack closer to us, but in extra small?", "Hmm, OK, I am taking the olive and black tshirt on the first floor rack , on the right side of it."]}, {"img_path": "cloth_store_paul_7_5.png", "boxes": [[1713, 423, 72, 127]], "captions": ["I am talking about the dark blue jeans in the middle closet."]}, {"img_path": "cloth_store_2_18_11.png", "boxes": [[1338, 238, 30, 114]], "captions": ["I am talking about the dark grey t-shirt on the back right wall."]}, {"img_path": "cloth_store_1498649_woman_19_6.png", "boxes": [[787, 239, 29, 536]], "captions": ["The colors are red, white, and yellow and it's on the back side of the rack. It's the second one from the right end."]}, {"img_path": "cloth_store_1498649_woman_6_8.png", "boxes": [[727, 221, 279, 693], [779, 238, 262, 659]], "captions": ["Let's put that white and grey blouse from the rack in my cart as well.", "The black blouse hanging in the rack."]}, {"img_path": "cloth_store_1_15_7.png", "boxes": [[1319, 447, 67, 150]], "captions": ["Do you have anything like the black coat hanging on the circular rack? at least in sizing and reviews."]}, {"img_path": "cloth_store_1_18_4.png", "boxes": [[1151, 112, 48, 220], [1151, 83, 84, 256], [1737, 370, 32, 158], [1559, 372, 49, 192], [623, 413, 141, 323]], "captions": ["Actually,  that gray and white zip-up hanging in the middle of the third cabinet.   that for me, would you?", " the brown coat in the cubbyhole that is third from left.", "Do you have any other track pants in similar sizes as that pair in the third cabinet on the right shelves?", "I am talking about the left-most pair of blue jeans on the right closet.", "The dark green ones in the far left cabinet."]}, {"img_path": "cloth_store_1498649_woman_12_7.png", "boxes": [[1178, 389, 28, 205], [1204, 383, 33, 190]], "captions": ["On the rack in the middle,  that dark brown dress at the end of the left arm please.", "I am talking about the grey dress in the middle rack."]}, {"img_path": "cloth_store_paul_6_5.png", "boxes": [[1384, 412, 42, 100], [1556, 414, 60, 94], [1891, 440, 75, 90], [1059, 437, 23, 150], [2069, 565, 28, 223]], "captions": ["Oh well.  On that garment rack by the back corner, do you have anything like the light gray jacket at the front right in terms of pattern and rating?", "The ones in the far left cubby on the right wall.", "I'm gonna get those light blue jeans on the wall for sure.", "The one at the end of the table. On the other side of the room.", "The grey jacket I asked about on the far right rack."]}, {"img_path": "cloth_store_1416238_woman_14_8.png", "boxes": [[467, 256, 115, 214], [613, 489, 103, 217]], "captions": ["OK, what do you have with the same pattern and sleeve length as the grey and white top in the middle of the top row on the wall?", "That same grey one up on the wall."]}, {"img_path": "cloth_store_2_8_1.png", "boxes": [[414, 153, 126, 188], [872, 304, 53, 178], [1627, 366, 162, 254]], "captions": ["Let's put the light blue, light green jacket on the shelf on the left in my cart.", "The grey coat on the left side of the rack behind the table.", "Do you have something like the pair of blue jeans in the right cubby with plain and by River Chateau?"]}, {"img_path": "cloth_store_paul_16_3.png", "boxes": [[640, 269, 46, 107]], "captions": ["The green hoodie on the wall."]}, {"img_path": "cloth_store_1498649_woman_7_11.png", "boxes": [[1347, 314, 69, 125]], "captions": ["i need to think, but I definitely want that red tee on the table.   it to my cart please."]}, {"img_path": "cloth_store_1498649_woman_1_8.png", "boxes": [[1467, 498, 323, 417]], "captions": ["The grey and white jacket on the rack."]}, {"img_path": "cloth_store_1498649_woman_9_10.png", "boxes": [[731, 1, 433, 343]], "captions": [" show me something else like the black and white blouse hanging up top on the left wall?"]}, {"img_path": "cloth_store_1416238_woman_9_3.png", "boxes": [[336, 340, 92, 490], [752, 251, 112, 629]], "captions": ["Do you have something else from the same brand as that black blouse in the back cubby?", " this light grey blouse in the middle of the shelf display/"]}, {"img_path": "cloth_store_2_7_10.png", "boxes": [[781, 163, 108, 221], [398, 406, 56, 89]], "captions": ["You know what,  that grey coat in the right most shelf up there.", " the pair on the far left cabinet."]}, {"img_path": "cloth_store_2_20_5.png", "boxes": [[1982, 332, 136, 307]], "captions": [" the brown coat on the wall to my cart."]}, {"img_path": "cloth_store_1_2_0.png", "boxes": [[1100, 440, 50, 99], [782, 476, 45, 65]], "captions": ["I am referring to the dark green joggers in the left closet.", "The brown coat on the back side of the center rack."]}, {"img_path": "cloth_store_2_16_10.png", "boxes": [[1161, 1, 89, 326]], "captions": ["I am speaking of the red and white jacket in the second right-most cubicle."]}, {"img_path": "cloth_store_1_2_7.png", "boxes": [[1356, 1, 88, 393], [1140, 407, 227, 381]], "captions": ["I'm looking for a similar black coat as the one hanging on the top right rack, but with good customer reviews.", "The brown pants in the center spot of the wall."]}, {"img_path": "cloth_store_3_10_9.png", "boxes": [[1239, 311, 129, 221], [1619, 486, 221, 302]], "captions": ["I'm looking to buy something like the gray suit on the right side of the front table, but more pricey.", "I like the black coat on the wall to the right,  but I need something that looks classy and with good ratings."]}, {"img_path": "wayfair_store_17_9.png", "boxes": [[81, 381, 49, 24], [764, 350, 107, 50], [172, 429, 102, 27], [735, 378, 91, 92]], "captions": ["I just moved so I need tons of new things. Can I buy the wooden end table behind that brown chair on the left?", "Go ahead and add the wooden table to my cart.", " to know about the brown coffee table on the left.", " the one between the two walls."]}, {"img_path": "cloth_store_1498649_woman_9_8.png", "boxes": [[707, 454, 53, 180]], "captions": ["Maybe something like the light blue jeans in the middle of the wall?"]}, {"img_path": "cloth_store_1416238_woman_4_4.png", "boxes": [[1398, 704, 228, 299]], "captions": [" add another black sweater from the floor rack to my cart?"]}, {"img_path": "cloth_store_1416238_woman_17_0.png", "boxes": [[1305, 407, 72, 245], [404, 632, 61, 51], [416, 632, 65, 38], [544, 620, 28, 229], [592, 873, 122, 94]], "captions": ["Sure,  the red, white, and yellow blouse in the cupboard  on the right. It is leftmost in the second compartment from the right.", "You know what, I think I'll just take that black dress that's hanging on the rear floor rack.", "What is the score of the maroon dress on the middle rack?", "Do you have anything like the grey dress on the right of the rack in the back of the room?", "OK, I will buy the black jacket on the left side of the rack right in front of us."]}, {"img_path": "cloth_store_paul_6_7.png", "boxes": [[1267, 439, 98, 244]], "captions": ["t the light gray jacket hanging next to the table."]}, {"img_path": "cloth_store_paul_7_2.png", "boxes": [[1028, 496, 45, 152], [811, 585, 61, 42]], "captions": ["Let's put the grey ones in the back cubby in my cart.", "I would like a hat like that green one on the center of the table but extra extra large."]}, {"img_path": "cloth_store_3_16_11.png", "boxes": [[1642, 271, 183, 278], [1130, 393, 114, 196]], "captions": [" put that black coat hanging up top on the right wall to my cart?", "Sure, I am looking at the suit in brown and white in the middle of the first row on the first table in the center of the room."]}, {"img_path": "cloth_store_1_12_11.png", "boxes": [[1198, 157, 55, 169]], "captions": ["OK. I will buy the black coat in the second compartment from the right  in the top row in the cupboard closer to the entrance."]}, {"img_path": "cloth_store_1416238_woman_13_11.png", "boxes": [[853, 670, 96, 276]], "captions": ["The dark blue jeans in the far left of the right closet."]}, {"img_path": "cloth_store_paul_12_9.png", "boxes": [[735, 278, 48, 172], [364, 449, 42, 119]], "captions": ["Can I get that black coat hanging on the shelving unit to the left?  It's in the second cubby from the right.", "I am talking about the blue and black jeans on the left shelf. They are in the right-most position on that closet."]}, {"img_path": "cloth_store_1_14_6.png", "boxes": [[708, 151, 58, 203]], "captions": ["The one in the first cubby from the left."]}, {"img_path": "cloth_store_1_9_5.png", "boxes": [[804, 413, 194, 369]], "captions": ["You know,  to get that blue zip-up hanging on the left side of the garment rack.   add that to my cart."]}, {"img_path": "cloth_store_1_1_6.png", "boxes": [[1348, 425, 116, 160]], "captions": ["Let me think on it. In the mean time... is there anything like that black coat on the rack near the yellow item, in terms of pattern and brand, but in a size M and brown?"]}, {"img_path": "cloth_store_1_20_10.png", "boxes": [[1302, 368, 126, 344]], "captions": ["The blue ones on the left in the cupboard on the right, on the bottom shelf."]}, {"img_path": "cloth_store_1_7_4.png", "boxes": [[304, 438, 57, 63], [545, 452, 251, 336]], "captions": ["The black coat in the rack.", "I am referring to the blue jacket which is on the far side of the rack."]}, {"img_path": "cloth_store_1498649_woman_15_5.png", "boxes": [[423, 218, 45, 115], [870, 225, 57, 121], [1, 269, 154, 328], [397, 254, 166, 433], [1643, 178, 241, 735]], "captions": ["It is black and white and hanging on the back wall to the left.", "The yellow one up on the wall.", "That brown dress on the rack to the back left looks pretty good actually. Do you think you can find me something with the same pattern that has long sleeves and good reviews?", " to get that gray dress at the front right of the standing rack closer to me please.", "I am talking about the grey and black shirt on the right of the rack."]}, {"img_path": "cloth_store_1_15_8.png", "boxes": [[987, 402, 45, 386]], "captions": ["You know,  the light grey coat off the rack."]}, {"img_path": "wayfair_store_3_10.png", "boxes": [[983, 355, 161, 111], [1004, 451, 321, 55], [151, 457, 313, 236], [378, 466, 139, 213], [886, 497, 334, 167], [428, 466, 380, 305], [2, 518, 760, 270]], "captions": ["You know, I'll also take the grey bed against the back wall.", "Okay. In that case  the one against the far wall.", "The table you pointed out.", "The white chair in front of the table.", " the one in the display on the other side of the partition, close to us.", "Right,  the shorter wooden shelf on the right side of the partition.", "What brand is the rug under this table?"]}, {"img_path": "cloth_store_3_4_3.png", "boxes": [[1095, 190, 154, 313]], "captions": ["The blue hoodie on the wall."]}, {"img_path": "cloth_store_1416238_woman_15_10.png", "boxes": [[1268, 362, 48, 210], [820, 724, 256, 278], [919, 827, 72, 95]], "captions": ["The white and black blouse in the front cubby.", "No, those colors are too out there for me. I think I'll just switch it up another way and take that black coat on the first rack instead, the one on the right side!", "The one on the rack in front of me. Right side."]}, {"img_path": "cloth_store_paul_9_5.png", "boxes": [[1774, 448, 55, 138]], "captions": ["I am talking about the black coat on the back right wall. In the closet."]}, {"img_path": "cloth_store_paul_20_5.png", "boxes": [[737, 440, 42, 102], [1050, 423, 41, 90]], "captions": ["I am talking about the ones in the back. In the middle closet.", "How much are the trousers on the bottom right on the wall?"]}, {"img_path": "cloth_store_1498649_woman_11_11.png", "boxes": [[979, 263, 95, 232]], "captions": ["The white, black and red one on the top rack."]}, {"img_path": "cloth_store_1416238_woman_16_11.png", "boxes": [[1602, 664, 189, 339]], "captions": ["The grey one on the left-hand side of that rack with the purple dress."]}, {"img_path": "cloth_store_1_4_3.png", "boxes": [[1506, 157, 101, 243]], "captions": [" the black blazer at the left side of the middle cabinet on the right."]}, {"img_path": "cloth_store_1416238_woman_10_7.png", "boxes": [[1510, 904, 167, 80]], "captions": ["Let's put the blue and white shirt from the table in my cart."]}, {"img_path": "cloth_store_paul_4_8.png", "boxes": [[551, 469, 51, 68], [489, 538, 56, 222]], "captions": ["The light grey one on the very back center rack.", " the red and white jacket on the rack closest to the camera."]}, {"img_path": "cloth_store_1_6_3.png", "boxes": [[239, 425, 98, 207], [442, 554, 468, 234]], "captions": ["The brown trousers in the closet.", "Perfect,  the one on the rack."]}, {"img_path": "cloth_store_2_12_6.png", "boxes": [[1227, 1, 188, 382]], "captions": ["I am referring to the blue jacket in the middle cubicle of the closet."]}, {"img_path": "wayfair_store_5_5.png", "boxes": [[1115, 411, 55, 66], [835, 438, 62, 92], [1073, 472, 143, 43], [1204, 448, 118, 27], [860, 449, 282, 199]], "captions": ["Oh, first add that white end table right beside it to my cart!", "Do you have anything similar to the white end table on price but with better ratings?", "What do you have with a similar rating to the leftmost of those two tables?", "Ok, well, what is that table made of?", "My bad,  that gray couch next to the tables."]}, {"img_path": "cloth_store_1416238_woman_11_3.png", "boxes": [[748, 533, 60, 298]], "captions": ["Let's put that purple dress on the right side of the center rack in my cart."]}, {"img_path": "cloth_store_1_12_1.png", "boxes": [[689, 125, 82, 211], [1212, 370, 91, 37]], "captions": ["That green one on the wall to the left.", " the green one at the end of the table display."]}, {"img_path": "cloth_store_3_19_4.png", "boxes": [[467, 311, 96, 129], [1487, 490, 93, 189]], "captions": ["The green and white t-shirt on the back wall. It is green with white stripes.", " that red one with the white sleeves on the left of the bottom right rack."]}, {"img_path": "cloth_store_1416238_woman_1_11.png", "boxes": [[329, 187, 94, 179], [1544, 247, 96, 285], [371, 370, 72, 222], [230, 619, 127, 93], [406, 584, 131, 382]], "captions": ["The black blouse on the wall.", "The yellow shirt in the closet.", " locate something that's in a similar brand to the maroon dress hanging up against the wall on the left side?", "The maroon dress hanging on the rack in the lower left.", "Show me something like the red dress on the rack."]}, {"img_path": "cloth_store_paul_2_7.png", "boxes": [[393, 502, 80, 286]], "captions": ["That light gray coat at the back of the rack."]}, {"img_path": "cloth_store_1498649_woman_2_4.png", "boxes": [[630, 1, 419, 371]], "captions": ["Let's add the brown one on the right on the top rack to my cart."]}, {"img_path": "cloth_store_1416238_woman_20_5.png", "boxes": [[816, 405, 86, 231], [1545, 398, 50, 290], [1663, 392, 66, 308], [706, 657, 60, 226]], "captions": ["Yeah, I am interested in the black coat on the right in the cupboard by the entrance.", "I like that brown jacket second from the left in the far right cabinet.   to buy it.", "The black jacket in the second cubby from the right.", " add the dark blue jeans in the cubby third from left to my cart."]}, {"img_path": "cloth_store_1_20_7.png", "boxes": [[1103, 381, 41, 88]], "captions": ["Let's add that grey coat on the back side of the rack to my cart."]}, {"img_path": "cloth_store_2_6_8.png", "boxes": [[1478, 271, 30, 119]], "captions": ["Yeah my bad, I'm talking about that grey one on the rack in the middle of the floor in the back."]}, {"img_path": "cloth_store_1_2_11.png", "boxes": [[1118, 426, 313, 356]], "captions": ["The black hoodie on the left side of the rack."]}, {"img_path": "cloth_store_1416238_woman_19_5.png", "boxes": [[1434, 361, 143, 353], [1311, 923, 226, 80]], "captions": ["Have you got anything like that red and white Christmas sweater on the wall?", "Do you have anything else like that green sweater on the table?"]}, {"img_path": "cloth_store_3_11_5.png", "boxes": [[479, 294, 45, 112], [899, 388, 31, 146]], "captions": [" show me something with a similar pattern and in a similar size as the grey and white shirt vest on the back table but in grey with long sleeves?", "Do you have anything similar in price to the blue and white shirt hanging on the very end on the wall?"]}, {"img_path": "cloth_store_paul_4_10.png", "boxes": [[1779, 557, 133, 72]], "captions": [" the black and orange one on the right side of the table."]}, {"img_path": "cloth_store_2_1_9.png", "boxes": [[1082, 6, 109, 339], [1195, 1, 172, 365], [887, 339, 42, 150], [265, 381, 123, 268]], "captions": ["The green hoodie in the last cubby on the right wall.", "The blue jacket in the cubby on the left.", "That green hoodie on the circular rack in the back.", "Do you have anything similar to the grey jacket on the bottom of the hanging wall display in size?"]}, {"img_path": "cloth_store_3_1_7.png", "boxes": [[1769, 482, 120, 138]], "captions": [" the brown coat on the left end of the right rack toward the bottom."]}, {"img_path": "cloth_store_1416238_woman_15_3.png", "boxes": [[514, 305, 79, 194], [1591, 361, 56, 334], [1792, 342, 87, 421], [509, 751, 112, 252]], "captions": ["The one on the wall .", "The black one hanging on the top right of the shelf.", " to get the other black blazer in the cabinet too.", " the one on the rack."]}, {"img_path": "cloth_store_paul_8_5.png", "boxes": [[1173, 468, 49, 219]], "captions": ["Got something similar to the blue hoodie on the right floor rack?"]}, {"img_path": "cloth_store_paul_9_4.png", "boxes": [[1101, 408, 65, 118]], "captions": ["For the blue hoodie toward the back of the garment rack at the end of the hat table.  It's next to the pink and white shirt."]}, {"img_path": "wayfair_store_2_0.png", "boxes": [[446, 384, 22, 31], [859, 366, 52, 58], [851, 366, 61, 40], [510, 387, 27, 32], [817, 376, 77, 53]], "captions": ["Those aren't really doing much for me, sorry. I'm feeling that little white lamp in the very back by the wall, though. I'd be grateful if you could add that to my cart.", "You know, I'll actually take the chair that's in front of the table over there instead.", "Let's go back to those shelves and add them to my cart.", "Alright, well would you add that black end table just to the left of the lamp on the left side of the room to my cart?", "The table in the back. The one near the shelves."]}, {"img_path": "cloth_store_2_5_4.png", "boxes": [[1272, 269, 40, 118]], "captions": ["The blue one in the last cubby of the right dresser."]}, {"img_path": "cloth_store_2_8_5.png", "boxes": [[267, 1, 171, 380], [1421, 245, 24, 125], [1023, 421, 100, 299]], "captions": ["The red and white one in the front dresser in the left middle cubby.", " to buy that blue jacket hanging in the second cabinet from the door.", " the blue trousers in the rightmost cubby of the front dresser."]}, {"img_path": "cloth_store_1416238_woman_14_9.png", "boxes": [[1573, 351, 79, 318]], "captions": ["The white and black blouse in the cubby."]}, {"img_path": "cloth_store_3_2_7.png", "boxes": [[1940, 359, 102, 194]], "captions": [" add the brown, white suit on the back table to my cart?"]}, {"img_path": "wayfair_store_18_4.png", "boxes": [[818, 457, 66, 100]], "captions": ["Actually,  the white end table."]}, {"img_path": "cloth_store_3_13_9.png", "boxes": [[1113, 321, 43, 92], [941, 468, 193, 302], [1587, 497, 114, 286]], "captions": ["I am talking about the dark blue and dark green jacket in the back table.", "Let's put that blue t-shirt from the center rack in my cart.", "Thanks, I'm gonna go with the brown hoodie on the right side of the bottom row along the right wall.   that to my cart."]}, {"img_path": "cloth_store_1416238_woman_19_9.png", "boxes": [[879, 392, 41, 151], [1215, 689, 167, 314]], "captions": [" to get the black one you showed me, the one in the third cabinet from the door.", " to get the one on the rack, please."]}, {"img_path": "cloth_store_2_20_7.png", "boxes": [[1696, 142, 169, 222], [1175, 443, 58, 198]], "captions": ["Do you have anything like that black shirt hanging on the higher rack on the wall on the far right, but with a good review and a design on it?", "Will you add the brown hoodie on the rack to my cart?"]}, {"img_path": "cloth_store_2_16_8.png", "boxes": [[1720, 446, 240, 324]], "captions": ["I think I also want to purchase the brown hoodie that is on the rack."]}, {"img_path": "cloth_store_1416238_woman_14_0.png", "boxes": [[1472, 277, 50, 193], [1546, 314, 36, 145], [1643, 676, 91, 32]], "captions": ["Do you have something like the black jacket on the wall but in extra large and for a cheap price?", "Can I also get that gray tee at the top right on the wall?", "I am talking about the maroon sweater on the back table."]}, {"img_path": "wayfair_store_13_0.png", "boxes": [[516, 428, 17, 15], [734, 424, 80, 39]], "captions": ["I actually want something similar to the end table behind the sofa at the back of the store.", "Oh, that's okay.  I think  that table so I don't have to eat sitting on the floor."]}, {"img_path": "cloth_store_2_2_7.png", "boxes": [[742, 53, 93, 304]], "captions": ["Thanks.  show me anything by the same brand as the light-grey coat closer to us on the second shelf of the top row on the left?"]}, {"img_path": "cloth_store_1416238_woman_3_9.png", "boxes": [[1092, 706, 142, 297]], "captions": ["The dark blue jeans in the compartment beneath the hoodie."]}, {"img_path": "cloth_store_1_17_11.png", "boxes": [[1077, 154, 33, 219]], "captions": ["The brown coat against the wall."]}, {"img_path": "cloth_store_3_9_2.png", "boxes": [[964, 318, 35, 105], [980, 457, 42, 136]], "captions": ["That's ok.  There's a blue hoodie hanging in the top row along the right hand wall, second from the back.   put it in my cart?", "What is the price of the blue jacket on the right wall?"]}, {"img_path": "cloth_store_1416238_woman_5_0.png", "boxes": [[566, 903, 89, 89], [753, 823, 230, 170]], "captions": ["Possibly. Do you have anything in a similar size to the grey coat in rack in the middle, but with good ratings and from Downtown Stylists?", "Do you have anything else like the black coat on the center rack?"]}, {"img_path": "cloth_store_paul_9_11.png", "boxes": [[818, 448, 46, 210], [985, 589, 169, 199]], "captions": ["Do you have anything with a similar rating and price as the grey and white one on the rack next to the front table but in grey and white?", "The blue hoodie on the circular rack."]}, {"img_path": "cloth_store_2_3_11.png", "boxes": [[733, 261, 34, 144], [758, 243, 48, 174], [887, 220, 29, 174], [760, 436, 46, 180]], "captions": ["I also want that brown coat in the second section of the second unit.", "The one in the second compartment.", "The blue one in the second cubby from the right.", " put those brown pants in the bottom cubby in my cart?"]}, {"img_path": "wayfair_store_20_7.png", "boxes": [[751, 371, 24, 15], [1043, 364, 143, 59], [1118, 359, 56, 59], [655, 331, 31, 162], [1309, 403, 152, 116], [370, 465, 207, 226]], "captions": [" the wooden end table next to the red couch in the back.", " this brown table.", "The one on the left side of the dividing wall.", "Would you add the standing lamp beside the wall to my cart?", "There's a black and white chair next to a table.", "Will you add the brown chair against the wall of the left to my cart?"]}, {"img_path": "cloth_store_1_9_9.png", "boxes": [[1474, 133, 84, 235]], "captions": ["I am referring to the red and white jacket in the middle shelf."]}, {"img_path": "cloth_store_1416238_woman_8_10.png", "boxes": [[824, 709, 84, 294]], "captions": ["t the black one on the floor rack?"]}, {"img_path": "cloth_store_2_11_1.png", "boxes": [[1643, 407, 283, 381]], "captions": ["What else do you have in a similar color as the blue ones in the front right cubby?"]}, {"img_path": "cloth_store_1_19_0.png", "boxes": [[329, 240, 29, 127], [408, 415, 135, 44], [261, 412, 168, 89], [1133, 420, 43, 251]], "captions": ["They're ok, I really like that brown coat hanging  on the left wall just to the right of the mirror, can I have one?", "The nearest white hat on the shelf.", "The one displayed on the table on the left.", " add the grey trousers in the middle of the display to my cart?"]}, {"img_path": "cloth_store_1_3_0.png", "boxes": [[1446, 423, 236, 103]], "captions": ["Do you have anything in the same color as that black hat on the table but with a design and in extra large?"]}, {"img_path": "cloth_store_paul_5_5.png", "boxes": [[803, 301, 43, 110]], "captions": ["The black jacket on the right side in the second to last section."]}, {"img_path": "cloth_store_3_16_9.png", "boxes": [[947, 428, 97, 177], [1980, 421, 117, 265]], "captions": ["Oh I love their stuff, it's so comfortable.   add one of those to my cart please.", " the black coat hanging on the right wall."]}, {"img_path": "cloth_store_1_16_3.png", "boxes": [[447, 434, 44, 127]], "captions": [" the one on the carousel please."]}, {"img_path": "cloth_store_1_16_2.png", "boxes": [[1609, 124, 46, 273], [51, 532, 497, 256]], "captions": [" that light grey coat in the left middle cubby of the back dresser to my cart, please.", "The first pants on the wall that are camo print."]}, {"img_path": "cloth_store_3_4_7.png", "boxes": [[858, 250, 36, 125], [982, 216, 81, 208], [1382, 157, 337, 490]], "captions": [" add the white T-shirt in the upper left corner against the wall on the right to my cart.", "The brown jacket that is hanging in the center of the right wall above the light blue jeans.", "The grey one on the top right rack."]}, {"img_path": "cloth_store_1498649_woman_6_5.png", "boxes": [[909, 365, 384, 548]], "captions": ["OK, I will take the red, white, and yellow blouse on the rack. please add it to my cart."]}, {"img_path": "cloth_store_1_11_10.png", "boxes": [[660, 424, 47, 76], [762, 530, 168, 258]], "captions": ["Hm.  tell me about that coat on the rack? At least the price and size.", "The grey and white jacket on the front side of the center rack."]}, {"img_path": "cloth_store_3_19_9.png", "boxes": [[1, 146, 286, 475]], "captions": [" tell me the size and price of the brown jacket on the top rack?"]}, {"img_path": "cloth_store_1_11_1.png", "boxes": [[1027, 1, 99, 371]], "captions": ["What do you have that's similar to the one in the third cabinet?"]}, {"img_path": "cloth_store_2_2_1.png", "boxes": [[890, 1, 118, 325]], "captions": ["The one on the top left shelf."]}, {"img_path": "cloth_store_2_10_1.png", "boxes": [[1328, 363, 30, 155], [970, 420, 39, 144], [973, 399, 67, 172]], "captions": [" add the grey coat hanging on the bottom rack at the back right wall to my cart?", "The blue hoodie hanging on the center rack.", "t the grey one on the back floor rack."]}, {"img_path": "cloth_store_paul_15_0.png", "boxes": [[1925, 288, 46, 147]], "captions": ["What about that black coat in the cubbyhole? What sizes does it come in?"]}, {"img_path": "cloth_store_2_4_0.png", "boxes": [[1351, 307, 83, 207], [752, 388, 149, 353], [797, 425, 152, 363]], "captions": ["The black coat on the right wall you showed me.", "The light grey jacket on the rack.", "The rightmost one of the two on the circular rack."]}, {"img_path": "cloth_store_1498649_woman_7_7.png", "boxes": [[751, 293, 176, 172], [897, 302, 143, 156]], "captions": ["Let's put one of the dark green, dark blue jackets from the back of the table in my cart also.", " to buy the blue and green jacket from the center of the table."]}, {"img_path": "cloth_store_1416238_woman_4_6.png", "boxes": [[1577, 730, 198, 264]], "captions": ["The brown jacket hanging on the rack to the right."]}, {"img_path": "cloth_store_2_11_2.png", "boxes": [[1039, 182, 27, 200]], "captions": ["The blue hoodie on the right side shelf?"]}, {"img_path": "cloth_store_1_20_1.png", "boxes": [[1396, 164, 29, 157]], "captions": ["The black jacket on the right side of the mirror."]}, {"img_path": "cloth_store_3_8_11.png", "boxes": [[830, 350, 71, 155], [53, 507, 351, 281]], "captions": ["i'll take the brown one that is in the middle on the right wall.", "It's the grey one in front on that little rack."]}, {"img_path": "cloth_store_2_14_10.png", "boxes": [[1365, 40, 128, 268], [1348, 310, 145, 292], [744, 408, 129, 215]], "captions": ["Do you have anything similar in brand to the blue shirt on the top rack, but with good reviews and twin colors?", "I'm talking about the light grey jacket in the very front on the bottom row of the rack on the right wall.", "I am talking about the brown hoodie on the rack."]}, {"img_path": "cloth_store_1498649_woman_20_7.png", "boxes": [[812, 694, 186, 80], [703, 872, 169, 43]], "captions": [" to get that grey shirt on the right of the table as well.", "The yellow and black sweater on the front of the table."]}, {"img_path": "cloth_store_2_4_5.png", "boxes": [[950, 358, 29, 116], [1451, 451, 228, 337]], "captions": ["I'm also looking for an expensive shirt, so I might be jumping around a bit.  Do you have anything like that blue shirt on the far end of the bottom row past the mirror, but by StyleNow Feed?", "Yeah, those ones in the bottom left cubby on my right."]}, {"img_path": "cloth_store_paul_18_6.png", "boxes": [[1657, 318, 35, 107], [1790, 312, 44, 121]], "captions": ["Have anything like the blue one on the back wall, but in blue?", "Make sure you add the blue jacket hanging in that cubby to my cart."]}, {"img_path": "cloth_store_1416238_woman_15_0.png", "boxes": [[1439, 761, 110, 33]], "captions": ["The brown one on the top of the table."]}, {"img_path": "cloth_store_paul_17_8.png", "boxes": [[1482, 529, 80, 183], [1604, 625, 98, 63]], "captions": ["The dark green ones on the rightmost cubby in the left dresser.", "The grey hat on the very left side of the table."]}, {"img_path": "cloth_store_paul_17_0.png", "boxes": [[1872, 258, 73, 130], [945, 404, 20, 135], [1624, 549, 52, 47], [1391, 570, 131, 218]], "captions": ["The blue shirt in the cubbyhole second from right, in the middle row against the far wall.", "The grey coat hanging on the circular rack in back.", "Wow I just saw that light grey jacket on the front rack to the right, and I know in my heart it's a winner. I definitely want that in my cart.", "The brown one on the left side of the front rack."]}, {"img_path": "cloth_store_2_14_3.png", "boxes": [[88, 410, 311, 378], [966, 670, 85, 55]], "captions": ["The jeans in the cubby to the left of the mirror.", "The red pair of shoes in the cubby."]}, {"img_path": "cloth_store_3_14_1.png", "boxes": [[584, 337, 119, 186]], "captions": ["The black suit on the table that you showed me."]}, {"img_path": "cloth_store_1416238_woman_10_9.png", "boxes": [[1629, 443, 37, 156], [1674, 408, 121, 200], [1615, 635, 50, 209]], "captions": [" the black sweater on the right closet.", "I'm asking about this black item on the rack.", "i mean the ones in the second cabinet from the door."]}, {"img_path": "cloth_store_1416238_woman_20_4.png", "boxes": [[1460, 507, 28, 134], [1159, 603, 18, 165], [1444, 740, 174, 46]], "captions": ["I'm looking at the purple dress on the right wall.", " something with a similar price and rating as the black and olive dress on the back rack.", "The green hoodie hanging on the center front rack."]}, {"img_path": "cloth_store_2_4_2.png", "boxes": [[1274, 105, 33, 181], [1700, 1, 418, 549]], "captions": ["I am looking at the blue hoodie in the third shelf from the left in the top row in the first cabinet to our left.", "The white and black one on the table."]}, {"img_path": "cloth_store_3_1_4.png", "boxes": [[1214, 235, 68, 203], [1763, 293, 292, 447], [471, 606, 96, 182]], "captions": ["Do you have something with a price and color like that grey one up on the left wall?", " to know the price of the one on the table?", "I am referring to the grey coat in the lower left corner on the bottom rack."]}, {"img_path": "cloth_store_1498649_woman_3_4.png", "boxes": [[1394, 561, 100, 28]], "captions": ["The one on the shelf."]}, {"img_path": "cloth_store_3_13_3.png", "boxes": [[858, 462, 74, 210]], "captions": [" the ones at the bottom of the opposite wall display."]}, {"img_path": "cloth_store_1416238_woman_18_3.png", "boxes": [[944, 304, 113, 177], [1087, 500, 96, 267]], "captions": ["The green hoodie hanging on the wall on the top left.", "Do you have something else in a similar size as the black dress on the wall?"]}, {"img_path": "cloth_store_3_16_6.png", "boxes": [[84, 471, 119, 118], [879, 459, 34, 113], [425, 550, 232, 49]], "captions": [" something similar to the blue jacket on the bottom left rack of the back wall in regards to price, but with a size M.", " add the green trousers on the back right wall to my cart?", " another of the blue hoodie on the rack to my cart."]}, {"img_path": "cloth_store_1498649_woman_18_7.png", "boxes": [[867, 486, 56, 179], [643, 338, 68, 577]], "captions": ["The dark green joggers against the right wall.", " add that black dress on the floor rack to my cart?"]}, {"img_path": "cloth_store_1416238_woman_2_8.png", "boxes": [[1014, 437, 17, 193]], "captions": ["I am talking about the violet blouse in the left closet."]}, {"img_path": "cloth_store_2_2_6.png", "boxes": [[527, 1, 156, 394], [1760, 374, 128, 281]], "captions": ["The black coat in the middle cubicle on the closet.", "The grey coat on the right in the circular rack."]}, {"img_path": "cloth_store_paul_11_6.png", "boxes": [[101, 195, 250, 239], [658, 217, 59, 166]], "captions": ["Thank you! I am also thinking of getting something like that grey tshirt  on the top shelf  in the first cupboard on the left, in the very fist cube there.", "I am talking about the black t-shirt on the left-most closet."]}, {"img_path": "cloth_store_2_5_5.png", "boxes": [[776, 64, 81, 282], [229, 327, 116, 166]], "captions": ["Ok,  the one on the wall then.", "Sure!  the black coat hanging with its back to us on the floor hanger at the opposite wall from us."]}, {"img_path": "cloth_store_1416238_woman_11_0.png", "boxes": [[646, 410, 63, 187], [845, 738, 173, 265]], "captions": ["I am referring to the black jacket on the left closet.", "t the green hoodie on the floor rack."]}, {"img_path": "cloth_store_1416238_woman_20_2.png", "boxes": [[964, 286, 34, 280]], "captions": ["I am speaking about the black sweater in the second right-most cubicle."]}, {"img_path": "cloth_store_1498649_woman_5_5.png", "boxes": [[375, 139, 159, 247]], "captions": ["It's hanging against the wall on the left. To the left of that black hoodie."]}, {"img_path": "cloth_store_paul_18_4.png", "boxes": [[1384, 340, 33, 105]], "captions": ["No, but I do want the blue jacket on the other side. It's on the right side of the second cubby from the right, in the top row in back."]}, {"img_path": "cloth_store_3_15_7.png", "boxes": [[899, 306, 71, 104], [1106, 439, 79, 110]], "captions": ["The one on the far wall, in the upper left corner.", "The green hoodie on the bottom right of the rack against the back wall."]}, {"img_path": "cloth_store_3_13_7.png", "boxes": [[535, 440, 181, 348]], "captions": ["The black coat on the back side of the front left rack."]}, {"img_path": "cloth_store_1416238_woman_13_8.png", "boxes": [[758, 813, 106, 43], [815, 792, 99, 37]], "captions": ["Oh,  that gray shirt at the top left of the table!", "That white shirt on the table."]}, {"img_path": "cloth_store_2_8_9.png", "boxes": [[2, 404, 125, 326]], "captions": ["All right. Anything similar to the hoodie on the left rack but made by Global Voyager?"]}, {"img_path": "wayfair_store_14_6.png", "boxes": [[614, 325, 58, 43], [666, 315, 42, 51], [833, 323, 98, 26], [265, 353, 16, 38]], "captions": ["Alright, I'll buy that wooden table on the left then.", "The brown chair in the back on the left side of the wall over the blue rug.", "Remind me of the brand of the first table?", "Okay, then just add the white end table to my cart for me."]}, {"img_path": "cloth_store_3_6_3.png", "boxes": [[485, 514, 113, 248]], "captions": ["I'm also looking for something similar to that grey and white jacket hanging on the bottom rack on the left."]}, {"img_path": "cloth_store_1416238_woman_9_11.png", "boxes": [[423, 296, 127, 413], [77, 469, 56, 250]], "captions": [" the black jacket in the closet to my cart, please.", "I am referring to the brown dress against the wall. On the very right."]}, {"img_path": "cloth_store_1416238_woman_5_2.png", "boxes": [[294, 128, 88, 376]], "captions": ["Sure, I am looking at the black dress in the top row on the wall rack."]}, {"img_path": "cloth_store_paul_4_11.png", "boxes": [[578, 495, 88, 210]], "captions": ["Let's put the pair in the third cubby in my cart."]}, {"img_path": "cloth_store_1416238_woman_11_1.png", "boxes": [[1631, 224, 57, 196], [1763, 214, 90, 173], [1, 229, 126, 592]], "captions": ["Ok, I'll buy the black blouse hanging up on the back of the right wall.", "t this grey, white one on the top rack of the right wall.", "Alright now add the red, white, and yellow blouse to my cart.  The one on the left wall in the closet."]}, {"img_path": "cloth_store_1416238_woman_18_6.png", "boxes": [[204, 406, 23, 136], [600, 367, 47, 268], [737, 707, 120, 296]], "captions": ["The white and grey one hanging in the cubby in the very back.", "I am referring to the maroon, white, and blue blouse in the second left-most cubicle on the right closet.", "The grey pair in the cubby."]}, {"img_path": "cloth_store_1498649_woman_10_3.png", "boxes": [[1, 134, 67, 263], [130, 319, 73, 105], [645, 387, 73, 220], [682, 389, 132, 249]], "captions": ["The black jacket on the left wall.", "The grey and blue one hanging on the left side of the back wall.", "The crazy multicolored one at the back of that first rack.", "The blue hoodie on the floor rack?"]}, {"img_path": "cloth_store_paul_1_2.png", "boxes": [[1817, 121, 61, 214], [1602, 427, 88, 177]], "captions": [" the one third from the left in the third cabinet.", "It's okay.  the ones on the wall, then."]}, {"img_path": "cloth_store_1_15_5.png", "boxes": [[842, 117, 46, 193], [986, 436, 76, 112], [616, 440, 204, 213]], "captions": [" something similar to the brown hoodie at the top middle shelf, but grey with a camouflage pattern.", " add the black coat on the floor rack to my cart?", " add the black jacket on the floor rack to my card?"]}, {"img_path": "cloth_store_1_8_6.png", "boxes": [[1550, 191, 77, 205]], "captions": ["The white t-shirt in the right closet."]}, {"img_path": "cloth_store_1_9_8.png", "boxes": [[980, 153, 75, 199], [629, 549, 105, 168]], "captions": ["That blue jacket on the wall.", "Oh, I like that third blue jacket on the floor rack!  put that in my cart."]}, {"img_path": "cloth_store_1498649_woman_17_5.png", "boxes": [[953, 293, 53, 99]], "captions": [" find me something similar to the red tshirt in the back on the very last mannequin in ratings and sleeve length, but brown and with stripes."]}, {"img_path": "cloth_store_1498649_woman_9_11.png", "boxes": [[328, 414, 73, 167], [416, 407, 59, 155], [1387, 373, 101, 411]], "captions": [" to buy the brown jacket on the back wall.", "Do you have something similar to the violet blouse on the left side of the room on the bottom in the back of the rack, but with good reviews?", "t the one on the bottom rack of the right wall."]}, {"img_path": "cloth_store_paul_2_9.png", "boxes": [[747, 273, 36, 100], [1116, 280, 52, 197], [1159, 721, 78, 49]], "captions": [" the grey and white jacket to my cart, please. The one on the left closet.", "Actually, I think  the black jacket in the same section as those shoes.", "The ones on the bottom shelf under the blue jeans."]}, {"img_path": "cloth_store_paul_14_8.png", "boxes": [[1, 276, 37, 141], [582, 277, 26, 112]], "captions": ["Can I actually get one of those brown coats in the shelves at the extreme left at the back?", "What do you have similar to the one in the shelving unit in terms of price and brand but in an XS size?"]}, {"img_path": "cloth_store_paul_12_3.png", "boxes": [[1250, 465, 64, 42]], "captions": ["Let's put the green hat on right of the table in as well."]}, {"img_path": "cloth_store_1498649_woman_12_11.png", "boxes": [[1372, 393, 62, 205], [1676, 412, 208, 446]], "captions": ["The blouse on the bottom rack on the end, what size is being displayed?", "The red and white one on the right wall."]}, {"img_path": "cloth_store_1498649_woman_18_11.png", "boxes": [[873, 350, 246, 135]], "captions": [" the grey and white one on this rack in front of me."]}, {"img_path": "cloth_store_1_11_11.png", "boxes": [[975, 164, 31, 219], [635, 423, 17, 150]], "captions": ["It's that one hanging above the black pants to the very left of that shelf.", "I'm talking about the light blue ones on the middle bottom shelf of the left wardrobe."]}, {"img_path": "cloth_store_1498649_woman_9_2.png", "boxes": [[348, 319, 98, 146], [842, 205, 315, 710]], "captions": ["I am talking about the blue shirt on the table.", " to buy the black dress hanging on the front center rack."]}, {"img_path": "cloth_store_1498649_woman_20_3.png", "boxes": [[388, 226, 147, 168], [1356, 273, 131, 491], [1423, 303, 119, 481], [1487, 348, 73, 357]], "captions": ["The black and white blouse on the back wall.", "What do you have that is like the violet  dress on the rack? The one in the back behind the purple dress.", "The purple dress toward the front of the right rack.", "I am referring to the violet dress on the rack. It is the one on the extreme right."]}, {"img_path": "cloth_store_paul_10_11.png", "boxes": [[1961, 332, 86, 121], [1553, 486, 66, 124]], "captions": ["OK. Go ahead and add the grey jack on the right-most side of the cabinet.", "Do you have anything like the red and white jacket hanging on the rack, but in purple and good reviews?"]}, {"img_path": "cloth_store_1498649_woman_20_6.png", "boxes": [[1195, 315, 105, 80], [240, 393, 83, 84], [676, 329, 20, 157], [894, 332, 128, 264], [1503, 405, 82, 211]], "captions": ["Have you got anything similar to the Christmas sweater on the rack?", "Maybe a sweater isn't the way to go, but  that black long sleeve top at the bottom left of the far wall.", " the olive dress in the very back. Almost against the wall.", "have you got anything in the same rack size and in-stock size as the green hoodie?", "Show me something else like the red, white, and yellow blouse on the wall and in t. I w"]}, {"img_path": "cloth_store_1_14_5.png", "boxes": [[501, 432, 55, 56], [190, 477, 51, 62]], "captions": ["Ok, no worries, can you add that light grey coat on the rack to my cart?", "Do you have anything similar to the black one on the rack in price but in brown?"]}, {"img_path": "cloth_store_paul_10_10.png", "boxes": [[474, 677, 69, 65]], "captions": [" the grey coat in the rack to my cart, please."]}, {"img_path": "cloth_store_1498649_woman_14_4.png", "boxes": [[1125, 381, 75, 48]], "captions": ["The red t-shirt on the back left of the table."]}, {"img_path": "cloth_store_1_8_9.png", "boxes": [[417, 132, 193, 214]], "captions": ["The green hoodie hanging on the wall next to the mirror."]}, {"img_path": "cloth_store_1416238_woman_13_7.png", "boxes": [[603, 302, 45, 158], [613, 302, 45, 160], [721, 514, 41, 191]], "captions": ["The maroon, white, and blue one up in the cubby.", "Sure, I am looking at the maroon, white, and blue blouse in the second compartment from the right in the cupboard by the door. There are two of them there; I am interested in the one that hangs closer to us.", "The dark joggers from the cubby next to the mirror."]}, {"img_path": "cloth_store_1_4_1.png", "boxes": [[621, 23, 84, 337]], "captions": ["The blue jacket in the third cubby from the right."]}, {"img_path": "cloth_store_2_17_2.png", "boxes": [[560, 203, 28, 138], [504, 344, 32, 112]], "captions": ["The brown coat hanging on the wall in the back.", "The one hanging on the right wall."]}, {"img_path": "cloth_store_paul_10_5.png", "boxes": [[987, 324, 55, 178], [498, 567, 83, 53]], "captions": ["Do you have anything else like the one on the left side of the cubby?", " tell me how much that dirty green beanie on the table costs?"]}, {"img_path": "cloth_store_2_8_0.png", "boxes": [[355, 692, 145, 95]], "captions": ["The grey pair in the front cubby."]}, {"img_path": "wayfair_store_1_10.png", "boxes": [[1053, 326, 168, 95], [421, 370, 154, 80], [713, 244, 131, 386], [334, 396, 283, 173], [551, 400, 163, 173]], "captions": ["Would you add the one against the wall to my cart?", " those low shelves.", "Will you add the wooden shelves in the front to my cart?", "Hm... what is that table made of?", "The black chair by the big table in the middle."]}, {"img_path": "cloth_store_1_20_3.png", "boxes": [[843, 131, 43, 214], [749, 398, 80, 232]], "captions": ["The one in the second cubby to the left of the mirror.", "Actually, those green joggers one cubby left and one down from the red and white jacket are very much my speed.   add those to my cart please?"]}, {"img_path": "cloth_store_1498649_woman_12_3.png", "boxes": [[869, 526, 292, 108], [612, 548, 297, 152], [1043, 691, 287, 156]], "captions": [" the second one on the far table.", "The shirt on the back table, the first one on the left.", "The green and white striped shirt on the table."]}, {"img_path": "cloth_store_1416238_woman_19_11.png", "boxes": [[557, 426, 146, 345]], "captions": ["The purple dress hanging on the wall."]}, {"img_path": "cloth_store_2_16_6.png", "boxes": [[684, 1, 174, 455], [1140, 457, 38, 283]], "captions": ["Of the two grey ones in that cubby, the one toward the front.", "What is the brand of the green joggers in the cubbyhole fourth from left?"]}, {"img_path": "cloth_store_1416238_woman_7_10.png", "boxes": [[1668, 641, 106, 256]], "captions": ["The maroon dress hanging on the front of the right rack."]}, {"img_path": "cloth_store_1416238_woman_18_0.png", "boxes": [[115, 387, 121, 292], [548, 383, 96, 317], [346, 419, 142, 320]], "captions": ["The black sweater on the far left of the shelf display.", " something in a similar color as that black blouse in the second cubby from the mirror but with a more affordable price.", "The black coat you just mentioned. In the second cubicle to the left."]}, {"img_path": "cloth_store_paul_10_8.png", "boxes": [[629, 285, 29, 126], [1482, 552, 118, 49]], "captions": ["The black coat on that same rack as the pink shirt.", "I would like to see a hat in a similar color as the white one on the right table, but in extra small with a good customer rating."]}, {"img_path": "cloth_store_3_3_10.png", "boxes": [[606, 298, 66, 113], [955, 341, 65, 132], [1235, 471, 27, 159], [189, 523, 187, 265]], "captions": ["I am looking at the white tshirt that hangs on the left of the top hanger at the left wall furthest away from us.", "The grey one on the back table.", "The grey one on the wall.", "Thanks. I will actually take the brown coat to the left of the first green hooded sweater on the floor rack."]}, {"img_path": "wayfair_store_9_3.png", "boxes": [[1465, 365, 14, 21], [697, 396, 131, 141], [537, 445, 79, 122]], "captions": ["Perfect!  throw in the black end table behind the other chair?", "That beige chair by the wall.", " the white end table to my cart."]}, {"img_path": "cloth_store_1498649_woman_15_2.png", "boxes": [[978, 470, 98, 214]], "captions": ["I am interested in the grey pants at the wall in front of us."]}, {"img_path": "cloth_store_1498649_woman_10_10.png", "boxes": [[1721, 239, 45, 144], [156, 371, 259, 397]], "captions": ["The maroon, white, and blue blouse on the right wall.", " something from the same company as that grey coat on the left wall, but with some kind of design on it."]}, {"img_path": "cloth_store_2_5_11.png", "boxes": [[57, 148, 498, 361]], "captions": [" the blue and green jacket on the table display."]}, {"img_path": "cloth_store_1498649_woman_14_5.png", "boxes": [[1316, 286, 116, 138], [955, 353, 110, 162], [1298, 465, 126, 174]], "captions": ["Yes, it is the pink and white blouse on the left in the top row on the wall.", "The dark green and blue jacket on the table to the left.", "The blue jacket hanging on the wall."]}, {"img_path": "cloth_store_1_2_10.png", "boxes": [[20, 66, 72, 251], [205, 23, 104, 318], [397, 3, 137, 324]], "captions": ["The grey coat on the far left of the far left cubby.", "That's okay, I think I'm gonna go with the black coat in the third cubby to the left of the mirror.   it to my cart.", "The blue jacket hanging in the third cubby from the left."]}, {"img_path": "cloth_store_1_1_5.png", "boxes": [[965, 386, 203, 402]], "captions": ["The green camouflage pants in the right middle cubby."]}, {"img_path": "cloth_store_2_18_5.png", "boxes": [[1583, 1, 103, 349]], "captions": ["I think I might wanna get a coat first, actually.  Do you have anything by the same brand as that black one in the third cubby from the mirror?"]}, {"img_path": "cloth_store_3_11_1.png", "boxes": [[1446, 426, 244, 223], [2015, 461, 82, 233]], "captions": [" add that one on the table to my cart then?", "The white t-shirt on the table on the right."]}, {"img_path": "cloth_store_1_7_9.png", "boxes": [[1130, 496, 215, 69]], "captions": ["The green hoodie on the rack. The one behind the black hoodie."]}, {"img_path": "cloth_store_paul_5_1.png", "boxes": [[1064, 543, 79, 245]], "captions": ["The black one on that middle rack."]}, {"img_path": "cloth_store_2_15_5.png", "boxes": [[193, 271, 63, 162], [590, 399, 57, 173], [1162, 611, 63, 31]], "captions": ["The purple one on the back left shelf.", " the grey coat in the back on the same rack.", "I am talking about the blue shoes on the right wall."]}, {"img_path": "cloth_store_2_4_7.png", "boxes": [[1837, 322, 228, 251]], "captions": ["The light grey jacket on the rack in the back of the room."]}, {"img_path": "cloth_store_1416238_woman_12_6.png", "boxes": [[552, 322, 94, 198]], "captions": ["The one in the cubby above the grey pants."]}, {"img_path": "cloth_store_1498649_woman_4_3.png", "boxes": [[1065, 270, 59, 86], [1126, 248, 74, 154]], "captions": ["The grey coat up on the right wall.", "The one on the right wall."]}, {"img_path": "cloth_store_3_6_8.png", "boxes": [[1513, 295, 79, 107], [1923, 231, 174, 177]], "captions": ["The one all in the way in the back on the mannequin.", "I'm talking about the blue one on the top rack of the right wall."]}, {"img_path": "cloth_store_1_10_8.png", "boxes": [[1752, 527, 217, 261]], "captions": ["The grey and white jacket on the front side of the rack."]}, {"img_path": "cloth_store_1498649_woman_19_5.png", "boxes": [[1034, 388, 49, 172], [198, 175, 396, 721]], "captions": ["The grey pair of jeans on the right wall.", " add the black dress on the center floor rack to my cart?"]}, {"img_path": "cloth_store_paul_20_4.png", "boxes": [[94, 207, 54, 136], [851, 495, 126, 85]], "captions": ["The brown coat in the second cubby from the left.", " the yellow T-shirt in the front rack to my cart."]}, {"img_path": "cloth_store_1_10_6.png", "boxes": [[322, 411, 112, 306]], "captions": [" stick the grey pants in the back section of the left shelf in my cart for me?"]}, {"img_path": "wayfair_store_15_10.png", "boxes": [[455, 439, 37, 42], [423, 480, 93, 20], [515, 456, 64, 16], [1, 481, 32, 71], [193, 479, 72, 87], [326, 514, 93, 73]], "captions": ["Speaking of end tables, how about you tell me the materials of the other one?", "The coffee table more toward the ottoman.", "Sure, I am looking at the brown coffee table that is further away from us in the display in front of us and to the left.", "Do you have a lamp in a similar egg-shell shade as this one on the far left?", " it the black end table to my cart for me.", "Will you add the brown ottoman next to the coffee tables to my cart?"]}, {"img_path": "cloth_store_2_1_6.png", "boxes": [[1, 451, 91, 337]], "captions": ["The one on the rack to the far left."]}, {"img_path": "cloth_store_3_6_10.png", "boxes": [[1382, 353, 254, 355]], "captions": ["The dark green and dark blue jacket displayed on the right table."]}, {"img_path": "cloth_store_1416238_woman_18_4.png", "boxes": [[793, 257, 152, 457]], "captions": ["The grey coat in the middle of the closet."]}, {"img_path": "cloth_store_2_13_10.png", "boxes": [[30, 45, 173, 358]], "captions": [" the black coat in the first left cubby to my cart."]}, {"img_path": "wayfair_store_6_3.png", "boxes": [[1122, 417, 17, 8], [1140, 409, 7, 19], [750, 550, 97, 164]], "captions": ["Do you have anything comparable to that white end table in rating but from Downtown Consignment?", "Ok, ah, leather is too mainstream. Can we move onto end tables instead? I would like to see something like the white one in the back in brand but in a higher price range please.", "Do you have something priced similarly and in the same color as the black end table?"]}, {"img_path": "cloth_store_1498649_woman_4_1.png", "boxes": [[1350, 364, 58, 69]], "captions": ["Alright, I'll think about those. In the meantime, do you have anything else like that pink and white blouse on the back wall??"]}, {"img_path": "cloth_store_paul_16_7.png", "boxes": [[1758, 423, 51, 132], [1243, 433, 98, 144]], "captions": [" add the light grey jacket on the right rack to my cart.", " tell me the size on the rack, and what sizes you have in stock?"]}, {"img_path": "cloth_store_1416238_woman_16_8.png", "boxes": [[557, 447, 33, 166]], "captions": ["The green, violet, and pink one you showed me in the cubby."]}, {"img_path": "cloth_store_paul_15_10.png", "boxes": [[341, 341, 85, 102], [936, 355, 36, 68], [387, 486, 64, 133]], "captions": ["I just love that grey one on the set of shelves to the left.  you to add that to my cart.", "The one on the shelves to the right.", " add the brown hoodie on the back left floor rack to my cart?"]}, {"img_path": "cloth_store_1416238_woman_16_2.png", "boxes": [[659, 291, 83, 228], [337, 504, 26, 155], [76, 742, 245, 259]], "captions": ["The white and black blouse up in the cubby.", "The light blue pair of jeans in the back left cubby.", "Yes, I will take the red, white, and black one on the rack.  add it to my cart."]}, {"img_path": "cloth_store_2_5_7.png", "boxes": [[1422, 18, 122, 339], [98, 1, 496, 592], [812, 360, 54, 173], [1640, 447, 339, 341]], "captions": ["Do you have anything like the grey one in the cubby but with an affordable price?", "The one on the left on the table.", " something similar to that grey jacket hanging on the back rack but in small.", "Let's put another of the pair of pants in the front cubby in my cart."]}, {"img_path": "cloth_store_1498649_woman_10_7.png", "boxes": [[1072, 224, 72, 175], [1502, 491, 114, 26], [1, 278, 241, 635], [347, 316, 108, 488]], "captions": [" something similar to the black coat on the back wall but with no sleeves.", " something like the brown shirt on the center shelf of the table in terms of customer reviews and brand.", "The brown jacket farthest to the left on the front rack.", "The brown jacket hanging on the center rack."]}, {"img_path": "cloth_store_1416238_woman_19_0.png", "boxes": [[508, 139, 155, 281], [480, 937, 200, 66]], "captions": ["It's the bright blue jacket hanging up top on the left-side wall.", "The yellow and black sweater on the front side of the table."]}, {"img_path": "cloth_store_paul_13_0.png", "boxes": [[2068, 334, 29, 106]], "captions": ["I'll go with the one on the wall."]}, {"img_path": "cloth_store_1416238_woman_10_11.png", "boxes": [[1310, 331, 67, 275], [1333, 323, 77, 277]], "captions": [" the pale yellow one in the third cabinet..", "The white and black blouse in the cubby."]}, {"img_path": "cloth_store_1416238_woman_19_2.png", "boxes": [[250, 477, 54, 137], [1164, 916, 62, 53]], "captions": ["That pink one hanging against the wall on the left.", "t those grey ones at the bottom shelf of the right wardrobe."]}, {"img_path": "cloth_store_1416238_woman_14_6.png", "boxes": [[613, 504, 124, 258]], "captions": ["I'd actually like to get something with a similar price and size of the grey jacket directly above the table."]}, {"img_path": "cloth_store_1_13_2.png", "boxes": [[1264, 135, 126, 187]], "captions": [" the on hanging to the right of the mirror."]}, {"img_path": "cloth_store_1_4_6.png", "boxes": [[575, 28, 189, 376]], "captions": [" something with similar sleeves and pricing as the one in the cubby but made by Coats & More."]}, {"img_path": "cloth_store_1416238_woman_16_4.png", "boxes": [[1068, 373, 71, 367], [41, 879, 209, 110]], "captions": ["The maroon one you suggested, hanging on the wall.", "The purple dress on the left rack."]}, {"img_path": "cloth_store_3_1_2.png", "boxes": [[644, 251, 163, 215], [1923, 385, 150, 116], [476, 502, 175, 239]], "captions": ["The green one on the top left of the front wall.", "Do you have anything at a similar sizeand with comparable ratings to the denim jacket on the right side of the table at the back right?  It needs to have full sleeves.", " find me one like the light grey one on the wall, but with good ratings?"]}, {"img_path": "wayfair_store_12_11.png", "boxes": [[1027, 432, 27, 15], [1048, 422, 22, 28], [1432, 435, 47, 53], [723, 490, 144, 170], [234, 660, 184, 128]], "captions": [" get me the rating for the brown end table?", "Not really, but I could definitely go for that precious white table next to it! Do you mind putting that in my cart for me?", "The table you just mentioned.", "The blue one against the wall between the rugs.", "Actually, I like the white end table on the near left, I think something that that would be great for my dining room.  Do you have any others like it in grey?  Wood would also be great."]}, {"img_path": "cloth_store_1_19_7.png", "boxes": [[1041, 385, 23, 106], [1201, 503, 109, 135]], "captions": ["The first black coat you pointed out, the one in the back of the rack.", "The grey and blue shirt hanging on the rack."]}, {"img_path": "cloth_store_1416238_woman_1_6.png", "boxes": [[298, 456, 81, 190], [873, 580, 26, 208], [1340, 678, 78, 325]], "captions": ["Let's put the white t-shirt from the left wall in my cart.", "That solid red dress on the right-hand side of the rack in the back with the dark pink dresses.", "The blue jeans in the closet on the right side of the room. The back ones."]}, {"img_path": "cloth_store_3_19_8.png", "boxes": [[2013, 542, 84, 246]], "captions": [" the gray one closest to us on the bottom row on the right wall."]}, {"img_path": "cloth_store_1498649_woman_4_6.png", "boxes": [[747, 302, 193, 374]], "captions": ["The black blouse on the rack."]}, {"img_path": "wayfair_store_18_5.png", "boxes": [[1179, 419, 29, 34], [1162, 432, 37, 46], [1251, 426, 141, 70], [1241, 487, 199, 28]], "captions": ["Wait, do you have something that's the same color as that end table in the very back, but with high ratings?", " the black end table to the left of that couch.", " the white sofa to the right of the black end table.", "Actually, I like the coffee table next to it.   add it to my cart."]}, {"img_path": "wayfair_store_2_10.png", "boxes": [[449, 414, 35, 50], [759, 397, 31, 34], [802, 412, 99, 45], [750, 428, 85, 65], [1222, 457, 257, 247]], "captions": ["The lamp on the wall. The only lamp.", "Let's put that black end table in my cart.", " show me something like that gray cocktail table in front of the green couch, but with a good rating and made of wool?", "The coffee table that's a little closer to me.", "The table please."]}, {"img_path": "cloth_store_2_10_6.png", "boxes": [[1364, 165, 31, 144]], "captions": [" something with similar ratings and sizes as the black jacket hanging up on the top of the right wall but affordably priced and made by North Lodge."]}, {"img_path": "cloth_store_1416238_woman_8_0.png", "boxes": [[878, 176, 343, 581]], "captions": ["It's the one in the first cubicle in the center."]}, {"img_path": "cloth_store_3_12_8.png", "boxes": [[1641, 524, 117, 233]], "captions": ["And I like that white vest on the bottom rack to the right as well, put that in my cart please."]}, {"img_path": "cloth_store_1_3_5.png", "boxes": [[1223, 355, 42, 97]], "captions": ["I am talking about the grey coat on the circular rack. In the middle."]}, {"img_path": "cloth_store_2_1_10.png", "boxes": [[1022, 381, 68, 218]], "captions": ["The grey coat on the circular rack in the middle of the room."]}, {"img_path": "cloth_store_1_1_11.png", "boxes": [[539, 203, 48, 185]], "captions": ["That black coat in the second cubby from the right on the left side looks pretty good too, the one closer to me.   add that to my cart?"]}, {"img_path": "cloth_store_2_18_9.png", "boxes": [[691, 120, 44, 291]], "captions": ["No worries.  put the grey coat in the first cubby into my cart."]}, {"img_path": "cloth_store_2_13_1.png", "boxes": [[1255, 676, 120, 65]], "captions": ["The black and white shoes on the bottom shelf."]}, {"img_path": "cloth_store_3_15_9.png", "boxes": [[883, 303, 42, 82], [1001, 314, 50, 117], [1476, 18, 153, 682], [788, 406, 138, 305], [560, 442, 184, 346], [1411, 546, 77, 242]], "captions": ["The green hoodie on the left wall. The one in the very back.", "Let's put the purple t-shirt on the table in my cart.", "The light grey coat on the front of the right wall.", " something else similar to the grey coat on the center rack.", " find me something similar to the grey coat on the left side of the rack?", " the one on the right wall to my cart for me."]}, {"img_path": "cloth_store_paul_19_1.png", "boxes": [[355, 273, 43, 97], [769, 385, 39, 88]], "captions": ["Actually,  the brown hoodie in the second section of the first wall shelf.", "Thanks! I will take that brown hooded sweater on the floor rack at the far end of the lower shelf on the far left."]}, {"img_path": "cloth_store_2_9_5.png", "boxes": [[1851, 394, 267, 392]], "captions": [" the light grey jacket on the floor rack to my cart."]}, {"img_path": "cloth_store_paul_1_9.png", "boxes": [[212, 445, 61, 121], [1131, 456, 35, 121], [1462, 460, 89, 145]], "captions": ["The light blue jeans on the left wall.", "The brown one on the middle rack.", "The brown coat on the back side of the rack on the right side of the room."]}, {"img_path": "cloth_store_2_20_1.png", "boxes": [[1034, 452, 156, 336], [1314, 442, 153, 346]], "captions": ["The same pair on the wall.", "Yes, sure, the ones on the right in the cupboard in front of us."]}, {"img_path": "cloth_store_1416238_woman_20_6.png", "boxes": [[195, 329, 72, 199]], "captions": ["I am talking about the white, red, and violet blouse on the left closet. It is in the left-most cubicle."]}, {"img_path": "cloth_store_1498649_woman_17_8.png", "boxes": [[570, 202, 140, 225]], "captions": [" to buy the one hanging up on the wall."]}, {"img_path": "cloth_store_1_3_11.png", "boxes": [[459, 389, 83, 35], [34, 402, 203, 386]], "captions": ["I'm talking about the grey hat at the very end of this table.", " the blue one on the rack to the left of the brown one."]}, {"img_path": "cloth_store_paul_15_11.png", "boxes": [[426, 421, 84, 164]], "captions": ["The ones in the first cubby to the left of the mirror."]}, {"img_path": "cloth_store_1416238_woman_18_7.png", "boxes": [[1255, 614, 92, 241]], "captions": ["The grey pair in the third cubby from the left."]}, {"img_path": "cloth_store_1498649_woman_8_1.png", "boxes": [[1, 134, 519, 781], [667, 197, 139, 718], [1502, 193, 331, 722]], "captions": [" to buy the red and white jacket from that front rack.", "The grey one on the left rack you suggested.", "Do you have anything like the gray dress on the rack on the right, but with good reviews?"]}, {"img_path": "cloth_store_2_10_11.png", "boxes": [[406, 118, 59, 179], [1596, 356, 57, 59], [1766, 373, 55, 99]], "captions": ["Yes, can you show me something like the green hoodie in the third shelf from the right?", " the one on the back side of th rack at the front right.", "The black coat on the back side of the rack on the right."]}, {"img_path": "cloth_store_1_7_8.png", "boxes": [[13, 3, 142, 294], [1116, 381, 116, 291]], "captions": [" the brown hoodie. The last item on the top row in the left shelf.", " something with a similar rating as those grey jeans on the right side of the mirror but made by Home Store."]}, {"img_path": "cloth_store_1416238_woman_15_5.png", "boxes": [[1558, 320, 109, 229], [1393, 942, 46, 61]], "captions": ["Then please give me the black blouse that I see hanging up in the center top compartment on the right.", "Sure thing. I'm looking at the rack that's at the front of the room. The jacket is black."]}, {"img_path": "cloth_store_1416238_woman_6_6.png", "boxes": [[445, 671, 23, 276], [973, 855, 192, 148]], "captions": ["The blue trousers on the left of the right closet.", "I am talking about the grey jeans in the closet. On the very right."]}, {"img_path": "wayfair_store_19_7.png", "boxes": [[472, 329, 28, 37], [172, 320, 117, 72], [235, 327, 62, 56], [259, 337, 135, 57], [425, 332, 80, 42]], "captions": ["I don't know about the tables, but I do like that white chair in back. Gimme one of those for sure.", "I'm talking about that darker table in the back left.", "The black and white one on the left side of the wall.", "The shelves near the middle wall over there, the tall wooden one.", "Well drat.  that brown table way over there in the back to the right at least."]}, {"img_path": "cloth_store_1_7_1.png", "boxes": [[908, 542, 52, 123], [405, 584, 91, 148]], "captions": [" add the jacket on the right side of the rack to my cart.", " to buy something with a color and brand like the red and white jacket on the left of the near rack."]}, {"img_path": "cloth_store_1498649_woman_13_3.png", "boxes": [[990, 300, 116, 410]], "captions": ["t the purple one on the floor rack."]}, {"img_path": "cloth_store_3_16_2.png", "boxes": [[1189, 408, 76, 190]], "captions": ["The block coat on the back wall, bottom left."]}, {"img_path": "cloth_store_paul_17_7.png", "boxes": [[1871, 324, 95, 176]], "captions": ["The black coat on the right shelf on top."]}, {"img_path": "cloth_store_3_13_5.png", "boxes": [[165, 535, 99, 211]], "captions": [" the dark green shirt hanging on the left rack next to the yellow one."]}, {"img_path": "cloth_store_3_7_7.png", "boxes": [[747, 349, 197, 288]], "captions": ["Can I get one of the grey jackets from the back right of the table?"]}, {"img_path": "cloth_store_paul_6_2.png", "boxes": [[635, 399, 78, 128], [727, 409, 60, 130]], "captions": ["The blue jacket on the back left rack.", " the one on the left center rack."]}, {"img_path": "cloth_store_1_14_2.png", "boxes": [[884, 546, 190, 242]], "captions": ["The light grey jacket on the right side of the center rack."]}, {"img_path": "cloth_store_3_12_10.png", "boxes": [[1, 1, 506, 713], [472, 1, 439, 724], [926, 70, 311, 570], [1781, 419, 146, 159], [941, 606, 233, 182]], "captions": [" the grey and white jacket on the top leftmost rack.", "The grey coat in the center of the front wall.", " the black jacket on the top right of the front wall.", "I don't know about that. How about something like the grey jacket on the bottom left of the back wall?", "Is there anything similar to the grey jacket on the bottom right of the left side of the wall?"]}, {"img_path": "cloth_store_1498649_woman_18_1.png", "boxes": [[1, 1, 352, 363], [1037, 343, 44, 63], [772, 419, 50, 152], [1536, 420, 45, 128]], "captions": ["Actually, I'll just grab that brown hoodie on the left wall.", "The black jacket on the back wall.", "I'll also get that brown jacket on the left wall too.", "The light blue pair on the back of the right wall."]}, {"img_path": "cloth_store_2_18_4.png", "boxes": [[382, 398, 129, 190]], "captions": ["The dark blue one on the rack."]}, {"img_path": "cloth_store_1_10_0.png", "boxes": [[112, 7, 98, 449], [441, 82, 84, 334]], "captions": ["Yeah,  to get that black jacket in the far left cabinet.   put it in my cart?", "I'd also like to get the white tee hanging in the third cabinet."]}, {"img_path": "cloth_store_1498649_woman_16_11.png", "boxes": [[1292, 192, 37, 199], [567, 327, 124, 317]], "captions": ["Do you have something with similar sleeves as the black blouse on the top row of the wall?", "Let's put the black dress from the center rack in my cart."]}, {"img_path": "wayfair_store_7_0.png", "boxes": [[1137, 416, 26, 31], [1142, 408, 22, 26], [921, 537, 94, 147]], "captions": [" give me something like that end table, same price but from Downtown Consignment and made of leather?", "Also, could you find something similar to the black end table in color except by Downtown Consignment.", "Ok, then add the end table nearest to the front I asked about."]}, {"img_path": "cloth_store_paul_1_3.png", "boxes": [[249, 214, 113, 296], [824, 270, 56, 162]], "captions": [" the one against the wall to my cart.", " the black coat in the back wall to my cart."]}, {"img_path": "cloth_store_3_17_2.png", "boxes": [[805, 433, 161, 189]], "captions": ["I see.  tell me the size of the black jacket that's second from the right in the bottom row on the wall to the left? Also, what company makes it?"]}, {"img_path": "cloth_store_1416238_woman_17_5.png", "boxes": [[1180, 398, 127, 265]], "captions": ["The brown coat in the cubby to the right of the mirror."]}, {"img_path": "cloth_store_1416238_woman_9_0.png", "boxes": [[719, 492, 55, 240]], "captions": ["I don't think I can afford either of those. I'll just go with the purple one on the wall then, thanks."]}, {"img_path": "cloth_store_3_13_1.png", "boxes": [[1157, 219, 287, 423], [1, 420, 95, 221]], "captions": ["The red and white jacket hanging on the top right on the wall.", " the blue shirt on the table to the left to my cart."]}, {"img_path": "cloth_store_paul_6_0.png", "boxes": [[675, 425, 67, 155]], "captions": ["The one on the rack behind the table"]}, {"img_path": "cloth_store_1416238_woman_7_4.png", "boxes": [[139, 398, 117, 208], [549, 828, 135, 175]], "captions": [" the one in the second cabinet.", "The light blue ones in the fourth cabinet."]}, {"img_path": "wayfair_store_14_3.png", "boxes": [[39, 442, 40, 8], [58, 430, 30, 25], [428, 419, 44, 22], [469, 409, 41, 46]], "captions": ["Thanks! Do you have an end table similar to the white one but cheaper?", "I don't know. Do you have any end tables in the price range of the white one on the left in the back, but with good ratings?", "Ok, how about a table like the one towards the back but expensive?", " the brown one beside the table you told me about earlier."]}, {"img_path": "cloth_store_1_20_4.png", "boxes": [[1414, 715, 129, 73]], "captions": ["The ones on the wall under the pair of joggers closest to the jeans."]}, {"img_path": "cloth_store_3_3_0.png", "boxes": [[115, 296, 101, 169], [204, 320, 145, 199], [760, 452, 47, 212]], "captions": ["The white and grey one on the mannequin.", "The grey jacket on the table.", "The blue hoodie on the wall."]}, {"img_path": "cloth_store_3_9_5.png", "boxes": [[656, 340, 73, 106], [1158, 541, 244, 247]], "captions": ["Oh, add that black one at the back wall to my cart for me please.", " add the gray one on the right side of the rack to my cart."]}, {"img_path": "cloth_store_2_1_1.png", "boxes": [[1218, 654, 58, 44]], "captions": ["I am looking at the blue pair on the lowest shelf near the entrance."]}, {"img_path": "cloth_store_3_18_7.png", "boxes": [[803, 388, 85, 114]], "captions": ["The one over in the corner on the table."]}, {"img_path": "cloth_store_2_10_3.png", "boxes": [[384, 352, 90, 66]], "captions": ["The brown hoodie on the rack in the back."]}, {"img_path": "cloth_store_1416238_woman_2_4.png", "boxes": [[1524, 773, 144, 49]], "captions": ["The grey and brown shirt fourth from the left in the back row on the table."]}, {"img_path": "cloth_store_1416238_woman_10_4.png", "boxes": [[1328, 241, 85, 284]], "captions": ["The black dress in the same cubby."]}], "val": [{"img_path": "cloth_store_1416238_woman_6_7.png", "boxes": [[1665, 454, 53, 150], [989, 844, 107, 69]], "captions": [" add the white, red, violet blouse at the top center shelf on the right wardrobe?", "The brown one on the front center rack."]}, {"img_path": "wayfair_store_15_4.png", "boxes": [[571, 423, 21, 7], [628, 426, 29, 6], [617, 422, 30, 5], [795, 413, 85, 39], [840, 406, 33, 41], [938, 515, 78, 66], [488, 524, 66, 53], [292, 570, 116, 164]], "captions": ["The black end table in the back.", "What do you have with a similar price to the brown coffee table, but wool and by Modern Arts?", "Do you have any River Chateau coffee tables that are similarly priced  to the one on the second rug back, one with similar reviews?", " to buy that table, please.", " another one while you're at it. I can't have a table with just one chair.", "Sorry,  the one just at the end of the close wall on the right side.", "I will take the white chair on the left, by the wall.", "How much is the end table?"]}, {"img_path": "cloth_store_2_14_0.png", "boxes": [[1829, 173, 72, 158], [1241, 619, 74, 41]], "captions": ["I am talking about the grey coat on the right. The one in the right shelf.", " put those blue shoes in the second cubby from the left in my cart?"]}, {"img_path": "cloth_store_1_19_1.png", "boxes": [[1421, 1, 256, 396]], "captions": ["t the one on the top left of the display."]}, {"img_path": "cloth_store_1498649_woman_9_6.png", "boxes": [[1018, 166, 864, 748]], "captions": [" to see something with similar sleeves and in-stock sizes as this blue and white shirt on the rack, but made by HairDo."]}, {"img_path": "cloth_store_2_20_2.png", "boxes": [[1521, 82, 138, 219], [969, 393, 105, 249], [1109, 392, 51, 292]], "captions": ["The one on the top rack.", "Also, add the grey and white coat from the rack.", " the one on the middle rack next to the other brown one."]}, {"img_path": "cloth_store_1416238_woman_17_2.png", "boxes": [[574, 852, 134, 151]], "captions": ["Have you got anything with a similar pattern and sleeves as the black top at the front of the closer rack, but made by HairDo?"]}, {"img_path": "cloth_store_1498649_woman_9_4.png", "boxes": [[498, 253, 91, 72], [1190, 197, 196, 128]], "captions": ["The beige dress hanging on the rack to the left.", "The olive green dress on the rack to the right."]}, {"img_path": "cloth_store_1498649_woman_10_11.png", "boxes": [[1260, 426, 91, 242], [450, 262, 160, 653], [1000, 409, 199, 387]], "captions": ["Lemme think on it. In the mean time,  that red, white, and yellow blouse to the right of the central rack.", "The beige dress in the very front of the left rack.", "Have you got anything in a similar color as that Christmas sweater hanging on the standing rack?"]}, {"img_path": "cloth_store_1416238_woman_16_7.png", "boxes": [[1436, 692, 101, 208], [1445, 658, 169, 318]], "captions": ["The one on the rack here in front of me.", " put the black coat from the center rack in my cart for me?"]}, {"img_path": "cloth_store_3_3_5.png", "boxes": [[1530, 282, 151, 190], [879, 372, 97, 144], [1044, 353, 84, 142], [1310, 454, 99, 131]], "captions": ["The one hanging on the wall on the top row second from the right.", " add the yellow/brown sweater at the front left of the table to my cart please.", "The grey jacket on the right side of the table in the front.", "The green hoodie on the bottom rack on the left."]}, {"img_path": "cloth_store_1416238_woman_19_1.png", "boxes": [[247, 832, 161, 171]], "captions": ["What else do you have that is like the green hoodie on the rack?"]}, {"img_path": "cloth_store_paul_2_10.png", "boxes": [[837, 426, 79, 111]], "captions": [" the green hoodie in the back of the rack."]}, {"img_path": "cloth_store_3_5_8.png", "boxes": [[1518, 275, 166, 254]], "captions": ["The grey shirt vest on the table."]}, {"img_path": "wayfair_store_11_4.png", "boxes": [[474, 299, 64, 170], [1075, 352, 193, 107], [1056, 417, 81, 138], [217, 439, 469, 264], [1, 578, 1349, 210]], "captions": ["The shelves you showed me.", "Thank you! Also, what beds do you have that are like the grey one at the far right wall? Similar price, made of similar materials.", " add the wooden table to my cart.", "Okay, please add that table to my cart.", "Thanks, but I think I'll just get the rug under the left hand table instead."]}, {"img_path": "wayfair_store_19_9.png", "boxes": [[553, 327, 6, 28], [553, 320, 17, 7], [790, 302, 63, 51], [819, 308, 38, 41], [831, 318, 94, 40], [459, 320, 56, 143], [718, 369, 208, 89], [423, 436, 132, 111], [427, 458, 97, 51]], "captions": ["Yea, I like that white end table at the back left, can you put that in my cart for me please?", "Not particularly, but I have a good feeling about that little black table on the other side of the room.  do me a solid and put that in my cart for me?", "This grey table in the back on the left of the partition wall.", "How about something from the same brand, and in a similar color, to the black and white chair back by that table, but with a good customer rating.", " add the  wooden shelf to my cart.", "I'm interested in this white lamp in the front on the round table.  Do you have anything in the same price range but made of leather and from Global Voyager?", " the bench chair against the wall.", "I'm interested in this white bench chair in the front against the wall.  Do you have anything like that, but expensive.", "Oh, I like this white accent table on the left side of this tan rug.   add it to my cart?"]}, {"img_path": "cloth_store_3_18_5.png", "boxes": [[1352, 249, 30, 123]], "captions": ["Do you have anything like that black jacket hanging above the gray pants on the right wall in terms of brand and sleeve length?"]}, {"img_path": "cloth_store_1_5_2.png", "boxes": [[1239, 1, 214, 437]], "captions": [" the one in the third cabinet."]}, {"img_path": "cloth_store_2_6_2.png", "boxes": [[1703, 395, 156, 351]], "captions": ["t those blue, black jeans on the bottom shelf of the right wardrobe."]}, {"img_path": "cloth_store_paul_7_9.png", "boxes": [[1433, 288, 48, 179], [1925, 301, 98, 150], [1373, 585, 79, 54]], "captions": ["The black one in the cubby that we talked about a second ago.", "The brown hoodie in the cubby on the far right side.", " something with a similar rating as the black and orange hat on the table but with an affordable price."]}, {"img_path": "cloth_store_2_20_9.png", "boxes": [[369, 96, 210, 292]], "captions": ["The red one on the front end of the left shelf."]}, {"img_path": "cloth_store_paul_9_0.png", "boxes": [[1358, 613, 58, 23]], "captions": ["Okay, add the blue shoes to my cart. The ones on the final cubicle on the right."]}, {"img_path": "cloth_store_2_15_9.png", "boxes": [[173, 413, 343, 375]], "captions": ["The grey pants in the far left cubby."]}, {"img_path": "cloth_store_1_6_10.png", "boxes": [[1104, 170, 50, 194], [1078, 174, 54, 188], [1739, 402, 148, 53]], "captions": ["I am talking about the light grey jacket in the second left-most cubicle.", "What else is there that is in the same sizes as the brown coat on the wall but in an affordable price range?", "I like the look of that green hat on the tabletop actually, could you put that in my cart?"]}, {"img_path": "cloth_store_2_3_8.png", "boxes": [[524, 179, 176, 252]], "captions": ["The dark green and blue one hanging at the end of this table here."]}, {"img_path": "cloth_store_1_17_7.png", "boxes": [[111, 517, 458, 179]], "captions": ["Yeah,  the green hat that is closest to us on the table to our left."]}, {"img_path": "wayfair_store_9_2.png", "boxes": [[267, 388, 62, 13], [426, 352, 130, 89], [615, 360, 39, 54], [132, 383, 43, 82], [604, 383, 125, 61]], "captions": [" add that black end table to my cart?", "The grey one face us against the back wall, in the center of the set.", " the wooden end table right behind the grey coffee table.", "The white lamp on the far left against the back wall.", "I like that coffee table, please add it to my cart."]}, {"img_path": "cloth_store_paul_4_3.png", "boxes": [[1693, 476, 156, 219], [529, 649, 34, 76]], "captions": ["Okay,  to buy the blue one on the right side rack.", "Do you have anything from the same brand as the light grey coat on the circular rack at the front left?"]}, {"img_path": "cloth_store_1_3_2.png", "boxes": [[979, 415, 117, 55]], "captions": [" to get that white hat on the table, the one in the middle of the three white hats."]}, {"img_path": "cloth_store_2_11_6.png", "boxes": [[1926, 1, 192, 369]], "captions": ["The red and white one in the first cubby on the top right."]}, {"img_path": "cloth_store_paul_1_1.png", "boxes": [[1872, 448, 91, 29], [1169, 437, 106, 194], [976, 632, 153, 124]], "captions": [" add the black hat at the left of the center table to my cart?", "The black coat on the left side of the rack next to the table.", "Let's add the grey one on the front rack to my cart."]}, {"img_path": "cloth_store_paul_4_7.png", "boxes": [[1, 637, 65, 52], [151, 618, 142, 170]], "captions": ["The one on the left side of the rack.", "Yes,  the grey one on the floor rack on our immediate left. It is one of the jackets closer to us on the right side of that rack."]}, {"img_path": "cloth_store_3_2_1.png", "boxes": [[865, 299, 111, 232], [848, 551, 132, 237]], "captions": [" the blue hoodie on the top row of the wall.", "Thanks, I'll get the one on the wall, the one second from the right on the bottom."]}, {"img_path": "cloth_store_3_5_7.png", "boxes": [[1817, 269, 167, 172]], "captions": ["I'm not sure. But the green hoodie to the left of the light grey jacket on the right wall you told me about would work.  that."]}, {"img_path": "cloth_store_1498649_woman_20_5.png", "boxes": [[1128, 553, 105, 32], [965, 580, 153, 54]], "captions": ["It is on the table on the middle tier.", "The purple sweater on the shelf of the table."]}, {"img_path": "cloth_store_1416238_woman_6_11.png", "boxes": [[1626, 753, 253, 250]], "captions": [" put the black one from the center rack in my cart for me?"]}, {"img_path": "cloth_store_3_11_0.png", "boxes": [[1864, 389, 155, 312], [654, 500, 53, 188], [1467, 396, 222, 381], [105, 577, 187, 106], [13, 637, 339, 151]], "captions": ["Also, do you have any other shirts like the black and white one on the table to the far right?", "The blue hoodie to the left on the bottom rack of the back wall.", " give me the brand of that button down shirt on the table?", "Do you have anything similar to the grey jacket on the round rack in terms of sleeves and the pattern, but in a brown color?", "The one right up front on the left, hanging on the round rack."]}, {"img_path": "cloth_store_1_6_6.png", "boxes": [[41, 449, 43, 71]], "captions": [" the brown jacket on the left rack."]}, {"img_path": "cloth_store_1498649_woman_4_4.png", "boxes": [[710, 437, 101, 159], [1532, 312, 177, 482]], "captions": ["The one against the far wall, bottom row.", "The first dress on the rack, what size is that and what sizes are available?"]}, {"img_path": "cloth_store_2_20_0.png", "boxes": [[211, 139, 66, 261], [422, 261, 88, 159]], "captions": ["Second compartment back on the left.", "Let's put the red t-shirt on the left shelf to my cart as well."]}, {"img_path": "cloth_store_1416238_woman_11_7.png", "boxes": [[441, 297, 106, 342], [638, 284, 111, 378], [320, 653, 70, 310]], "captions": [" to see more blouses similarly sized as the red and white blouse in the top left cubby.", " the maroon, white, and blue blouse in the closet.", "The blue pair in the second cubby from the left."]}, {"img_path": "cloth_store_paul_2_11.png", "boxes": [[1229, 284, 74, 126], [1441, 283, 30, 129]], "captions": ["The grey one hanging to the right of the mirror.", "Eh. I think  something like that black jacket in the second case, third shelf. Still black and same brand, but with good reviews."]}, {"img_path": "cloth_store_paul_13_8.png", "boxes": [[609, 471, 67, 278]], "captions": ["I am talking about the black coat on the left-most rack."]}, {"img_path": "cloth_store_1416238_woman_14_3.png", "boxes": [[1542, 417, 51, 168], [1207, 637, 193, 259], [1431, 702, 78, 300]], "captions": ["The purple one up on the right wall.", "Let's put that red and white jacket from the front rack in my cart.", "The green and white blouse on the front center rack."]}, {"img_path": "cloth_store_paul_4_2.png", "boxes": [[1055, 414, 82, 156], [8, 550, 166, 238]], "captions": ["Is there anything similar in size to the black jacket on the right middle rack except with a good rating?", "I dig the look of that white and grey jacket on the far left rack, do you have anything like that but a little more expensive?  If it has good customer reviews that's a huge plus too."]}, {"img_path": "cloth_store_1416238_woman_8_1.png", "boxes": [[867, 503, 17, 146]], "captions": ["The grey pair in the cubby in the back left."]}, {"img_path": "cloth_store_paul_6_4.png", "boxes": [[1330, 495, 158, 219], [1474, 497, 153, 291]], "captions": ["How about something that's a similar color and has a similar sleeve length to the blue jacket on the left of that rack but plain and with good reviews?", "I will take the blue jacket from the rack close to us, please."]}, {"img_path": "wayfair_store_16_10.png", "boxes": [[684, 342, 22, 35], [768, 353, 12, 24], [866, 365, 98, 52], [966, 345, 32, 41], [982, 359, 97, 47], [394, 399, 6, 21], [864, 390, 167, 206], [965, 410, 139, 150]], "captions": ["The white lamp straight ahead against the wall.", "Can I actually get another one of those white end tables?", "Do you have anything the same color and brand as the leftmost of the two grey coffee tables you pointed out earlier?", "Do you have anything by StyleNow Feed that's similar to the black end table by the teal couch?", "Go ahead and add the grey coffee table in the back and to the right  to my cart.", "It's OK. I will buy the brown coffee table from the display on our left.", "The brown chair behind the shelves.", "I need something similar to that wooden table but in grey."]}, {"img_path": "cloth_store_1_20_6.png", "boxes": [[565, 91, 143, 362], [1378, 424, 68, 44]], "captions": [" add the black coat in the second section of the first unit on the left to my cart.", "Let's add that green hat on the back of the table to my cart."]}, {"img_path": "cloth_store_3_11_8.png", "boxes": [[880, 362, 34, 84]], "captions": [" the white T-shirt in the upper left on the wall on the right."]}, {"img_path": "cloth_store_3_6_2.png", "boxes": [[826, 278, 68, 109], [1359, 243, 115, 166]], "captions": ["I think the grey one on the back table is my favorite of everything you've shown me, put that one in my cart.", "The grey and black shirt hanging on the top center of the wall."]}, {"img_path": "cloth_store_1_19_8.png", "boxes": [[1361, 443, 169, 128]], "captions": [" the dirty green hat on that table display."]}, {"img_path": "cloth_store_1_13_11.png", "boxes": [[1303, 406, 125, 358]], "captions": ["The light blue jeans just to the right of the mirror."]}, {"img_path": "cloth_store_1498649_woman_4_2.png", "boxes": [[168, 438, 103, 477]], "captions": ["Wow, the pants are a dud also. I'm feeling this purple dress on the left of this first rack, though. If you could add it to my cart that would be super."]}, {"img_path": "cloth_store_3_9_4.png", "boxes": [[937, 512, 90, 188]], "captions": ["The one with white and black stripes, under the orange one in sort of the middle of the wall."]}, {"img_path": "cloth_store_paul_1_10.png", "boxes": [[991, 335, 47, 91], [172, 485, 158, 207], [887, 582, 45, 23]], "captions": ["Hmm,  a jacket like the black one in the shelf on the right, but more classy and luxurious and with a text pattern.", "The black coat on the rack to the left of the table.", "I will buy those blue shoes on the right in the loser shelf  further away  from us."]}, {"img_path": "cloth_store_1498649_woman_3_1.png", "boxes": [[1463, 496, 200, 419]], "captions": ["The brown one hanging on the bottom rack on the right."]}, {"img_path": "cloth_store_3_20_11.png", "boxes": [[777, 250, 57, 100], [1026, 369, 152, 286]], "captions": ["The one on the upper hanger rack back there, second from the right.", "Can I get the price of the gray coat on the rack?"]}, {"img_path": "wayfair_store_3_2.png", "boxes": [[864, 401, 37, 35], [1163, 411, 55, 53], [900, 438, 42, 40], [1094, 443, 132, 32], [559, 446, 103, 109]], "captions": ["Have anything with the same brand and materials as the grey couch by the wall, but in white with a good rating?", "Sorry, could you tell me the brand of that wooden table?", "The coffee table on the red rug between the sofas.", "The white area rug in the back. The one that has the table on top of it.", "The brown one on the wall next to the red rug."]}, {"img_path": "cloth_store_3_9_11.png", "boxes": [[1241, 403, 83, 178]], "captions": ["The green hoodie on the front of the table."]}, {"img_path": "cloth_store_2_5_10.png", "boxes": [[1082, 252, 171, 183], [1958, 509, 146, 173], [703, 683, 112, 58]], "captions": [" the light blue green jacket on the table second from the right.", "I'm going to buy that black coat on the rack", "Can I get the grey shoes at the left side of the short shelving unit please?"]}, {"img_path": "cloth_store_paul_19_0.png", "boxes": [[142, 604, 348, 184]], "captions": ["Is there something like the black coat in the rack, but by Home Store?"]}, {"img_path": "cloth_store_1498649_woman_4_9.png", "boxes": [[726, 201, 99, 229], [30, 351, 202, 93]], "captions": ["The bright blue jacket on the top row of the wall.", "Okay, what is the brand of the dress on the rack?"]}, {"img_path": "cloth_store_paul_20_7.png", "boxes": [[394, 467, 75, 43], [636, 682, 68, 76]], "captions": ["That black one with the white accent on the right end of that shelf over there.", " find me something similar to the black coat on the rack in front in price and brand?"]}, {"img_path": "wayfair_store_1_11.png", "boxes": [[1251, 397, 40, 46], [1307, 386, 34, 37], [1, 580, 174, 208]], "captions": ["The black end table in back.", "Speaking of red,  to find a red end table that costs around the same as that wooden one to the right of that green couch.", "Will you also add the wooden end table on the left?"]}, {"img_path": "cloth_store_3_20_10.png", "boxes": [[1, 1, 418, 787], [764, 382, 63, 106]], "captions": ["I am referring to the black coat hanging on the top row of the left wall.", "t that black coat on the bottom rack of the back wall."]}, {"img_path": "cloth_store_1416238_woman_3_0.png", "boxes": [[1164, 428, 70, 160], [71, 700, 182, 303]], "captions": ["I like the blue t-shirt hanging on the wall,  it!", "t the ones at the bottom left shelf."]}, {"img_path": "cloth_store_3_15_8.png", "boxes": [[1200, 428, 64, 85]], "captions": ["The brown hoodie in the back wall. The one on the bottom row in the right."]}, {"img_path": "cloth_store_paul_14_7.png", "boxes": [[506, 508, 145, 248]], "captions": [" that grey coat on the front rack."]}, {"img_path": "cloth_store_1498649_woman_1_6.png", "boxes": [[840, 493, 104, 320]], "captions": ["Oh my gosh and that black blouse at the end of that bottom row against the wall is so cute too.  run a search and see if you've got something like it in leather."]}, {"img_path": "cloth_store_1416238_woman_6_3.png", "boxes": [[892, 390, 111, 212], [1221, 374, 72, 233], [1318, 420, 50, 139]], "captions": [" show me something with a similar pattern and rating as the pink sweater in the top center cubby but with full length sleeves?", "Sure! I am looking at the black dress in the cupboard on the right.", "Let's put the grey and white blouse in the far right cubby in my cart."]}, {"img_path": "cloth_store_1416238_woman_5_5.png", "boxes": [[348, 487, 51, 180]], "captions": ["The brown and black one on the bottom shelf on the wall."]}, {"img_path": "cloth_store_1_15_11.png", "boxes": [[948, 548, 194, 240]], "captions": ["Now how about something similar to that light grey coat on the near rack, as in, like, same price range?"]}, {"img_path": "cloth_store_paul_20_10.png", "boxes": [[1365, 339, 82, 114], [1867, 330, 36, 142], [767, 483, 79, 167]], "captions": ["How much is that blue hoodie in the middle section? And what size is it?", "The blue one in the far right cubby.", "Do you have anything priced similarly as the one on the rack?"]}, {"img_path": "cloth_store_1_12_4.png", "boxes": [[1189, 477, 95, 311]], "captions": [" add that light grey jacket on the front rack to my cart?"]}, {"img_path": "cloth_store_1498649_woman_13_8.png", "boxes": [[1589, 97, 286, 422], [1199, 525, 109, 227]], "captions": ["Do you have anything in a similar pattern as the black and white blouse on the top right of the wall but in extra small and sleeveless.", "Let's put the grey and white blouse on the bottom center of the wall in my cart."]}, {"img_path": "cloth_store_1_13_4.png", "boxes": [[1304, 412, 42, 213]], "captions": ["The ones on the right, three cubbies back.  t last as in the last ones you mentioned."]}, {"img_path": "cloth_store_paul_5_8.png", "boxes": [[586, 288, 46, 121], [671, 520, 107, 258]], "captions": ["Do you have anything with a similar price and size as the green one in the center cubby but made by Modern Arts?", "Let's put the blue jacket on the center rack in my cart."]}, {"img_path": "cloth_store_1416238_woman_19_4.png", "boxes": [[1278, 68, 185, 290], [250, 601, 154, 323]], "captions": ["Let's put the blue jacket on the wall in my cart.", "The pair in the middle cabinet."]}, {"img_path": "cloth_store_2_14_9.png", "boxes": [[287, 114, 133, 332], [401, 68, 113, 395], [179, 368, 78, 223]], "captions": ["The grey jacket at the end of the table display?", "The black and white shirt in the middle of the mannequin.", " the black coat that's on the circular rack."]}, {"img_path": "cloth_store_1416238_woman_5_3.png", "boxes": [[34, 149, 120, 698]], "captions": [" to see other ones with a similar size as the black one in the cubby."]}, {"img_path": "cloth_store_1_8_10.png", "boxes": [[1675, 1, 222, 309], [700, 334, 29, 139]], "captions": [" the grey and white jacket hanging on the right wall.", " the brown pants in the left middle cubby of the back left dresser."]}, {"img_path": "wayfair_store_9_5.png", "boxes": [[1025, 330, 24, 31], [1027, 322, 14, 7], [862, 473, 102, 146]], "captions": ["Boo. How about another end table with ratings similar to the black one we were looking at?", " get me the price and rating of that end table?", "Sorry, got distracted. The end table in front of that chair."]}, {"img_path": "cloth_store_1416238_woman_4_5.png", "boxes": [[1110, 855, 58, 118], [1365, 886, 255, 111]], "captions": [" the second purple dress on the left rack to my cart.", " the brown dress to my cart. The one on the rack."]}, {"img_path": "cloth_store_paul_15_6.png", "boxes": [[1794, 271, 68, 130]], "captions": ["The one hanging in the shelves on the far right."]}, {"img_path": "cloth_store_paul_8_2.png", "boxes": [[319, 252, 60, 147], [755, 422, 40, 133], [667, 591, 84, 197]], "captions": [" add the black jacket in the second section of the first unit to my cart.", " add the grey coat on the circular display to my cart?", "Can I get one of these green hoodies right up front on the rack?"]}, {"img_path": "cloth_store_1498649_woman_13_10.png", "boxes": [[521, 290, 94, 207], [738, 341, 72, 119]], "captions": ["I'll buy the dark blue sweater displayed on the table to the left.", "Sorry it's the white one over there on the table to the left."]}, {"img_path": "cloth_store_2_16_4.png", "boxes": [[570, 86, 125, 323], [525, 336, 62, 53], [483, 337, 30, 184]], "captions": ["The brown and white on the far end of the display table.", "Do you have anything in the price range of that  blue jacket at the front right of the garment rack, but in light gray with full sleeves?", "Is there something similar to the light grey jacket in the rack but expensive and with full sleeves."]}, {"img_path": "cloth_store_1416238_woman_20_10.png", "boxes": [[844, 814, 129, 67], [333, 886, 154, 103]], "captions": [" something similar to that blue, white tshirt on the table but from Modern Arts.", "Let's put the red and black sweater from the table in my cart."]}, {"img_path": "cloth_store_2_7_7.png", "boxes": [[1554, 427, 187, 361]], "captions": [" the grey one on the right side of the rack."]}, {"img_path": "cloth_store_paul_11_4.png", "boxes": [[1434, 281, 69, 103], [1988, 274, 48, 127]], "captions": ["Woah, that black coat at the right-most edge of the set of shelves in the middle of that wall is so chique! Would you possibly have something in a solid blue by the same brand and with the same sizes in stock?", "Do you have something else similar to the green one up on the wall?"]}, {"img_path": "cloth_store_1498649_woman_2_9.png", "boxes": [[977, 79, 118, 274], [380, 371, 62, 234], [76, 333, 356, 382]], "captions": ["t the brown one on the top right rack of the right wall.", "Okay,  the brown jacket on the center rack then.", " add that green hoodie on the floor rack to my cart?"]}, {"img_path": "cloth_store_1498649_woman_12_9.png", "boxes": [[1526, 243, 262, 164]], "captions": ["Okay, just go ahead and add the grey dress on the rack to my cart."]}, {"img_path": "cloth_store_3_16_1.png", "boxes": [[2037, 330, 60, 178]], "captions": ["The one on the wall, at the top right, ."]}, {"img_path": "cloth_store_paul_13_1.png", "boxes": [[2041, 381, 56, 99], [1218, 462, 112, 173]], "captions": ["For those green track pants.", "I am talking about the brown hoodie on circular rack."]}, {"img_path": "cloth_store_3_4_8.png", "boxes": [[1173, 329, 53, 88], [1232, 322, 58, 102]], "captions": ["Maybe I do need to pick the shirt first.  Do you have anything in the same price range as that black shirt on the far wall but in size XXL?", " the one on the top rack in the back center wall to my cart."]}, {"img_path": "cloth_store_2_9_11.png", "boxes": [[1167, 1, 165, 488]], "captions": [" the black coat in the closet to my cart."]}, {"img_path": "cloth_store_1416238_woman_2_9.png", "boxes": [[625, 308, 164, 272]], "captions": ["Do you have something else similar to the one in the left cubby?"]}, {"img_path": "cloth_store_2_6_11.png", "boxes": [[623, 461, 117, 326], [646, 430, 164, 358]], "captions": [" something similar to the brown one on the rack but in size XL.", "Thanks.  You know, for now, I'll go with the closer gray one on the rack.   put it in my cart."]}, {"img_path": "cloth_store_2_10_9.png", "boxes": [[1027, 170, 137, 221], [1189, 172, 38, 212]], "captions": [" that black coat to the right of the mirror.", "Can I get something with similar sleeves and brand as the light grey coat on the top left rack?"]}, {"img_path": "cloth_store_3_20_3.png", "boxes": [[1720, 655, 67, 78]], "captions": ["The gray one hanging second from the right on the bottom rack."]}, {"img_path": "cloth_store_2_15_3.png", "boxes": [[822, 122, 193, 400]], "captions": ["The green hoodie on the top shelf."]}, {"img_path": "cloth_store_paul_10_2.png", "boxes": [[513, 171, 69, 146], [1222, 223, 23, 189], [1861, 561, 68, 56], [1868, 601, 79, 59]], "captions": ["There's a brown one on the left side of the third cabinet from the left that I like better. I'll buy that one.", "Thanks! I'll get that black one on the wall.", "I like the size and color of the black one on the rack. Do you have any more like that?", " the grey coat on the rack to my cart."]}, {"img_path": "cloth_store_2_12_2.png", "boxes": [[1127, 360, 95, 261], [1696, 407, 88, 290]], "captions": ["The light gray coat on the rack in the middle of the room, third from right, I think.", "Sure, I am looking at the grey pants in the cupboard on the right, in the third compartment from the entrance."]}, {"img_path": "cloth_store_1498649_woman_9_7.png", "boxes": [[313, 488, 143, 342]], "captions": ["The black coat on the bottom rack?"]}, {"img_path": "cloth_store_paul_11_5.png", "boxes": [[1957, 280, 80, 255]], "captions": [" that blue tshirt shirt hanging in the closet to my cart."]}, {"img_path": "cloth_store_paul_11_7.png", "boxes": [[420, 534, 58, 108], [1071, 612, 51, 176]], "captions": ["The brown hoodie on the left rack.", "I think I like the blue hoodie nearest to me on the rack.  Why don't you add that to my cart?"]}, {"img_path": "cloth_store_3_4_9.png", "boxes": [[1774, 492, 97, 202]], "captions": ["Got any hoodies with similar color and sleeves as the blue one hanging on the bottom right rack, but a cheaper price?"]}, {"img_path": "cloth_store_3_13_11.png", "boxes": [[407, 312, 109, 146], [1215, 575, 108, 55]], "captions": ["The sweater on the table in the corner.", "Sure, I am talking about the white hat that sits first on the lower table in front and a little to the right of us."]}, {"img_path": "cloth_store_2_8_2.png", "boxes": [[540, 34, 116, 201]], "captions": [" the green t shirt at the top left of the wall display."]}, {"img_path": "cloth_store_1416238_woman_15_7.png", "boxes": [[584, 651, 80, 352], [352, 725, 228, 278], [1, 871, 122, 65]], "captions": [" to see other options similar to the maroon one on the right side of the rack.", "The beige dress on the front of the center rack.", "Yeas,  the grey shirt in the front row  on the table."]}, {"img_path": "cloth_store_1416238_woman_10_5.png", "boxes": [[996, 356, 104, 334], [1204, 645, 38, 237]], "captions": [" add the light grey jacket on the center-left top shelf on the front wardrobe on my cart?", " those blue pants in the back cubby."]}, {"img_path": "cloth_store_2_9_1.png", "boxes": [[1024, 707, 27, 39]], "captions": ["The black shoes in the first cubby on the right."]}, {"img_path": "cloth_store_1_15_6.png", "boxes": [[314, 440, 54, 86], [1294, 447, 127, 334], [146, 586, 436, 202]], "captions": ["The light grey coat on the rack.", "The light blue jeans displayed on the wall to the left side.", "The black hat next to the white one on the table."]}, {"img_path": "cloth_store_1416238_woman_17_11.png", "boxes": [[545, 355, 46, 292]], "captions": ["The one in the right middle cubby of the back dresser."]}, {"img_path": "cloth_store_paul_14_1.png", "boxes": [[1120, 446, 51, 279]], "captions": ["The grey coat on the rack."]}, {"img_path": "cloth_store_1_7_0.png", "boxes": [[644, 25, 85, 308], [831, 377, 130, 354], [1071, 407, 155, 381]], "captions": ["Let's add the black jacket from the left cubby to my cart.", " add the trousers in the second-from-left cubby to my cart.", "The dark green joggers in the second-from-right cubby."]}, {"img_path": "cloth_store_3_19_1.png", "boxes": [[1626, 223, 99, 231]], "captions": ["The black coat on the right wall."]}, {"img_path": "cloth_store_1416238_woman_9_10.png", "boxes": [[1, 128, 108, 256], [1045, 335, 59, 236], [1025, 595, 105, 280]], "captions": ["The black and white sleeveless on the top left of the wall.", "The grey and white jacket in the second cubby from the left.", "The dark blue jeans in the middle of the bottom shelf display."]}, {"img_path": "cloth_store_paul_13_9.png", "boxes": [[1201, 454, 41, 76], [1134, 517, 39, 173]], "captions": ["The brown pants on the right of the mirror?", "Oh,  the grey shirt on teh closer rack in front of us, the one pointing at us."]}, {"img_path": "wayfair_store_8_4.png", "boxes": [[143, 386, 34, 9], [174, 376, 8, 18], [464, 367, 69, 38], [503, 358, 39, 44], [529, 367, 94, 43], [510, 394, 114, 35]], "captions": ["Ok, I think I might just buy that white end table in the back left.", " the wooden end table in the back left.", "Also add the wood table in the back to my cart, please.", "It's not a big deal. There's a black chair in the same display set as those shelves.  it, too.", "What is the material exactly on those wooden shelves?", " the white one under that wood table you showed me."]}, {"img_path": "cloth_store_1416238_woman_12_1.png", "boxes": [[90, 622, 120, 26], [257, 601, 90, 28], [102, 829, 278, 174]], "captions": ["Yeah,  the pink sweater next to the red one in the back row on the table.", "Will you add the light grey shirt on the back table to my cart?", "The black and white blouse in the very front of the floor rack."]}, {"img_path": "cloth_store_1498649_woman_9_0.png", "boxes": [[732, 365, 74, 448]], "captions": ["I am referring to the blue jacket on the rack."]}, {"img_path": "cloth_store_3_8_5.png", "boxes": [[12, 282, 264, 267]], "captions": ["t the grey coat on the front of the left wall."]}, {"img_path": "cloth_store_1_16_10.png", "boxes": [[401, 452, 134, 336]], "captions": ["Actually,  the blue jacket in the rack added to my cart."]}, {"img_path": "cloth_store_1_10_2.png", "boxes": [[1511, 486, 107, 62], [1442, 445, 113, 343], [1551, 492, 252, 296]], "captions": ["I am speaking of the brown hoodie on the rack.", "I am referring to the grey coat on the rack.", "The white shirt on the rack."]}, {"img_path": "cloth_store_1_14_4.png", "boxes": [[1131, 349, 95, 36]], "captions": ["Oh yeah my bad,  that black one second to the end of the shelf on the right."]}, {"img_path": "cloth_store_2_7_6.png", "boxes": [[1338, 361, 81, 183]], "captions": [" the pair in the cubbyhole on the far left."]}, {"img_path": "cloth_store_1416238_woman_13_6.png", "boxes": [[1423, 296, 167, 256]], "captions": ["Get the customer review score for the grey and white blouse on the right closet."]}, {"img_path": "cloth_store_3_18_0.png", "boxes": [[1603, 158, 229, 256]], "captions": ["The brown hoodie hanging on the right wall."]}, {"img_path": "cloth_store_1416238_woman_14_10.png", "boxes": [[464, 725, 124, 47], [265, 852, 188, 67]], "captions": [" the red one on the upper level of the table.", " to know about the grey and black sweater on the top shelf of the table on the left."]}, {"img_path": "cloth_store_1_1_1.png", "boxes": [[1684, 548, 291, 240]], "captions": ["Let's put that brown hoodie from the front right rack in my cart."]}, {"img_path": "cloth_store_1_12_5.png", "boxes": [[327, 77, 91, 220], [674, 366, 90, 54], [734, 358, 106, 47], [296, 367, 132, 157]], "captions": ["The hoodie on the left wall to the right of the dark red t shirt.", "Let's add that green hat on the front part of the table to my cart also.", "What is the price of the white hat in the middle of the table?", " add the grey pair in the middle left cubby to my cart?"]}, {"img_path": "cloth_store_3_13_2.png", "boxes": [[1581, 380, 93, 127]], "captions": [" to buy that dark blue jacket at the back right of the table."]}, {"img_path": "cloth_store_1416238_woman_2_7.png", "boxes": [[1481, 214, 74, 200]], "captions": ["Okay,  that black coat hanging on the right wall in the back then."]}, {"img_path": "cloth_store_paul_11_11.png", "boxes": [[1730, 730, 61, 58]], "captions": ["The brown one on the left side of the garment rack, ."]}, {"img_path": "cloth_store_2_12_11.png", "boxes": [[1717, 406, 82, 272]], "captions": ["The black coat on the rack to the right of the table."]}, {"img_path": "cloth_store_1498649_woman_3_0.png", "boxes": [[891, 316, 78, 171], [493, 303, 72, 438], [798, 310, 102, 512]], "captions": ["Ugh I really just need a dress. I'll go ahead and buy that black one on the rack. Put it in my cart for me?", "The grey tee on the floor rack.", "There are two blouses on the rack in the center and I'm referring to the one on the right."]}, {"img_path": "cloth_store_paul_7_1.png", "boxes": [[839, 334, 35, 124], [992, 559, 40, 229]], "captions": ["Let's put that light grey coat in the top back left cubby in my cart.", "The hoodie on the clothing rack."]}, {"img_path": "cloth_store_2_10_8.png", "boxes": [[1475, 1, 296, 470]], "captions": ["The grey jacket in the middle of the table."]}, {"img_path": "cloth_store_1498649_woman_8_2.png", "boxes": [[1025, 367, 87, 54], [1618, 462, 63, 245]], "captions": ["The red dress hanging on the rack to the right side in the back.", "The ones displayed on the wall."]}, {"img_path": "cloth_store_paul_2_3.png", "boxes": [[1755, 566, 84, 53]], "captions": ["Will you add the light grey jacket from the rack to my cart?"]}, {"img_path": "cloth_store_2_7_4.png", "boxes": [[433, 102, 405, 398]], "captions": ["Do you have something similar to the blue and green jacket on the mannequin in the middle in size and pattern but made by The Vegan Baker?"]}, {"img_path": "cloth_store_2_2_9.png", "boxes": [[1331, 393, 93, 83]], "captions": ["OK. I will buy the grey pants in the  second compartment from the right in the right-hand side cupboard."]}, {"img_path": "cloth_store_2_6_7.png", "boxes": [[1509, 3, 322, 334]], "captions": ["The red and white jacket in the top left cubby."]}, {"img_path": "wayfair_store_11_3.png", "boxes": [[702, 409, 32, 38], [749, 428, 56, 13], [496, 433, 38, 67], [661, 444, 78, 19], [631, 556, 840, 230]], "captions": ["Oh, you know what, that black end table in the back would look great in the foyer.  that to my cart!", "Not so much, but  a second coffee table, you never know.", "Do you have anything with similar construction to the round white end table between the grey sofas?", "The brown coffee table just in front of the grey couch.", "Okay.  give me the grey rug under the shelves?"]}, {"img_path": "wayfair_store_3_5.png", "boxes": [[916, 307, 154, 109], [258, 431, 166, 233], [1, 420, 371, 262], [309, 425, 429, 338], [1, 485, 690, 303]], "captions": ["I'm talking about the grey bed along the back wall, but the one the to the left on the grey area rug.", "The white chair at the table.", "The wood table?  The one on the white rug?   to know what brand it is.", "I'm looking for something similar in cost to the wooden shelves in the front of the room, but with a good rating.", "Do you have anything like the closer one but by Modern Arts?  Maybe something in grey?  I'm thinking about matching it to her walls."]}, {"img_path": "cloth_store_1416238_woman_9_4.png", "boxes": [[760, 775, 125, 228]], "captions": ["No prob it's the grey and white short-sleeved blouse on this first rack. It's on the right, behind the green skirt."]}, {"img_path": "cloth_store_1416238_woman_4_8.png", "boxes": [[472, 983, 169, 20]], "captions": ["The pink sweater on the table to the left."]}, {"img_path": "cloth_store_1498649_woman_3_9.png", "boxes": [[881, 61, 253, 401], [434, 513, 152, 248]], "captions": [" that dark green tshirt on the right rack on the top to the left.", "Let's put the black jacket from the bottom rack into my cart."]}, {"img_path": "cloth_store_1416238_woman_9_2.png", "boxes": [[632, 805, 126, 62]], "captions": ["The brown sweater on the table. I mentioned it earlier."]}, {"img_path": "cloth_store_1416238_woman_9_3.png", "boxes": [[752, 251, 112, 629]], "captions": ["The light grey blouse in the second cubicle."]}, {"img_path": "cloth_store_1416238_woman_9_0.png", "boxes": [[786, 249, 75, 213], [719, 492, 55, 240]], "captions": ["Yeah it's that black tank top on the top right end of the rack hanging in the back against the wall.", "Yeah, I am looking at the purple dress in the middle of the bottom row on the wall rack."]}, {"img_path": "cloth_store_1416238_woman_9_5.png", "boxes": [[947, 555, 62, 211]], "captions": [" the gray ones in the second cabinet."]}, {"img_path": "cloth_store_1416238_woman_9_10.png", "boxes": [[1278, 252, 74, 333]], "captions": [" the third one in the third cubicle please."]}, {"img_path": "cloth_store_1416238_woman_9_7.png", "boxes": [[840, 762, 193, 241]], "captions": [" these grey ones on the bottom shelf."]}, {"img_path": "cloth_store_1416238_woman_9_8.png", "boxes": [[325, 443, 68, 195], [406, 437, 75, 222], [872, 612, 134, 273], [95, 643, 92, 360]], "captions": [" the purple dress from the wall as well.", " the brown one to my cart. The one on the lower right against the wall.", "The trousers in  the bottom left cubicle?", "The one on the floor rack."]}, {"img_path": "cloth_store_1416238_woman_9_4.png", "boxes": [[356, 376, 59, 167], [606, 589, 100, 137]], "captions": [" the one in the back left closet to my cart.", "It's on that second rack in the back, right behind a bright blue jacket on the left-hand side. I think it's got some kind of floral pattern in white and grey colors."]}, {"img_path": "cloth_store_1498649_woman_4_3.png", "boxes": [[1202, 386, 89, 482]], "captions": [" add the black dress on the right side of the front rack to my cart?"]}, {"img_path": "cloth_store_1498649_woman_4_1.png", "boxes": [[938, 11, 85, 452], [1054, 125, 83, 334]], "captions": ["The black dress in front on the left wall.", "The grey coat from the wall."]}, {"img_path": "cloth_store_1498649_woman_4_9.png", "boxes": [[610, 237, 39, 208]], "captions": [" that black dress on the wall."]}, {"img_path": "cloth_store_1498649_woman_4_8.png", "boxes": [[1068, 41, 177, 450], [1, 211, 368, 673]], "captions": [" the one hanging on the wall.  I forgot what you said.", " the black dress on the rack. In the very front."]}, {"img_path": "cloth_store_1498649_woman_4_2.png", "boxes": [[1310, 415, 188, 346], [1701, 630, 115, 27]], "captions": ["The grey and white jacket on the rack to the right.", "Oh of course, I'm talking about the pink and white one folded up on the bottom shelf of that stand on the right."]}, {"img_path": "cloth_store_1416238_woman_8_6.png", "boxes": [[392, 357, 97, 351], [421, 320, 125, 370], [1, 367, 66, 452]], "captions": ["Oh, I'd also like to get that black jacket in the middle cabinet.", "The black jacket on the back side of the cubby.", "The white red and violet blouse on the leftmost shelf of the wall display."]}, {"img_path": "cloth_store_1416238_woman_8_1.png", "boxes": [[482, 260, 103, 281], [1212, 598, 120, 239]], "captions": [" the grey jacket in the cubby.", "The brown one hanging on the back center rack."]}, {"img_path": "cloth_store_1416238_woman_8_5.png", "boxes": [[775, 337, 66, 233], [1619, 797, 265, 189]], "captions": ["The dark grey one in the back of that cubby.", " the brown hoodie on the rack to the right."]}, {"img_path": "cloth_store_1416238_woman_8_11.png", "boxes": [[1574, 806, 193, 115], [1338, 882, 83, 97], [1656, 888, 106, 104]], "captions": ["That red, white and yellow shirt that is on the rack just below me.", "Ok, can I get the brown jacket at the front left of the round rack.", "Thanks! Do you have anything similar to the brown jacket on the right side of the round rack at the back of the room?"]}, {"img_path": "cloth_store_1416238_woman_8_7.png", "boxes": [[639, 526, 23, 143], [662, 545, 84, 144]], "captions": ["Do you have anything else like the black dress on that back rack, but with good reviews?", " the red white and yellow blouse on the back circular display."]}, {"img_path": "cloth_store_1416238_woman_8_9.png", "boxes": [[950, 253, 39, 124], [760, 308, 49, 185]], "captions": [" the blue jacket on the top left wall.", "Do you have anything like the black blouse on the center-front top shelf of the right wardrobe, but in a knit pattern?"]}, {"img_path": "cloth_store_1416238_woman_8_8.png", "boxes": [[1515, 560, 43, 182], [1243, 581, 64, 331], [1215, 636, 39, 235]], "captions": ["Thanks! I also like the light blue jeans on the right, in the third cupboard from the entrance.", "The dress on that second rack in the middle of the floor.", "Yeah, I am looking at the black jacket that hangs pointing at us on the floor rack closer to the entrance."]}, {"img_path": "cloth_store_1416238_woman_8_10.png", "boxes": [[792, 795, 46, 74]], "captions": ["I see. So, I like that black jacket on the rack in the middle, but I was hoping for something similar but with light spots and in a light blue."]}, {"img_path": "cloth_store_1416238_woman_7_9.png", "boxes": [[832, 280, 56, 295], [1198, 274, 62, 262]], "captions": ["The black blouse in the middle of the wall display.", " find me something similar to the grey coat in the last section in pattern?"]}, {"img_path": "cloth_store_1416238_woman_7_7.png", "boxes": [[1076, 340, 59, 248]], "captions": [" to buy the black one from the first cubby you mentioned."]}, {"img_path": "cloth_store_1416238_woman_7_3.png", "boxes": [[844, 267, 61, 161], [728, 295, 56, 131], [787, 281, 52, 146]], "captions": ["Let me think about it.  I know my daughter would like the pattern on that top right blouse up hanging up against the wall, though, add that to my cart.", " the one on the wall to my cart.", "No, I think that have a bit too much going on with the colors. I think I have my eyes on that classic-looking black and white one on the wall you suggested earlier though.  add it to my cart!"]}, {"img_path": "cloth_store_1416238_woman_7_4.png", "boxes": [[139, 398, 117, 208], [562, 292, 121, 472]], "captions": [" just add the black and white blouse from the third cubby to my cart?", " the grey coat in the last cubicle."]}, {"img_path": "cloth_store_1498649_woman_7_9.png", "boxes": [[934, 347, 50, 81], [724, 438, 39, 162], [617, 458, 74, 267]], "captions": ["The one at the far right of the top row on the back wall.", "I am referring to the white, red, and violet blouse on the left wall. To the very back.", "I am referring to the black and white blouse from earlier. In the middle of the bottom row on the left wall."]}, {"img_path": "cloth_store_1498649_woman_7_5.png", "boxes": [[968, 484, 112, 22], [718, 461, 48, 177], [1189, 727, 157, 68]], "captions": ["Ah, sorry. t the white and grey one on the right on the top level of the table.", " the maroon, white, and blue blouse along the wall. To the very back on the bottom row.", "I am talking about the blue and black shirt  on the bottom row of the table."]}, {"img_path": "cloth_store_1498649_woman_7_2.png", "boxes": [[1412, 438, 84, 200]], "captions": [" the black dress then from the far end of the wall at the bottom."]}, {"img_path": "cloth_store_1498649_woman_7_0.png", "boxes": [[1818, 204, 66, 189]], "captions": ["The black coat hanging on that wall to the side on the right."]}, {"img_path": "cloth_store_1498649_woman_7_10.png", "boxes": [[1306, 609, 112, 41]], "captions": ["Can I get the red sweater at the front end of the table's bottom tier?"]}, {"img_path": "cloth_store_1498649_woman_7_4.png", "boxes": [[181, 241, 169, 497]], "captions": ["The red dress hanging on the rack to the left."]}, {"img_path": "cloth_store_paul_8_4.png", "boxes": [[526, 340, 78, 109], [1212, 336, 23, 117], [1004, 503, 78, 190]], "captions": ["I am talking about the grey and white jacket on the back wall. It is hanging by itself on the left closet.", "The light grey one in the second cubby from the far right.", "That's OK.  find me anything in a grey color, like the jacket the right side on the floor rack in front of us, between the rack with hats and the seat?"]}, {"img_path": "cloth_store_paul_12_5.png", "boxes": [[1619, 563, 61, 57], [1604, 569, 147, 94], [1607, 611, 146, 177]], "captions": ["The grey coat on the circular display.", "Oh i like this blue hoodie on the rack at the front right, can you put it in my cart please?", "That's cool, I think I like the light grey jacket on the nearest rack.   put it in my cart?"]}, {"img_path": "cloth_store_1498649_woman_16_1.png", "boxes": [[508, 372, 120, 216]], "captions": ["I'm talking about the grey coat on the right-hand side of that second rack in the middle of the floor. It's right behind a funky multi-colored sweater with a crazy pattern."]}, {"img_path": "cloth_store_3_3_1.png", "boxes": [[1006, 396, 95, 208]], "captions": ["What brand and size is the black tshirt on the table?"]}, {"img_path": "cloth_store_paul_16_6.png", "boxes": [[1036, 306, 57, 96], [1084, 458, 55, 85], [1, 657, 128, 94]], "captions": ["Let's put the black jacket hanging on the left side of the mirror in my cart as well.", "Let's put the blue one on the rack in my cart.", "The dirty green hat on the far left of the foregrounded table."]}, {"img_path": "cloth_store_1498649_woman_8_6.png", "boxes": [[1, 214, 364, 156], [1296, 248, 79, 163], [1102, 428, 61, 195]], "captions": ["The grey dress hanging in the frontmost rack to the left.", "I am talking about the red, white, and yellow blouse against the back wall.", "The one on the far wall, middle rack."]}, {"img_path": "cloth_store_1416238_woman_7_3.png", "boxes": [[844, 267, 61, 161], [286, 652, 51, 347]], "captions": ["The festive one on the far right of that top row against the wall.", "I like the brown and black one on the rack.  it."]}, {"img_path": "cloth_store_1498649_woman_15_4.png", "boxes": [[262, 229, 82, 108], [145, 247, 271, 472], [1, 257, 219, 513]], "captions": ["The brown jacket on the rack you recommended.", " the one on the rack please.", "Have you got anything like the gray and black shirt on the garment rack, but with short sleeves?"]}, {"img_path": "cloth_store_1416238_woman_18_9.png", "boxes": [[1109, 541, 25, 156], [1357, 872, 33, 35]], "captions": ["Let's put those light blue jeans on the back left wall in my cart.", "I am talking about the black shoes on the right closet. They are in the very most front position."]}, {"img_path": "cloth_store_1498649_woman_17_3.png", "boxes": [[1763, 219, 121, 201]], "captions": [" show me something like that brown jacket on the wall but in denim?"]}, {"img_path": "cloth_store_paul_2_0.png", "boxes": [[1275, 447, 96, 170]], "captions": ["The black one on the right side of the table."]}, {"img_path": "cloth_store_1498649_woman_18_6.png", "boxes": [[737, 310, 20, 174], [781, 291, 53, 175]], "captions": ["I am referring to the dress in the back of the middle rack.", "t the black, grey dress on the back floor rack."]}, {"img_path": "cloth_store_1416238_woman_17_1.png", "boxes": [[902, 598, 82, 250]], "captions": ["The grey pair in the second cubby from the right."]}, {"img_path": "cloth_store_1_11_5.png", "boxes": [[1491, 350, 93, 101]], "captions": ["Oh my bad, I'm talking about that dark greenish one at the very end of this shelf up front."]}, {"img_path": "cloth_store_2_20_10.png", "boxes": [[412, 127, 50, 243], [295, 144, 76, 237], [542, 136, 59, 258], [674, 438, 148, 306]], "captions": ["The blue hoodie on the left closet.", "The brown hoodie in the second cubby from the left.", "No, I am good, thanks.  drop the blue jacket that hangs second from the right in the left-hand cupboard into my cart.", " add the brown trousers in the middle cubbyhole to my cart."]}, {"img_path": "cloth_store_1_3_10.png", "boxes": [[843, 1, 54, 335]], "captions": ["The one in the second left-most cubicle."]}, {"img_path": "cloth_store_1416238_woman_11_2.png", "boxes": [[1047, 611, 48, 260]], "captions": ["The one by the pink sweater in the middle rack."]}, {"img_path": "cloth_store_2_7_11.png", "boxes": [[1132, 152, 58, 202]], "captions": [" the one on the rack next to the grey one."]}, {"img_path": "cloth_store_1_10_4.png", "boxes": [[1399, 244, 17, 150], [1826, 515, 271, 232]], "captions": ["The blue one on the right wall.", "Oh, North Lodge, everybody wears that brand, no thanks. I'll just take that dirty green hat on the table that's been catching my eye."]}, {"img_path": "cloth_store_2_11_3.png", "boxes": [[1783, 1, 118, 349]], "captions": ["I am talking about the right-most red and white jacket on the right closet."]}, {"img_path": "cloth_store_1498649_woman_17_2.png", "boxes": [[249, 437, 183, 320], [710, 343, 337, 535]], "captions": ["The brown one on the left wall, on that low rack.", " put the black jacket at the front left of the wall in my cart?"]}, {"img_path": "cloth_store_1416238_woman_18_11.png", "boxes": [[102, 334, 166, 245]], "captions": ["The white and black blouse hanging up in the cubby."]}, {"img_path": "cloth_store_paul_3_9.png", "boxes": [[1167, 406, 88, 160]], "captions": [" the grey trousers in the left closet to my cart for me."]}, {"img_path": "cloth_store_1416238_woman_6_5.png", "boxes": [[825, 392, 53, 259]], "captions": ["The dark gray one hanging at the far left of the cabinet next to the pink sweater."]}, {"img_path": "cloth_store_1498649_woman_17_7.png", "boxes": [[1025, 468, 99, 173]], "captions": ["The wall in front on the bottom right, what sizes does that blouse come in?"]}, {"img_path": "cloth_store_1416238_woman_6_4.png", "boxes": [[1656, 180, 171, 279], [1385, 285, 91, 171], [1023, 816, 142, 184]], "captions": ["The violet blouse hanging on the right wall.", "Do you have any tops with a similar pattern as that short-sleeve gray and white one at the top left of the right wall.", " give me the price and rating for that one dress on the rack?"]}, {"img_path": "cloth_store_paul_12_11.png", "boxes": [[1535, 418, 72, 140]], "captions": ["What do you have similar to the light grey jacket on the left side of the rack at the back?"]}, {"img_path": "cloth_store_1498649_woman_6_1.png", "boxes": [[479, 288, 82, 153]], "captions": ["The one hanging up on the wall on the left side of the room."]}, {"img_path": "cloth_store_1416238_woman_9_2.png", "boxes": [[727, 851, 138, 73]], "captions": ["The brown shirt on the bottom of the table."]}, {"img_path": "cloth_store_2_6_0.png", "boxes": [[440, 413, 67, 275]], "captions": [" these black and blue ones at the bottom shelf."]}, {"img_path": "cloth_store_1_18_5.png", "boxes": [[1375, 394, 133, 128]], "captions": [" add the green trousers in the third-from-right cubby hole on the bottom row of cubby holes to my cart."]}, {"img_path": "cloth_store_1498649_woman_5_7.png", "boxes": [[717, 337, 140, 321]], "captions": ["That violet one hanging in the back on the second rack."]}, {"img_path": "cloth_store_1_10_9.png", "boxes": [[536, 702, 111, 52]], "captions": ["The golden shoes. The second right-most shoes in the bottom row of the left closet."]}, {"img_path": "cloth_store_paul_16_8.png", "boxes": [[316, 601, 129, 187]], "captions": ["The brown coat on the front side of the rack on the left."]}, {"img_path": "cloth_store_2_15_10.png", "boxes": [[712, 114, 79, 248], [854, 307, 20, 128]], "captions": ["I am referring to the black and white shirt on the display.", " something with the same color and available sizes as the brown coat on the rack at the back in front of the mirror."]}, {"img_path": "cloth_store_2_16_2.png", "boxes": [[409, 1, 177, 403]], "captions": ["The third coat on the top left cubicle. It is colored black."]}, {"img_path": "cloth_store_3_2_5.png", "boxes": [[912, 653, 66, 134]], "captions": ["Ok, no worries, I think I'm set on that blue one in the front rack actually, can't go wrong with blue.  add that to my cart?"]}, {"img_path": "cloth_store_paul_19_4.png", "boxes": [[1395, 442, 47, 84], [700, 454, 101, 190]], "captions": ["The blue jeans in the back closet. It is the right-most pant there.", "The one on the rack on the left."]}, {"img_path": "cloth_store_paul_2_6.png", "boxes": [[801, 481, 98, 26]], "captions": ["The green hoodie on the center rack."]}, {"img_path": "cloth_store_3_6_1.png", "boxes": [[1209, 470, 40, 64]], "captions": ["I would like to find something like the brown one on the right wall with similar reviews but higher in price."]}, {"img_path": "cloth_store_paul_19_9.png", "boxes": [[1459, 324, 32, 88], [1121, 430, 33, 81], [895, 445, 70, 144]], "captions": ["The black coat on the wall.", "The ones on the middle set of shelves.", "Do you have something similar to the grey coat on the rack on the front left but plain and with good reviews?"]}, {"img_path": "cloth_store_1_8_0.png", "boxes": [[1004, 129, 152, 274]], "captions": ["The light grey coat by itself in the top right cubby."]}, {"img_path": "cloth_store_2_12_3.png", "boxes": [[809, 173, 29, 206], [878, 228, 23, 139], [1587, 213, 49, 145]], "captions": ["The light grey jacket on the left wall.", "The brown coat on the left, the one in the second cubby from the back of the room.", "Hmm, yeah, the one in the second to last compartment on the right."]}, {"img_path": "cloth_store_1416238_woman_9_6.png", "boxes": [[1, 242, 136, 477], [1762, 242, 122, 430]], "captions": ["Let's add the black blouse from the left wall to my cart.", "Let's put one of the black blouses from the right wall in my cart as well."]}, {"img_path": "cloth_store_1416238_woman_8_11.png", "boxes": [[127, 183, 137, 475], [1445, 823, 40, 106], [1836, 961, 46, 42]], "captions": [" another one of that coat in the cubicle too.", "Then can you tell me who makes the black jacket on the rack and what sizes aer still left?", "How much are the ones in the fourth cubicle and what size are they?"]}, {"img_path": "cloth_store_3_6_11.png", "boxes": [[378, 344, 93, 112], [150, 463, 121, 131]], "captions": ["What brand is the black coat on the back wall? Is it a S?", "t the  the light grey jacket at the bottom rack of the center wall."]}, {"img_path": "cloth_store_3_13_0.png", "boxes": [[827, 508, 102, 103]], "captions": ["Oh yeah, t that light grey one hanging up on the right side of the rack right in front of me."]}, {"img_path": "cloth_store_2_10_4.png", "boxes": [[1413, 208, 47, 149], [1061, 403, 52, 80]], "captions": [" the brown hoodie in the back of the top middle shelf on the right wall to my cart..", " the one on the rack to my cart."]}, {"img_path": "cloth_store_2_13_5.png", "boxes": [[333, 25, 95, 260], [607, 83, 66, 211]], "captions": ["What can you show me that costs about the same as the brown hoodie on the top shelf on the left?", "I see. I have decided: I will take the blue jacket that hangs first in the third compartment on the left."]}, {"img_path": "cloth_store_2_12_9.png", "boxes": [[906, 339, 40, 219], [912, 331, 102, 205]], "captions": ["I like the black coat on the rack, will you add it to my cart?", "The light grey coat on the rack."]}, {"img_path": "cloth_store_3_10_5.png", "boxes": [[864, 324, 55, 94], [574, 412, 90, 214], [1043, 445, 45, 122]], "captions": ["I see a green hoodie behind them along the wall by the window. Do you see anything else like that hoodie?", "Do you have anything like that light gray jacket third from the left on the garment rack in terms of price and brand?", "What is the size of the green hoodie on the bottom row against the wall, and how are its customer reviews?"]}, {"img_path": "cloth_store_2_16_0.png", "boxes": [[1380, 156, 89, 198], [1190, 395, 82, 257]], "captions": ["Also something similar to the grey coat one section over from that in reviews, but  it in blue, and I don't want it too expensive.", "Oh, sorry, the light blue ones two cabinets to the right of the mirror."]}, {"img_path": "cloth_store_2_10_10.png", "boxes": [[223, 153, 42, 154], [520, 99, 42, 258]], "captions": ["The last one on the upper rack.", "The black coat in the far left. It is by itself in the closet cubicle."]}, {"img_path": "cloth_store_1498649_woman_5_2.png", "boxes": [[934, 257, 149, 221]], "captions": [" add the black coat hanging on the wall, second from right on the upper row, to my cart."]}]}